/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GameFramework_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_LOADING_MOVIE                                      "LoadingMovie"
#define CONST_GAMEEVENT_AGGREGATED_DATA                          10000
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_TIMEALIVE              10001
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_KILLS                  10002
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_DEATHS                 10003
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_MATCH_WON              10004
#define CONST_GAMEEVENT_AGGREGATED_PLAYER_ROUND_WON              10005

    CVT_4to3_Full                                      = 3,
    CVT_4to3_HorizSplit                                = 4,
    CVT_4to3_VertSplit                                 = 5,
    CVT_MAX                                            = 6
};

// Enum GameFramework.MobileInputZone.EZoneType
enum EZoneType
{
    ZoneType_Button                                    = 0,
    ZoneType_Joystick                                  = 1,
    ZoneType_Trackball                                 = 2,
    ZoneType_Slider                                    = 3,
    ZoneType_MAX                                       = 4
};

// Enum GameFramework.MobileInputZone.EZoneState
enum EZoneState
{
    ZoneState_Inactive                                 = 0,
    ZoneState_Activating                               = 1,
    ZoneState_Active                                   = 2,
    ZoneState_Deactivating                             = 3,
    ZoneState_MAX                                      = 4
};

// Enum GameFramework.MobileInputZone.EZoneTouchEvent
enum EZoneTouchEvent
{
    ZoneEvent_Touch                                    = 0,
    ZoneEvent_Update                                   = 1,
    ZoneEvent_Stationary                               = 2,
    ZoneEvent_UnTouch                                  = 3,
    ZoneEvent_Cancelled                                = 4,
    ZoneEvent_MAX                                      = 5
};

// Enum GameFramework.MobileInputZone.EZoneSlideType
enum EZoneSlideType
{
    ZoneSlide_UpDown                                   = 0,
    ZoneSlide_LeftRight                                = 1,
    ZoneSlide_MAX                                      = 2
};

// Enum GameFramework.MobileMenuImage.MenuImageDrawStyle
enum MenuImageDrawStyle
{
    IDS_Normal                                         = 0,
    IDS_Stretched                                      = 1,
    IDS_Tile                                           = 2,
    IDS_MAX                                            = 3
};

// Enum GameFramework.MobilePlayerInput.EUIOrientation
enum EUIOrientation
{
    UI_Unknown                                         = 0,
    UI_Portait                                         = 1,
    UI_PortaitUpsideDown                               = 2,
    UI_LandscapeRight                                  = 3,
    UI_LandscapeLeft                                   = 4,
    UI_MAX                                             = 5
};

// Enum GameFramework.SeqEvent_HudRenderText.ETextDrawMethod
enum ETextDrawMethod
{
    DRAW_CenterText                                    = 0,
    DRAW_WrapText                                      = 1,
    DRAW_MAX                                           = 2
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class GameFramework.GamePawn
// 0x0004 (0x0480 - 0x047C)
class AGamePawn : public APawn
{
public:
    unsigned long                                      bLastHitWasHeadShot : 1;                                  // 0x047C (0x0004) [0x0000000000002020] [0x00000001] ( CPF_Net | CPF_Transient )
    unsigned long                                      bRespondToExplosions : 1;                                 // 0x047C (0x0004) [0x0000000000000000] [0x00000002] 

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 48 ];

        return pClassPointer;
    };

    void ReattachMeshWithoutBeingSeen ( );
    void ReattachMesh ( );
    void eventUpdateShadowSettings ( unsigned long bInWantShadow );
};

// Class GameFramework.DynamicSpriteComponent
// 0x0040 (0x0244 - 0x0204)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
    struct FInterpCurveFloat                           AnimatedScale;                                            // 0x0204 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    struct FInterpCurveLinearColor                     AnimatedColor;                                            // 0x0214 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    struct FInterpCurveVector2D                        AnimatedPosition;                                         // 0x0224 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    struct FVector                                     LocationOffset;                                           // 0x0234 (0x000C) [0x0000000000000001]              ( CPF_Edit )
    int                                                LoopCount;                                                // 0x0240 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1259 ];

        return pClassPointer;
    };

};

// Class GameFramework.FrameworkGame
// 0x000C (0x0384 - 0x0378)
class AFrameworkGame : public AGameInfo
{
public:
    TArray< struct FRequiredMobileInputConfig >        RequiredMobileInputConfigs;                               // 0x0378 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1260 ];

        return pClassPointer;
    };

    void eventTgGetSpectators ( TArray< struct FString >* List );
    void eventTgChangeTime ( int nSeconds );
    void eventTgChangeScore ( int nTeam, int nCount );
    void eventTgTimer ( struct FString* sTimerCommand );
    void eventTgEndGame ( struct FString* Reason );
    void eventTgStartGame ( struct FString* Reason );
};

// Class GameFramework.GameAIController
// 0x006C (0x040C - 0x03A0)
class AGameAIController : public AAIController
{
public:
    class UAITree*                                     AITree;                                                   // 0x03A0 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
    struct FAITreeHandle                               AITreeHandle;                                             // 0x03A4 (0x0030) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    unsigned long                                      bUseAITree : 1;                                           // 0x03D4 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
    unsigned long                                      bHasRunawayCommandList : 1;                               // 0x03D4 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
    unsigned long                                      bAILogging : 1;                                           // 0x03D4 (0x0004) [0x0000000000004001] [0x00000004] ( CPF_Edit | CPF_Config )
    unsigned long                                      bAILogToWindow : 1;                                       // 0x03D4 (0x0004) [0x0000000000004001] [0x00000008] ( CPF_Edit | CPF_Config )
    unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x03D4 (0x0004) [0x0000000000004001] [0x00000010] ( CPF_Edit | CPF_Config )
    unsigned long                                      bMapBasedLogName : 1;                                     // 0x03D4 (0x0004) [0x0000000000004001] [0x00000020] ( CPF_Edit | CPF_Config )
    unsigned long                                      bAIDrawDebug : 1;                                         // 0x03D4 (0x0004) [0x0000000000004001] [0x00000040] ( CPF_Edit | CPF_Config )
    unsigned long                                      bAIBroken : 1;                                            // 0x03D4 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
    class UGameAICommand*                              CommandList;                                              // 0x03D8 (0x0004) [0x0000000004002003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_EditInline )
    class AFileLog*                                    AILogFile;                                                // 0x03DC (0x0004) [0x0000000000002000]              ( CPF_Transient )
    float                                              DebugTextMaxLen;                                          // 0x03E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    TArray< struct FAICmdHistoryItem >                 CommandHistory;                                           // 0x03E4 (0x000C) [0x0000000000402003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_NeedCtorLink )
    int                                                CommandHistoryNum;                                        // 0x03F0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
    TArray< struct FName >                             AILogFilter;                                              // 0x03F4 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
    struct FString                                     DemoActionString;                                         // 0x0400 (0x000C) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1261 ];

        return pClassPointer;
    };

    struct FString eventGetActionString ( );
    void SetDesiredRotation ( struct FRotator TargetDesiredRotation, unsigned long InLockDesiredRotation, unsigned long InUnlockWhenReached, float InterpolationTime );
    void eventAILog_Internal ( struct FString LogText, struct FName LogCategory, unsigned long bForce );
    void RecordDemoAILog ( struct FString LogText );
    void eventDestroyed ( );
    void ReachedIntermediateMoveGoal ( );
    void ReachedMoveGoal ( );
    float GetDestinationOffset ( );
    class UGameAICommand* GetAICommandInStack ( class UClass* InClass );
    class UGameAICommand* FindCommandOfClass ( class UClass* SearchClass );
    void DumpCommandStack ( );
    void CheckCommandCount ( );
    class UGameAICommand* GetActiveCommand ( );
    bool AbortCommand ( class UGameAICommand* AbortCmd, class UClass* AbortClass );
    void PopCommand ( class UGameAICommand* ToBePoppedCommand );
    void PushCommand ( class UGameAICommand* NewCommand );
    void AllCommands ( class UClass* BaseClass, class UGameAICommand** Cmd );
};

// Class GameFramework.GameAICommand
// 0x001C (0x0058 - 0x003C)
class UGameAICommand : public UAICommandBase
{
public:
    class UGameAICommand*                              ChildCommand;                                             // 0x003C (0x0004) [0x0000000004002003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_EditInline )
    struct FName                                       ChildStatus;                                              // 0x0040 (0x0008) [0x0000000000002003]              ( CPF_Edit | CPF_Const | CPF_Transient )
    class AGameAIController*                           GameAIOwner;                                              // 0x0048 (0x0004) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
    struct FName                                       Status;                                                   // 0x004C (0x0008) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
    unsigned long                                      bAllowNewSameClassInstance : 1;                           // 0x0054 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bReplaceActiveSameClassInstance : 1;                      // 0x0054 (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bAborted : 1;                                             // 0x0054 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
    unsigned long                                      bIgnoreNotifies : 1;                                      // 0x0054 (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bIgnoreStepAside : 1;                                     // 0x0054 (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      bPendingPop : 1;                                          // 0x0054 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1262 ];

        return pClassPointer;
    };

    struct FString eventGetDebugVerboseText ( );
    void GetDebugOverheadText ( class APlayerController* PC, TArray< struct FString >* OutText );
    void eventDrawDebug ( class AHUD* H, struct FName Category );
    struct FString eventGetDumpString ( );
    void Resumed ( struct FName OldCommandName );
    void Paused ( class UGameAICommand* NewCommand );
    void Popped ( );
    void Pushed ( );
    void PostPopped ( );
    void PrePushed ( class AGameAIController* AI );
    bool AllowStateTransitionTo ( struct FName StateName );
    bool AllowTransitionTo ( class UClass* AttemptCommand );
    void Tick ( float DeltaTime );
    bool ShouldIgnoreNotifies ( );
    void eventInternalTick ( float DeltaTime );
    void eventInternalResumed ( struct FName OldCommandName );
    void eventInternalPaused ( class UGameAICommand* NewCommand );
    void eventInternalPopped ( );
    void eventInternalPushed ( );
    void eventInternalPrePushed ( class AGameAIController* AI );
    bool InitCommand ( class AGameAIController* AI );
    bool InitCommandUserActor ( class AGameAIController* AI, class AActor* UserActor );
};

// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x0210 - 0x0210)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1263 ];

        return pClassPointer;
    };

};

// Class GameFramework.GameCrowdAgent
// 0x01E4 (0x03C8 - 0x01E4)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
    class UGameCrowdGroup*                             MyGroup;                                                  // 0x01E4 (0x0004) [0x0000000000000000]              
    struct FVector                                     PreferredVelocity;                                        // 0x01E8 (0x000C) [0x0000000000000000]              
    float                                              AvoidanceShare;                                           // 0x01F4 (0x0004) [0x0000000000000000]              
    class AGameCrowdDestination*                       CurrentDestination;                                       // 0x01F8 (0x0004) [0x0000000000000000]              
    class AGameCrowdDestination*                       BehaviorDestination;                                      // 0x01FC (0x0004) [0x0000000000000000]              
    class AGameCrowdDestination*                       PreviousDestination;                                      // 0x0200 (0x0004) [0x0000000000000000]              
    struct FVector                                     ExternalForce;                                            // 0x0204 (0x000C) [0x0000000000000000]              
    float                                              InterpZTranslation;                                       // 0x0210 (0x0004) [0x0000000000000000]              
    int                                                Health;                                                   // 0x0214 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DeadBodyDuration;                                         // 0x0218 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x021C (0x0004) [0x00000000040A000A]              ( CPF_Const | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
    int                                                ConformTraceFrameCount;                                   // 0x0220 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    int                                                AwareUpdateFrameCount;                                    // 0x0224 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    TArray< class AActor* >                            NearbyDynamics;                                           // 0x0228 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
    TArray< class AGameCrowdForcePoint* >              RelevantAttractors;                                       // 0x0234 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
    unsigned long                                      bUniformScale : 1;                                        // 0x0240 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bCheckForObstacles : 1;                                   // 0x0240 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      bUseNavMeshPathing : 1;                                   // 0x0240 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
    unsigned long                                      bWantsSeePlayerNotification : 1;                          // 0x0240 (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bAllowPitching : 1;                                       // 0x0240 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
    unsigned long                                      bHitObstacle : 1;                                         // 0x0240 (0x0004) [0x0000000000000000] [0x00000020] 
    unsigned long                                      bBadHitNormal : 1;                                        // 0x0240 (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      bSimulateThisTick : 1;                                    // 0x0240 (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      bClampMovementSpeed : 1;                                  // 0x0240 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
    unsigned long                                      bPotentialEncounter : 1;                                  // 0x0240 (0x0004) [0x0000000000000000] [0x00000200] 
    unsigned long                                      bIsPanicked : 1;                                          // 0x0240 (0x0004) [0x0000000000000000] [0x00000400] 
    unsigned long                                      bWantsGroupIdle : 1;                                      // 0x0240 (0x0004) [0x0000000000000000] [0x00000800] 
    unsigned long                                      bPreferVisibleDestination : 1;                            // 0x0240 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
    unsigned long                                      bPreferVisibleDestinationOnSpawn : 1;                     // 0x0240 (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
    unsigned long                                      bHasNotifiedSpawner : 1;                                  // 0x0240 (0x0004) [0x0000000000000000] [0x00004000] 
    unsigned long                                      bIsInSpawnPool : 1;                                       // 0x0240 (0x0004) [0x0000000000000000] [0x00008000] 
    unsigned char                                      ConformType;                                              // 0x0244 (0x0001) [0x0000000000000001]              ( CPF_Edit )
    float                                              ConformTraceDist;                                         // 0x0248 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                ConformTraceInterval;                                     // 0x024C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                CurrentConformTraceInterval;                              // 0x0250 (0x0004) [0x0000000000000000]              
    float                                              LastGroundZ;                                              // 0x0254 (0x0004) [0x0000000000000000]              
    float                                              AwareRadius;                                              // 0x0258 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                AwareUpdateInterval;                                      // 0x025C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              AvoidOtherStrength;                                       // 0x0260 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              AvoidPlayerStrength;                                      // 0x0264 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              AvoidOtherRadius;                                         // 0x0268 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              GroupAttractionStrength;                                  // 0x026C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MatchVelStrength;                                         // 0x0270 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              FollowPathStrength;                                       // 0x0274 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              VelocityDamping;                                          // 0x0278 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              RotateToTargetSpeed;                                      // 0x027C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MaxYawRate;                                               // 0x0280 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    struct FVector                                     MeshMinScale3D;                                           // 0x0284 (0x000C) [0x0000000000000001]              ( CPF_Edit )
    struct FVector                                     MeshMaxScale3D;                                           // 0x0290 (0x000C) [0x0000000000000001]              ( CPF_Edit )
    float                                              EyeZOffset;                                               // 0x029C (0x0004) [0x0000000000000000]              
    float                                              ProximityLODDist;                                         // 0x02A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              VisibleProximityLODDist;                                  // 0x02A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    struct FVector                                     LastKnownGoodPosition;                                    // 0x02A8 (0x000C) [0x0000000000000000]              
    float                                              GroundOffset;                                             // 0x02B4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    struct FVector                                     IntermediatePoint;                                        // 0x02B8 (0x000C) [0x0000000000000000]              
    struct FVector                                     SearchExtent;                                             // 0x02C4 (0x000C) [0x0000000000000000]              
    class UClass*                                      NavigationHandleClass;                                    // 0x02D0 (0x0004) [0x0000000000000000]              
    class UNavigationHandle*                           NavigationHandle;                                         // 0x02D4 (0x0004) [0x0000000000000000]              
    int                                                ObstacleCheckCount;                                       // 0x02D8 (0x0004) [0x0000000000000000]              
    float                                              WalkableFloorZ;                                           // 0x02DC (0x0004) [0x0000000000000000]              
    float                                              LastPathingAttempt;                                       // 0x02E0 (0x0004) [0x0000000000000000]              
    float                                              LastUpdateTime;                                           // 0x02E4 (0x0004) [0x0000000000000000]              
    float                                              NotVisibleLifeSpan;                                       // 0x02E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              NotVisibleTickScalingFactor;                              // 0x02EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class AGameCrowdAgent*                             MyArchetype;                                              // 0x02F0 (0x0004) [0x0000000000000000]              
    float                                              MaxWalkingSpeed;                                          // 0x02F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MaxRunningSpeed;                                          // 0x02F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MaxSpeed;                                                 // 0x02FC (0x0004) [0x0000000000000000]              
    TArray< struct FRecentInteraction >                RecentInteractions;                                       // 0x0300 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              BeaconMaxDist;                                            // 0x030C (0x0004) [0x0000000000000000]              
    struct FVector                                     BeaconOffset;                                             // 0x0310 (0x000C) [0x0000000000000000]              
    class UTexture2D*                                  BeaconTexture;                                            // 0x031C (0x0004) [0x0000000000000002]              ( CPF_Const )
    struct FLinearColor                                BeaconColor;                                              // 0x0320 (0x0010) [0x0000000000000002]              ( CPF_Const )
    class USoundCue*                                   AmbientSoundCue;                                          // 0x0330 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UAudioComponent*                             AmbientSoundComponent;                                    // 0x0334 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UGameCrowdAgentBehavior*                     CurrentBehavior;                                          // 0x0338 (0x0004) [0x0000000000000000]              
    TArray< struct FBehaviorEntry >                    EncounterAgentBehaviors;                                  // 0x033C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FBehaviorEntry >                    SeePlayerBehaviors;                                       // 0x0348 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              MaxSeePlayerDistSq;                                       // 0x0354 (0x0004) [0x0000000000000000]              
    float                                              SeePlayerInterval;                                        // 0x0358 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    TArray< struct FBehaviorEntry >                    SpawnBehaviors;                                           // 0x035C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FBehaviorEntry >                    PanicBehaviors;                                           // 0x0368 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FBehaviorEntry >                    RandomBehaviors;                                          // 0x0374 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FBehaviorEntry >                    TakeDamageBehaviors;                                      // 0x0380 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              RandomBehaviorInterval;                                   // 0x038C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              ForceUpdateTime;                                          // 0x0390 (0x0004) [0x0000000000000000]              
    float                                              ReachThreshold;                                           // 0x0394 (0x0004) [0x0000000000000000]              
    TArray< struct FBehaviorEntry >                    GroupWaitingBehaviors;                                    // 0x0398 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              DesiredGroupRadius;                                       // 0x03A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DesiredGroupRadiusSq;                                     // 0x03A8 (0x0004) [0x0000000000000000]              
    float                                              MaxLOSLifeDistanceSq;                                     // 0x03AC (0x0004) [0x0000000000000000]              
    class UGameCrowdSpawnerInterface*                  MySpawner;                                                // 0x03B0 (0x0008) [0x0000000000000000]              
    unsigned char                                      UnknownData00[ 0x4 ];                                     // 0x03B4 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
    struct FVector                                     SpawnOffset;                                              // 0x03B8 (0x000C) [0x0000000000000000]              
    float                                              InitialLastRenderTime;                                    // 0x03C4 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1264 ];

        return pClassPointer;
    };

    struct FString GetBehaviorString ( );
    struct FString GetDestString ( );
    void eventPostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
    void NativePostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
    struct FVector eventGeneratePathToActor ( class AActor* Goal, float WithinDistance, unsigned long bAllowPartialPath );
    void eventInitNavigationHandle ( );
    void eventOverlappedActorEvent ( class AActor* A );
    void TakeDamage ( int DamageAmount, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
    void eventFireDeathEvent ( );
    void PlayDeath ( struct FVector KillMomentum );
    void eventUpdateIntermediatePoint ( class AActor* DestinationActor );
    bool CalcCamera ( float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
    bool IsIdle ( );
    void SetCurrentBehavior ( class UGameCrowdAgentBehavior* BehaviorArchetype );
    void eventStopBehavior ( );
    void ActivateInstancedBehavior ( class UGameCrowdAgentBehavior* NewBehaviorObject );
    void eventActivateBehavior ( class UGameCrowdAgentBehavior* NewBehaviorArchetype, class AActor* LookAtActor );
    void ResetSeePlayer ( );
    void TryRandomBehavior ( );
    void eventNotifySeePlayer ( class APlayerController* PC );
    void PlaySpawnBehavior ( );
    void eventHandlePotentialAgentEncounter ( );
    void eventStopIdleAnimation ( );
    void eventPlayIdleAnimation ( );
    void OnPlayAgentAnimation ( class USeqAct_PlayAgentAnimation* Action );
    void InitializeAgent ( class AActor* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup, float AgentWarmupTime, unsigned long bWarmupPosition, unsigned long bCheckWarmupVisibility );
    void SetLighting ( unsigned long bEnableLightEnvironment, struct FLightingChannelContainer AgentLightingChannel, unsigned long bCastShadows );
    void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
    void Destroyed ( );
    void ResetPooledAgent ( );
    void eventKillAgent ( );
    void PostBeginPlay ( );
    void SetMaxSpeed ( );
    void eventSetCurrentDestination ( class AGameCrowdDestination* NewDest );
    void eventWaitForGroupMembers ( );
    bool PickBehaviorFrom ( TArray< struct FBehaviorEntry > BehaviorList, struct FVector BestCameraLoc );
    void eventSetPanic ( class AActor* PanicActor, unsigned long bNewPanic );
    bool IsPanicked ( );
    void eventFellOutOfWorld ( class UClass* dmgType );
};

// Class GameFramework.GameCrowdAgentSkeletal
// 0x0080 (0x0448 - 0x03C8)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
    class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x03C8 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAnimNodeBlend*                              SpeedBlendNode;                                           // 0x03CC (0x0004) [0x0000000000000000]              
    class UAnimNodeSlot*                               FullBodySlot;                                             // 0x03D0 (0x0004) [0x0000000000000000]              
    class UAnimNodeSequence*                           ActionSeqNode;                                            // 0x03D4 (0x0004) [0x0000000000000000]              
    class UAnimNodeSequence*                           WalkSeqNode;                                              // 0x03D8 (0x0004) [0x0000000000000000]              
    class UAnimNodeSequence*                           RunSeqNode;                                               // 0x03DC (0x0004) [0x0000000000000000]              
    class UAnimTree*                                   AgentTree;                                                // 0x03E0 (0x0004) [0x0000000000000000]              
    TArray< struct FName >                             WalkAnimNames;                                            // 0x03E4 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FName >                             RunAnimNames;                                             // 0x03F0 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FName >                             IdleAnimNames;                                            // 0x03FC (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< struct FName >                             DeathAnimNames;                                           // 0x0408 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              SpeedBlendStart;                                          // 0x0414 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              SpeedBlendEnd;                                            // 0x0418 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              AnimVelRate;                                              // 0x041C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MaxSpeedBlendChangeSpeed;                                 // 0x0420 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    struct FName                                       MoveSyncGroupName;                                        // 0x0424 (0x0008) [0x0000000000000001]              ( CPF_Edit )
    TArray< struct FGameCrowdAttachmentList >          Attachments;                                              // 0x042C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              MaxTargetAcquireTime;                                     // 0x0438 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    unsigned long                                      bUseRootMotionVelocity : 1;                               // 0x043C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
    unsigned long                                      bIsPlayingIdleAnimation : 1;                              // 0x043C (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bIsPlayingDeathAnimation : 1;                             // 0x043C (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      bAnimateThisTick : 1;                                     // 0x043C (0x0004) [0x0000000000000000] [0x00000008] 
    float                                              MaxAnimationDistance;                                     // 0x0440 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MaxAnimationDistanceSq;                                   // 0x0444 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1265 ];

        return pClassPointer;
    };

    void CreateAttachments ( );
    void eventOnAnimEnd ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
    void eventStopIdleAnimation ( );
    void eventPlayIdleAnimation ( );
    void eventClearLatentAnimation ( );
    void OnPlayAgentAnimation ( class USeqAct_PlayAgentAnimation* Action );
    void SetRootMotion ( unsigned long bRootMotionEnabled );
    void PlayDeath ( struct FVector KillMomentum );
    void SetLighting ( unsigned long bEnableLightEnvironment, struct FLightingChannelContainer AgentLightingChannel, unsigned long bCastShadows );
    void PostBeginPlay ( );
};

// Class GameFramework.GameCrowdAgentBehavior
// 0x0018 (0x0054 - 0x003C)
class UGameCrowdAgentBehavior : public UObject
{
public:
    unsigned long                                      bIdleBehavior : 1;                                        // 0x003C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
    unsigned long                                      bFaceActionTargetFirst : 1;                               // 0x003C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      bIsViralBehavior : 1;                                     // 0x003C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
    unsigned long                                      bPassOnIsViralBehaviorFlag : 1;                           // 0x003C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    unsigned long                                      bIsPanicked : 1;                                          // 0x003C (0x0004) [0x0000000000000000] [0x00000010] 
    class AActor*                                      ActionTarget;                                             // 0x0040 (0x0004) [0x0000000000000000]              
    float                                              MaxPlayerDistance;                                        // 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DurationOfViralBehaviorPropagation;                       // 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              TimeToStopPropagatingViralBehavior;                       // 0x004C (0x0004) [0x0000000000002000]              ( CPF_Transient )
    class AGameCrowdAgent*                             MyAgent;                                                  // 0x0050 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1266 ];

        return pClassPointer;
    };

    bool AllowBehaviorAt ( class AGameCrowdDestination* Destination );
    bool AllowThisDestination ( class AGameCrowdDestination* Destination );
    void eventPropagateViralBehaviorTo ( class AGameCrowdAgent* OtherAgent );
    void ActivatedBy ( class AActor* NewActionTarget );
    class AActor* GetDestinationActor ( );
    void ChangingDestination ( class AGameCrowdDestination* NewDest );
    struct FString GetBehaviorString ( );
    void eventOnAnimEnd ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
    void StopBehavior ( );
    void InitBehavior ( class AGameCrowdAgent* Agent );
    bool HandleMovement ( );
    void eventFinishedTargetRotation ( );
    bool CanBeUsedBy ( class AGameCrowdAgent* Agent, struct FVector CameraLoc );
    void Tick ( float DeltaTime );
    bool ShouldEndIdle ( );
};

// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x002C (0x0080 - 0x0054)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
    TArray< struct FName >                             AnimationList;                                            // 0x0054 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              BlendInTime;                                              // 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              BlendOutTime;                                             // 0x0064 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    unsigned long                                      bUseRootMotion : 1;                                       // 0x0068 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
    unsigned long                                      bLookAtPlayer : 1;                                        // 0x0068 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      bLooping : 1;                                             // 0x0068 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
    unsigned long                                      bBlendBetweenAnims : 1;                                   // 0x0068 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    class AActor*                                      CustomActionTarget;                                       // 0x006C (0x0004) [0x0000000000000000]              
    int                                                LoopIndex;                                                // 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              LoopTime;                                                 // 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class USeqAct_PlayAgentAnimation*                  AnimSequence;                                             // 0x0078 (0x0004) [0x0000000000000000]              
    int                                                AnimationIndex;                                           // 0x007C (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1267 ];

        return pClassPointer;
    };

    struct FString GetBehaviorString ( );
    void StopBehavior ( );
    void PlayAgentAnimationNow ( );
    void eventOnAnimEnd ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
    void SetSequenceOutput ( );
    void eventFinishedTargetRotation ( );
    void InitBehavior ( class AGameCrowdAgent* Agent );
};

// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x000C (0x0060 - 0x0054)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
    class AActor*                                      PanicFocus;                                               // 0x0054 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    float                                              DurationOfPanic;                                          // 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              TimeToStopPanic;                                          // 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1268 ];

        return pClassPointer;
    };

    void Tick ( float DeltaTime );
    struct FString GetBehaviorString ( );
    bool AllowBehaviorAt ( class AGameCrowdDestination* Destination );
    bool AllowThisDestination ( class AGameCrowdDestination* Destination );
    void eventPropagateViralBehaviorTo ( class AGameCrowdAgent* OtherAgent );
    void StopBehavior ( );
    void InitBehavior ( class AGameCrowdAgent* Agent );
    void ActivatedBy ( class AActor* NewActionTarget );
};

// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x0054 - 0x0054)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1269 ];

        return pClassPointer;
    };

    void StopBehavior ( );
    bool ShouldEndIdle ( );
    struct FString GetBehaviorString ( );
    void InitBehavior ( class AGameCrowdAgent* Agent );
};

// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x0008 (0x005C - 0x0054)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
    unsigned long                                      bStoppingBehavior : 1;                                    // 0x0054 (0x0004) [0x0000000000000000] [0x00000001] 
    class AGameCrowdDestinationQueuePoint*             QueuePosition;                                            // 0x0058 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1270 ];

        return pClassPointer;
    };

    void StopBehavior ( );
    bool ShouldEndIdle ( );
    struct FString GetBehaviorString ( );
    class AActor* GetDestinationActor ( );
    void ChangingDestination ( class AGameCrowdDestination* NewDest );
    bool HandleMovement ( );
};

// Class GameFramework.GameCrowdGroup
// 0x000C (0x0048 - 0x003C)
class UGameCrowdGroup : public UObject
{
public:
    TArray< class AGameCrowdAgent* >                   Members;                                                  // 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1271 ];

        return pClassPointer;
    };

    void UpdateDestinations ( class AGameCrowdDestination* NewDestination );
    void RemoveMember ( class AGameCrowdAgent* Agent );
    void AddMember ( class AGameCrowdAgent* Agent );
};

// Class GameFramework.GameCrowdInteractionPoint
// 0x0008 (0x01E8 - 0x01E0)
class AGameCrowdInteractionPoint : public AActor
{
public:
    unsigned long                                      bIsEnabled : 1;                                           // 0x01E0 (0x0004) [0x0000000000000021] [0x00000001] ( CPF_Edit | CPF_Net )
    class UCylinderComponent*                          CylinderComponent;                                        // 0x01E4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1272 ];

        return pClassPointer;
    };

    void OnToggle ( class USeqAct_Toggle* Action );
};

// Class GameFramework.GameCrowdDestination
// 0x0084 (0x026C - 0x01E8)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
    struct FPointer                                    VfTable_IEditorLinkSelectionInterface;                    // 0x01E8 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
    unsigned long                                      bKillWhenReached : 1;                                     // 0x01EC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
    unsigned long                                      bAllowAsPreviousDestination : 1;                          // 0x01EC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      bLastAllowableResult : 1;                                 // 0x01EC (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      bAvoidWhenPanicked : 1;                                   // 0x01EC (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    unsigned long                                      bSkipBehaviorIfPanicked : 1;                              // 0x01EC (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
    unsigned long                                      bFleeDestination : 1;                                     // 0x01EC (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
    unsigned long                                      bMustReachExactly : 1;                                    // 0x01EC (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
    unsigned long                                      bHasRestrictions : 1;                                     // 0x01EC (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      bAllowsSpawning : 1;                                      // 0x01EC (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
    unsigned long                                      bLineSpawner : 1;                                         // 0x01EC (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
    unsigned long                                      bSpawnAtEdge : 1;                                         // 0x01EC (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
    unsigned long                                      bSoftPerimeter : 1;                                       // 0x01EC (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
    unsigned long                                      bIsVisible : 1;                                           // 0x01EC (0x0004) [0x0000000000000000] [0x00001000] 
    unsigned long                                      bWillBeVisible : 1;                                       // 0x01EC (0x0004) [0x0000000000000000] [0x00002000] 
    unsigned long                                      bCanSpawnHereNow : 1;                                     // 0x01EC (0x0004) [0x0000000000000000] [0x00004000] 
    unsigned long                                      bIsBeyondSpawnDistance : 1;                               // 0x01EC (0x0004) [0x0000000000000000] [0x00008000] 
    unsigned long                                      bAdjacentToVisibleNode : 1;                               // 0x01EC (0x0004) [0x0000000000000000] [0x00010000] 
    unsigned long                                      bHasNavigationMesh : 1;                                   // 0x01EC (0x0004) [0x0000000000000000] [0x00020000] 
    TArray< class AGameCrowdDestination* >             NextDestinations;                                         // 0x01F0 (0x000C) [0x0000000000600001]              ( CPF_Edit | CPF_NeedCtorLink )
    class AGameCrowdDestinationQueuePoint*             QueueHead;                                                // 0x01FC (0x0004) [0x0000000000200001]              ( CPF_Edit )
    int                                                Capacity;                                                 // 0x0200 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              Frequency;                                                // 0x0204 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                CustomerCount;                                            // 0x0208 (0x0004) [0x0000000000000000]              
    TArray< class UClass* >                            SupportedAgentClasses;                                    // 0x020C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< class UObject* >                           SupportedArchetypes;                                      // 0x0218 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< class UClass* >                            RestrictedAgentClasses;                                   // 0x0224 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    TArray< class UObject* >                           RestrictedArchetypes;                                     // 0x0230 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              ExactReachTolerance;                                      // 0x023C (0x0004) [0x0000000000000000]              
    struct FName                                       InteractionTag;                                           // 0x0240 (0x0008) [0x0000000000000001]              ( CPF_Edit )
    float                                              InteractionDelay;                                         // 0x0248 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              SpawnRadius;                                              // 0x024C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    TArray< struct FBehaviorEntry >                    ReachedBehaviors;                                         // 0x0250 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    class AGameCrowdAgent*                             AgentEnRoute;                                             // 0x025C (0x0004) [0x0000000000000000]              
    float                                              Priority;                                                 // 0x0260 (0x0004) [0x0000000000000000]              
    float                                              LastSpawnTime;                                            // 0x0264 (0x0004) [0x0000000000000000]              
    class AGameCrowdPopulationManager*                 MyPopMgr;                                                 // 0x0268 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1273 ];

        return pClassPointer;
    };

    void GetSpawnPosition ( class USeqAct_GameCrowdSpawner* Spawner, struct FVector* SpawnPos, struct FRotator* SpawnRot );
    bool eventAllowableDestinationFor ( class AGameCrowdAgent* Agent );
    bool AtCapacity ( );
    void eventIncrementCustomerCount ( class AGameCrowdAgent* ArrivingAgent );
    void eventDecrementCustomerCount ( class AGameCrowdAgent* DepartingAgent );
    void PickNewDestinationFor ( class AGameCrowdAgent* Agent, unsigned long bIgnoreRestrictions );
    void eventReachedDestination ( class AGameCrowdAgent* Agent );
    void Destroyed ( );
    void PostBeginPlay ( );
    bool ReachedByAgent ( class AGameCrowdAgent* Agent, struct FVector TestPosition, unsigned long bTestExactly );
};

// Class GameFramework.GameCrowdDestinationQueuePoint
