/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TribesGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function TribesGame.TrGameObjective.OnUpgradePerformed
// [0x00020800] ( FUNC_Event )
struct ATrGameObjective_eventOnUpgradePerformed_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.AwardUpgradeAssists
// [0x00020000] 
struct ATrGameObjective_execAwardUpgradeAssists_Parms
{
};

// Function TribesGame.TrGameObjective.AwardKillAssists
// [0x00020000] 
struct ATrGameObjective_execAwardKillAssists_Parms
{
};

// Function TribesGame.TrGameObjective.RequiresLOSForRepairDeployable
// [0x00020002] 
struct ATrGameObjective_execRequiresLOSForRepairDeployable_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.Destroyed
// [0x00020102] 
struct ATrGameObjective_execDestroyed_Parms
{
    // class ATrCallIn_SupportItemPlatform*            BasePlatform;                                             // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.HideBasePlatform
// [0x00020102] 
struct ATrGameObjective_execHideBasePlatform_Parms
{
    // class ATrCallIn_SupportItemPlatform*            BasePlatform;                                             // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.InstantlyRegenerateHealth
// [0x00020102] 
struct ATrGameObjective_execInstantlyRegenerateHealth_Parms
{
};

// Function TribesGame.TrGameObjective.IsAliveAndWell
// [0x00020102] 
struct ATrGameObjective_execIsAliveAndWell_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.GetSpectatorDescription
// [0x00020102] 
struct ATrGameObjective_execGetSpectatorDescription_Parms
{
    struct FString                                     ReturnValue;                                              // 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TribesGame.TrGameObjective.GetSpectatorHealthInfo
// [0x00420102] 
struct ATrGameObjective_execGetSpectatorHealthInfo_Parms
{
    int                                                Health;                                                   // 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    int                                                MaxHealth;                                                // 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function TribesGame.TrGameObjective.GiveDestroyAccolade
// [0x00020000] 
struct ATrGameObjective_execGiveDestroyAccolade_Parms
{
    class ATrPlayerController*                         TrPC;                                                     // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.ClearDamageAssistance
// [0x00020002] 
struct ATrGameObjective_execClearDamageAssistance_Parms
{
    unsigned long                                      bOnlyDamagers;                                            // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    // int                                             I;                                                        // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.CheckDestroyAssists
// [0x00020002] 
struct ATrGameObjective_execCheckDestroyAssists_Parms
{
    // int                                             I;                                                        // 0x0000 (0x0004) [0x0000000000000000]              
    // float                                           fNeededAmount;                                            // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.CheckRepairAssists
// [0x00020002] 
struct ATrGameObjective_execCheckRepairAssists_Parms
{
    // int                                             I;                                                        // 0x0000 (0x0004) [0x0000000000000000]              
    // float                                           fNeededAmount;                                            // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.AddDamageAssistance
// [0x00820002] 
struct ATrGameObjective_execAddDamageAssistance_Parms
{
    class ATrPlayerController*                         TrPC;                                                     // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    int                                                DamageAmount;                                             // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // int                                             I;                                                        // 0x0008 (0x0004) [0x0000000000000000]              
    // struct FObjectiveDamageAssist                   assist;                                                   // 0x000C (0x0008) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.AddUpgrader
// [0x00020002] 
struct ATrGameObjective_execAddUpgrader_Parms
{
    class ATrPlayerController*                         Upgrader;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // int                                             I;                                                        // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.PerformUpgrade
// [0x00820002] 
struct ATrGameObjective_execPerformUpgrade_Parms
{
    class ATrPlayerController*                         Purchaser;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // unsigned long                                   bFoundUpgrade;                                            // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
    // int                                             CreditCost;                                               // 0x000C (0x0004) [0x0000000000000000]              
    // int                                             NextLevel;                                                // 0x0010 (0x0004) [0x0000000000000000]              
    // class UTrGameObjectiveUpgrade*                  NewUpgrade;                                               // 0x0014 (0x0004) [0x0000000000000000]              
    // struct FUpgradeSelectionList                    CurrentUpgrade;                                           // 0x0018 (0x0018) [0x0000000000000000]              
    // float                                           HealthRatio;                                              // 0x0030 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.ReceivesPowerFromGenerator
// [0x00020102] 
struct ATrGameObjective_execReceivesPowerFromGenerator_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.ShouldShowHelpText
// [0x00020102] 
struct ATrGameObjective_execShouldShowHelpText_Parms
{
    unsigned char                                      HelpTextType;                                             // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.SpawnHelpTextCollisionProxy
// [0x00020102] 
struct ATrGameObjective_execSpawnHelpTextCollisionProxy_Parms
{
    unsigned char                                      HelpTextType;                                             // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    // class ATrCollisionProxy_HelpText*               SpawnedCollisionProxy;                                    // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.Reset
// [0x00020102] 
struct ATrGameObjective_execReset_Parms
{
};

// Function TribesGame.TrGameObjective.BlocksLineChecksFromSourceActor
// [0x00020902] ( FUNC_Event )
struct ATrGameObjective_eventBlocksLineChecksFromSourceActor_Parms
{
    class AActor*                                      SourceActor;                                              // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class ATrProjectile*                            TrProj;                                                   // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.GetPossessiveInstigatorName
// [0x00420100] 
struct ATrGameObjective_execGetPossessiveInstigatorName_Parms
{
    struct FString                                     PlayerName;                                               // 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    unsigned long                                      ReturnValue;                                              // 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.GetMarker
// [0x00020102] 
struct ATrGameObjective_execGetMarker_Parms
{
    class UTexture2D*                                  ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.PostRenderFor
// [0x00820902] ( FUNC_Event )
struct ATrGameObjective_eventPostRenderFor_Parms
{
    class APlayerController*                           PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UCanvas*                                     Canvas;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     CameraPosition;                                           // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     CameraDir;                                                // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    // unsigned long                                   isFriendly;                                               // 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
    // unsigned long                                   showingMarkers;                                           // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
    // float                                           MaxOffset;                                                // 0x0028 (0x0004) [0x0000000000000000]              
    // float                                           projectedHeight;                                          // 0x002C (0x0004) [0x0000000000000000]              
    // struct FString                                  DisplayName;                                              // 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    // class UTexture2D*                               Marker;                                                   // 0x003C (0x0004) [0x0000000000000000]              
    // class ATrDevice*                                trDev;                                                    // 0x0040 (0x0004) [0x0000000000000000]              
    // class ATrHUD*                                   HUD;                                                      // 0x0044 (0x0004) [0x0000000000000000]              
    // struct FVector                                  ScreenLoc;                                                // 0x0048 (0x000C) [0x0000000000000000]              
    // struct FVector                                  screenLocBot;                                             // 0x0054 (0x000C) [0x0000000000000000]              
    // struct FVector                                  vMarkerOffset;                                            // 0x0060 (0x000C) [0x0000000000000000]              
    // struct FVector                                  NamePlacement;                                            // 0x006C (0x000C) [0x0000000000000000]              
    // struct FString                                  InstigatorPlayerName;                                     // 0x0078 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    // class ATrPawn*                                  TRP;                                                      // 0x0084 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.ShouldPostRenderForCaH
// [0x00020102] 
struct ATrGameObjective_execShouldPostRenderForCaH_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.TimerDestroy
// [0x00020102] 
struct ATrGameObjective_execTimerDestroy_Parms
{
};

// Function TribesGame.TrGameObjective.HideMesh
// [0x00020102] 
struct ATrGameObjective_execHideMesh_Parms
{
    // class UMeshComponent*                           ComponentIt;                                              // 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function TribesGame.TrGameObjective.OnPowerStatusChanged
// [0x00020102] 
struct ATrGameObjective_execOnPowerStatusChanged_Parms
{
};

// Function TribesGame.TrGameObjective.SetPowered
// [0x00020002] 
struct ATrGameObjective_execSetPowered_Parms
{
    unsigned long                                      bEnabled;                                                 // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.PlayExplosion
// [0x00020102] 
struct ATrGameObjective_execPlayExplosion_Parms
{
    // class AUTEmitter*                               Explosion;                                                // 0x0000 (0x0004) [0x0000000000000000]              
    // class UUDKExplosionLight*                       L;                                                        // 0x0004 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
    // float                                           Dist;                                                     // 0x0008 (0x0004) [0x0000000000000000]              
    // float                                           ShakeScale;                                               // 0x000C (0x0004) [0x0000000000000000]              
    // class ATrPlayerController*                      TrPC;                                                     // 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.PlayDamageShieldEffects
// [0x00020102] 
struct ATrGameObjective_execPlayDamageShieldEffects_Parms
{
};

// Function TribesGame.TrGameObjective.PlayDamageHealthEffects
// [0x00020100] 
struct ATrGameObjective_execPlayDamageHealthEffects_Parms
{
    int                                                DamageAmount;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    int                                                HitBoneIndex;                                             // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.OnHealthChanged
// [0x00020102] 
struct ATrGameObjective_execOnHealthChanged_Parms
{
    unsigned long                                      wasDamage;                                                // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.PlayDestroyedEffects
// [0x00020102] 
struct ATrGameObjective_execPlayDestroyedEffects_Parms
{
};

// Function TribesGame.TrGameObjective.ClientPlayUpgradeEffect
// [0x00020102] 
struct ATrGameObjective_execClientPlayUpgradeEffect_Parms
{
};

// Function TribesGame.TrGameObjective.ClientRecievedHitInfo
// [0x00020902] ( FUNC_Event )
struct ATrGameObjective_eventClientRecievedHitInfo_Parms
{
};

// Function TribesGame.TrGameObjective.TakeDamage
// [0x00824902] ( FUNC_Event )
struct ATrGameObjective_eventTakeDamage_Parms
{
    int                                                DamageAmount;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Momentum;                                                 // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FTraceHitInfo                               HitInfo;                                                  // 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    // class AActor*                                   DamagingActor;                                            // 0x0044 (0x0004) [0x0000000000000000]              
    // unsigned long                                   bIsInstantHitDamage;                                      // 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
    // class ATrDevice*                                DeviceDamager;                                            // 0x004C (0x0004) [0x0000000000000000]              
    // float                                           ColRadius;                                                // 0x0050 (0x0004) [0x0000000000000000]              
    // float                                           ColHeight;                                                // 0x0054 (0x0004) [0x0000000000000000]              
    // float                                           Dist;                                                     // 0x0058 (0x0004) [0x0000000000000000]              
    // struct FVector                                  Dir;                                                      // 0x005C (0x000C) [0x0000000000000000]              
    // struct FVector                                  ShieldDamageNumLocation;                                  // 0x0068 (0x000C) [0x0000000000000000]              
    // class ATrGame*                                  TrG;                                                      // 0x0074 (0x0004) [0x0000000000000000]              
    // class ATrPlayerController*                      TrPCDamager;                                              // 0x0078 (0x0004) [0x0000000000000000]              
    // class ATrGameReplicationInfo*                   TrGRI;                                                    // 0x007C (0x0004) [0x0000000000000000]              
    // int                                             OldShieldHealth;                                          // 0x0080 (0x0004) [0x0000000000000000]              
    // int                                             ShieldAbsorbAmount;                                       // 0x0084 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.DoRepairs
// [0x00020102] 
struct ATrGameObjective_execDoRepairs_Parms
{
    int                                                HealAmount;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FTraceHitInfo                               HitInfo;                                                  // 0x0010 (0x001C) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.RegenerateHealth
// [0x00020002] 
struct ATrGameObjective_execRegenerateHealth_Parms
{
};

// Function TribesGame.TrGameObjective.Shootable
// [0x00020102] 
struct ATrGameObjective_execShootable_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.Tick
// [0x00020902] ( FUNC_Event )
struct ATrGameObjective_eventTick_Parms
{
    float                                              DeltaTime;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // float                                           shieldOpacity;                                            // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATrGameObjective_eventReplicatedEvent_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrGameObjective.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct ATrGameObjective_eventPostBeginPlay_Parms
{
    // class ATrCollisionProxy_PromptText*             SpawnedCollisionProxy;                                    // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.ShouldShowPromptText
// [0x00020102] 
struct ATrGameObjective_execShouldShowPromptText_Parms
{
    class APawn*                                       aPawn;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // int                                             CreditCost;                                               // 0x0008 (0x0004) [0x0000000000000000]              
    // class ATrPlayerController*                      TrPC;                                                     // 0x000C (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.GetUpgradeCost
// [0x00820102] 
struct ATrGameObjective_execGetUpgradeCost_Parms
{
    class ATrPlayerController*                         TrPC;                                                     // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    int                                                ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // float                                           GlobalCostMultiplier;                                     // 0x0008 (0x0004) [0x0000000000000000]              
    // int                                             CreditCost;                                               // 0x000C (0x0004) [0x0000000000000000]              
    // int                                             NextLevel;                                                // 0x0010 (0x0004) [0x0000000000000000]              
    // class ATrGameReplicationInfo*                   TrGRI;                                                    // 0x0014 (0x0004) [0x0000000000000000]              
    // struct FUpgradeSelectionList                    CurrentUpgrade;                                           // 0x0018 (0x0018) [0x0000000000000000]              
    // class ATrPlayerReplicationInfo*                 TrPRI;                                                    // 0x0030 (0x0004) [0x0000000000000000]              
    // class UTrValueModifier*                         VM;                                                       // 0x0034 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.GetShieldHealthAmount
// [0x00020102] 
struct ATrGameObjective_execGetShieldHealthAmount_Parms
{
    float                                              ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.GetHealthAmount
// [0x00020102] 
struct ATrGameObjective_execGetHealthAmount_Parms
{
    float                                              ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.GetSpectatorName
// [0x00020102] 
struct ATrGameObjective_execGetSpectatorName_Parms
{
    struct FString                                     ReturnValue;                                              // 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
    // struct FString                                  TeamName;                                                 // 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function TribesGame.TrGameObjective.GetScreenName
// [0x00020102] 
struct ATrGameObjective_execGetScreenName_Parms
{
    class APlayerController*                           PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FString                                     ReturnValue;                                              // 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function TribesGame.TrGameObjective.ApplyServerSettings
// [0x00020102] 
struct ATrGameObjective_execApplyServerSettings_Parms
{
    // class ATrGameReplicationInfo*                   TrGRI;                                                    // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrGameObjective.IsInLOS_Basic
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ATrGameObjective_execIsInLOS_Basic_Parms
{
    class APawn*                                       TouchedPawn;                                              // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrGameObjective.IsEnemy
// [0x00020400] ( FUNC_Native )
struct ATrGameObjective_execIsEnemy_Parms
{
    class AActor*                                      Target;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.SetPowered
// [0x00020002] 
struct ATrDeployable_execSetPowered_Parms
{
    unsigned long                                      bEnabled;                                                 // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TribesGame.TrDeployable.OnUpgradePerformed
// [0x00020802] ( FUNC_Event )
struct ATrDeployable_eventOnUpgradePerformed_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.CalcOtherWatchingCam
// [0x00C20102] 
struct ATrDeployable_execCalcOtherWatchingCam_Parms
{
    float                                              fDeltaTime;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     out_CamLoc;                                               // 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    struct FRotator                                    out_CamRot;                                               // 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    float                                              out_FOV;                                                  // 0x001C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    class ATrPlayerController*                         WatcherController;                                        // 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FVector                                  CamStart;                                                 // 0x0028 (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitLocation;                                              // 0x0034 (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitNormal;                                                // 0x0040 (0x000C) [0x0000000000000000]              
    // struct FVector                                  CamDirX;                                                  // 0x004C (0x000C) [0x0000000000000000]              
    // struct FVector                                  CamDirY;                                                  // 0x0058 (0x000C) [0x0000000000000000]              
    // struct FVector                                  CamDirZ;                                                  // 0x0064 (0x000C) [0x0000000000000000]              
    // struct FVector                                  CurrentCamOffset;                                         // 0x0070 (0x000C) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.GetPossessiveInstigatorName
// [0x00420102] 
struct ATrDeployable_execGetPossessiveInstigatorName_Parms
{
    struct FString                                     PlayerName;                                               // 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    unsigned long                                      ReturnValue;                                              // 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.ReceivesPowerFromGenerator
// [0x00020102] 
struct ATrDeployable_execReceivesPowerFromGenerator_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class ATrGameReplicationInfo*                   TrGRI;                                                    // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.Destroyed
// [0x00020102] 
struct ATrDeployable_execDestroyed_Parms
{
};

// Function TribesGame.TrDeployable.PulseBackupGenerators
// [0x00020002] 
struct ATrDeployable_execPulseBackupGenerators_Parms
{
    // class ATrDeployable_BackupGenerator*            dep;                                                      // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.PlayFireEffects
// [0x00024100] 
struct ATrDeployable_execPlayFireEffects_Parms
{
    class AWeapon*                                     InWeapon;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bViaReplication;                                          // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function TribesGame.TrDeployable.IncrementFlashCount
// [0x00020102] 
struct ATrDeployable_execIncrementFlashCount_Parms
{
    class AWeapon*                                     W;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned char                                      FireModeNum;                                              // 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    // class ATrSubDevice*                             TurretWeapon;                                             // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.StopsProjectile
// [0x00020102] 
struct ATrDeployable_execStopsProjectile_Parms
{
    class AProjectile*                                 P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class ATrTurretPawn*                            TurretPawn;                                               // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.GetWeaponStartTraceLocation
// [0x00024102] 
struct ATrDeployable_execGetWeaponStartTraceLocation_Parms
{
    class AWeapon*                                     CurrentWeapon;                                            // 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    struct FVector                                     ReturnValue;                                              // 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.OnHealthChanged
// [0x00020102] 
struct ATrDeployable_execOnHealthChanged_Parms
{
    unsigned long                                      wasDamage;                                                // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function TribesGame.TrDeployable.UpdateHealthMaterial
// [0x00020102] 
struct ATrDeployable_execUpdateHealthMaterial_Parms
{
    // float                                           healthPct;                                                // 0x0000 (0x0004) [0x0000000000000000]              
    // int                                             I;                                                        // 0x0004 (0x0004) [0x0000000000000000]              
    // class UMaterialInstanceConstant*                MIC;                                                      // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.IsFiring
// [0x00020102] 
struct ATrDeployable_execIsFiring_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.DeployComplete
// [0x00020102] 
struct ATrDeployable_execDeployComplete_Parms
{
};

// Function TribesGame.TrDeployable.FinalizeDeployment
// [0x00020102] 
struct ATrDeployable_execFinalizeDeployment_Parms
{
    // class ATrPowerGenerator*                        O;                                                        // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.GetDamageRadius
// [0x00020002] 
struct ATrDeployable_execGetDamageRadius_Parms
{
    float                                              ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class ATrPawn*                                  TrPawnOwner;                                              // 0x0004 (0x0004) [0x0000000000000000]              
    // class ATrPlayerReplicationInfo*                 TrPRI;                                                    // 0x0008 (0x0004) [0x0000000000000000]              
    // class UTrValueModifier*                         VM;                                                       // 0x000C (0x0004) [0x0000000000000000]              
    // float                                           DamageRadius;                                             // 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.PostBeginPlay
// [0x00020102] 
struct ATrDeployable_execPostBeginPlay_Parms
{
    // class ATrPawn*                                  POwner;                                                   // 0x0000 (0x0004) [0x0000000000000000]              
    // float                                           DamageRadius;                                             // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.SetInstigatorController
// [0x00020102] 
struct ATrDeployable_execSetInstigatorController_Parms
{
    class ATrPlayerController*                         InstigatorController;                                     // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class ATrPlayerReplicationInfo*                 TrPRI;                                                    // 0x0004 (0x0004) [0x0000000000000000]              
    // class UTrValueModifier*                         VM;                                                       // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.OnPowerStatusChanged
// [0x00020102] 
struct ATrDeployable_execOnPowerStatusChanged_Parms
{
};

// Function TribesGame.TrDeployable.OnVehicleExitedCollisionProxy
// [0x00020000] 
struct ATrDeployable_execOnVehicleExitedCollisionProxy_Parms
{
    class ATrVehicle*                                  V;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.OnVehicleDetectedByCollisionProxy
// [0x00020000] 
struct ATrDeployable_execOnVehicleDetectedByCollisionProxy_Parms
{
    class ATrVehicle*                                  V;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.OnPawnExitedCollisionProxy
// [0x00020000] 
struct ATrDeployable_execOnPawnExitedCollisionProxy_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.OnPawnDetectedByCollisionProxy
// [0x00020000] 
struct ATrDeployable_execOnPawnDetectedByCollisionProxy_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.GetPawnCausingDamage
// [0x00020102] 
struct ATrDeployable_execGetPawnCausingDamage_Parms
{
    class AController*                                 EventInstigator;                                          // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class ATrPawn*                                     ReturnValue;                                              // 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class ATrPawn*                                  P;                                                        // 0x000C (0x0004) [0x0000000000000000]              
    // class ATrProjectile*                            Proj;                                                     // 0x0010 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.TakeDamage
// [0x00824902] ( FUNC_Event )
struct ATrDeployable_eventTakeDamage_Parms
{
    int                                                DamageAmount;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Momentum;                                                 // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FTraceHitInfo                               HitInfo;                                                  // 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    // class AActor*                                   DamagingActor;                                            // 0x0044 (0x0004) [0x0000000000000000]              
    // class ATrPawn*                                  DamagingPawn;                                             // 0x0048 (0x0004) [0x0000000000000000]              
    // float                                           ColRadius;                                                // 0x004C (0x0004) [0x0000000000000000]              
    // float                                           ColHeight;                                                // 0x0050 (0x0004) [0x0000000000000000]              
    // float                                           DamageScale;                                              // 0x0054 (0x0004) [0x0000000000000000]              
    // float                                           Dist;                                                     // 0x0058 (0x0004) [0x0000000000000000]              
    // struct FVector                                  Dir;                                                      // 0x005C (0x000C) [0x0000000000000000]              
    // class ATrPlayerReplicationInfo*                 InstigatorTrPRI;                                          // 0x0068 (0x0004) [0x0000000000000000]              
    // class UTrValueModifier*                         VM;                                                       // 0x006C (0x0004) [0x0000000000000000]              
    // class UClass*                                   DamageWeaponClass;                                        // 0x0070 (0x0004) [0x0000000000000000]              
    // class UClass*                                   TrDamageType;                                             // 0x0074 (0x0004) [0x0000000000000000]              
    // class ATrPawn*                                  TrPawnInstigator;                                         // 0x0078 (0x0004) [0x0000000000000000]              
    // unsigned char                                   InstigatorWeaponEquipPoint;                               // 0x007C (0x0001) [0x0000000000000000]              
    // class ATrProjectile*                            TrProj;                                                   // 0x0080 (0x0004) [0x0000000000000000]              
    // class ATrPlayerReplicationInfo*                 DamagingPawnPRI;                                          // 0x0084 (0x0004) [0x0000000000000000]              
    // class UTrValueModifier*                         DamagingPawnVM;                                           // 0x0088 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.GetBaseDamageMultiplierAgainstArmor
// [0x00020102] 
struct ATrDeployable_execGetBaseDamageMultiplierAgainstArmor_Parms
{
    class UClass*                                      TrDamageType;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.TakeRadiusDamage
// [0x00024102] 
struct ATrDeployable_execTakeRadiusDamage_Parms
{
    class AController*                                 InstigatedBy;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              BaseDamage;                                               // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              DamageRadius;                                             // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              Momentum;                                                 // 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HurtOrigin;                                               // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bFullDamage;                                              // 0x0020 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              DamageFalloffExponent;                                    // 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    // class ATrProjectile*                            Projectile;                                               // 0x002C (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.Tick
// [0x00020902] ( FUNC_Event )
struct ATrDeployable_eventTick_Parms
{
    float                                              DeltaTime;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.OnPRIReplicated
// [0x00020102] 
struct ATrDeployable_execOnPRIReplicated_Parms
{
    // class ATrPlayerController*                      TrPC;                                                     // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ATrDeployable_eventReplicatedEvent_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrDeployable.PostInitAnimTree
// [0x00020902] ( FUNC_Event )
struct ATrDeployable_eventPostInitAnimTree_Parms
{
    class USkeletalMeshComponent*                      SkelComp;                                                 // 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function TribesGame.TrDeployable.ApplyServerSettings
// [0x00020102] 
struct ATrDeployable_execApplyServerSettings_Parms
{
    // class ATrGameReplicationInfo*                   TrGRI;                                                    // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrDeployable.IsInLOS
// [0x00024400] ( FUNC_Native )
struct ATrDeployable_execIsInLOS_Parms
{
    class AActor*                                      TouchedActor;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     StartLocation;                                            // 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     EndLocation;                                              // 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      CheckBlockedByBlockers;                                   // 0x001C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      CheckBlockedByActors;                                     // 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      ReturnValue;                                              // 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.CalcMeshOffset
// [0x00020400] ( FUNC_Native )
struct ATrDeployable_execCalcMeshOffset_Parms
{
    float                                              ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function TribesGame.TrDeployable.AdjustMeshToGround
// [0x00020400] ( FUNC_Native )
struct ATrDeployable_execAdjustMeshToGround_Parms
{
};

// Function TribesGame.TrPawn.AlienFXOverlay
// [0x00020802] ( FUNC_Event )
struct ATrPawn_eventAlienFXOverlay_Parms
{
    unsigned char                                      Type;                                                     // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    // class ATrPlayerController*                      TrPC;                                                     // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrPawn.ClearJetpackParticleEffects
// [0x00020100] 
struct ATrPawn_execClearJetpackParticleEffects_Parms
{
};

// Function TribesGame.TrPawn.ClearSkiParticleEffects
// [0x00020100] 
struct ATrPawn_execClearSkiParticleEffects_Parms
{
};

// Function TribesGame.TrPawn.GetHandsMesh
// [0x00020102] 
struct ATrPawn_execGetHandsMesh_Parms
{
    class UClass*                                      FamilyInfo;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class USkeletalMesh*                               ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class USkeletalMesh*                            HandsMesh;                                                // 0x0008 (0x0004) [0x0000000000000000]              
    // class ATrPlayerReplicationInfo*                 TrPRI;                                                    // 0x000C (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrPawn.ThrowWeaponOnDeath
// [0x00820002] 
struct ATrPawn_execThrowWeaponOnDeath_Parms
{
    // class AWeapon*                                  CurrentItem;                                              // 0x0000 (0x0004) [0x0000000000000000]              
    // class ADroppedPickup*                           Pickup;                                                   // 0x0004 (0x0004) [0x0000000000000000]              
    // struct FRotator                                 POVRot;                                                   // 0x0008 (0x000C) [0x0000000000000000]              
    // struct FVector                                  POVLoc;                                                   // 0x0014 (0x000C) [0x0000000000000000]              
    // struct FVector                                  TossVel;                                                  // 0x0020 (0x000C) [0x0000000000000000]              
    // struct FVector                                  X;                                                        // 0x002C (0x000C) [0x0000000000000000]              
    // struct FVector                                  Y;                                                        // 0x0038 (0x000C) [0x0000000000000000]              
    // struct FVector                                  Z;                                                        // 0x0044 (0x000C) [0x0000000000000000]              
};

// Function TribesGame.TrPawn.ThrowActiveWeapon
// [0x00024000] 
struct ATrPawn_execThrowActiveWeapon_Parms
{
    unsigned long                                      bDestroyWeap;                                             // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function TribesGame.TrPawn.CheckApplyPending3PSkin
// [0x00820102] 
struct ATrPawn_execCheckApplyPending3PSkin_Parms
{
    // int                                             skinId;                                                   // 0x0000 (0x0004) [0x0000000000000000]              
    // class USkeletalMesh*                            New3PSkelMesh;                                            // 0x0004 (0x0004) [0x0000000000000000]              
    // class ATrPlayerReplicationInfo*                 TrPRI;                                                    // 0x0008 (0x0004) [0x0000000000000000]              
    // unsigned long                                   bSafeToApplyPendingSkin;                                  // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
    // unsigned long                                   bContinueTimer;                                           // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
    // class APlayerController*                        LocalPC;                                                  // 0x0014 (0x0004) [0x0000000000000000]              
    // struct FVector                                  ViewLocation;                                             // 0x0018 (0x000C) [0x0000000000000000]              
    // struct FVector                                  ViewToPawn;                                               // 0x0024 (0x000C) [0x0000000000000000]              
    // struct FRotator                                 ViewRotation;                                             // 0x0030 (0x000C) [0x0000000000000000]              
    // class UClass*                                   skinClass;                                                // 0x003C (0x0004) [0x0000000000000000]              
};

// Function TribesGame.TrPawn.SetPending3PSkin
// [0x00020102] 
struct ATrPawn_execSetPending3PSkin_Parms
{
    class UClass*                                      NewPendingSkin;                                           // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function TribesGame.TrPawn.IsFirstPerson
// [0x00020102] 
struct ATrPawn_execIsFirstPerson_Parms
{
    unsigned long                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
