/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: TribesGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_THR_SPINFUSOR                                      1
#define CONST_THR_SMG                                            2
#define CONST_THR_RIFLE                                          3
#define CONST_THR_LOCKED_ON                                      4
#define CONST_THR_CROSSBOW                                       5
#define CONST_THR_FLAME_THROWER                                  6
#define CONST_THR_CHAIN_GUN                                      7
#define CONST_THR_MISSILE                                        8

// Enum TribesGame.TrStormControlPoint.ControlPointState
enum ControlPointState
{
    ControlPointState_Neutral                          = 0,
    ControlPointState_FullyOwnedBE                     = 1,
    ControlPointState_FullyOwnedDS                     = 2,
    ControlPointState_TransitioningToBE                = 3,
    ControlPointState_TransitioningToDS                = 4,
    ControlPointState_MAX                              = 5
};

// Enum TribesGame.TrStreamManager.STREAMTYPE
enum STREAMTYPE
{
    VST_NONE                                           = 0,
    VST_HIREZ                                          = 1,
    VST_TWITCH                                         = 2,
    VST_TRAINING                                       = 3,
    VST_COMMUNITY                                      = 4,
    VST_NEWS                                           = 5,
    VST_MAX                                            = 6
};

// Enum TribesGame.TrVideoSettings.EVideoSettingType
enum EVideoSettingType
{
    EVST_ShadowDetail                                  = 0,
    EVST_TextureDetail                                 = 1,
    EVST_ScreenType                                    = 2,
    EVST_MotionBlur                                    = 3,
    EVST_VerticalSync                                  = 4,
    EVST_AntiAliasing                                  = 5,
    EVST_Resolution                                    = 6,
    EVST_SmoothFramerate                               = 7,
    EVST_MAX                                           = 8
};

// Enum TribesGame.TrVideoSettings.EScreenFrameType
enum EScreenFrameType
{
    ESFT_FullScreen                                    = 0,
    ESFT_Windowed                                      = 1,
    ESFT_Borderless                                    = 2,
    ESFT_MAX                                           = 3
};

// Enum TribesGame.TrVideoSettings.EAntiAliasing
enum EAntiAliasing
{
    EAA_Off                                            = 0,
    EAA_1X                                             = 1,
    EAA_2X                                             = 2,
    EAA_4X                                             = 3,
    EAA_MAX                                            = 4
};

// Enum TribesGame.TrVideoSettings.EVisualDetail
enum EVisualDetail
{
    EVQ_Off                                            = 0,
    EVQ_Low                                            = 1,
    EVQ_Med                                            = 2,
    EVQ_High                                           = 3,
    EVQ_VHigh                                          = 4,
    EVQ_MAX                                            = 5
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class TribesGame.TrGameObjective
// 0x0164 (0x056C - 0x0408)
class ATrGameObjective : public AUTGameObjective
{
public:
    class UTrStatsInterface*                           Stats;                                                    // 0x0408 (0x0004) [0x0000000000000000]              
    struct FRotator                                    CallInRotation;                                           // 0x040C (0x000C) [0x0000000000000000]              
    struct FVector                                     CallInPosition;                                           // 0x0418 (0x000C) [0x0000000000000000]              
    class UDynamicLightEnvironmentComponent*           m_LightEnvironment;                                       // 0x0424 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class USkeletalMeshComponent*                      m_Mesh;                                                   // 0x0428 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UMaterialInstanceConstant*                   m_ObjectiveMIC;                                           // 0x042C (0x0004) [0x0000000000002000]              ( CPF_Transient )
    int                                                r_Health;                                                 // 0x0430 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
    int                                                r_MaxHealth;                                              // 0x0434 (0x0004) [0x0000000000000020]              ( CPF_Net )
    int                                                m_nLastHealth;                                            // 0x0438 (0x0004) [0x0000000000000000]              
    int                                                m_nHealthRegenRate;                                       // 0x043C (0x0004) [0x0000000000000000]              
    struct FVector                                     r_vReplicatedHitInfo;                                     // 0x0440 (0x000C) [0x0000000000000020]              ( CPF_Net )
    int                                                m_nCriticalHealthThreshold;                               // 0x044C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                r_nRepairHealthThreshold;                                 // 0x0450 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
    float                                              m_fShieldHealthPercentage;                                // 0x0454 (0x0004) [0x0000000000000000]              
    class USkeletalMeshComponent*                      m_ShieldMesh;                                             // 0x0458 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UMaterial*                                   m_ShieldMaterial;                                         // 0x045C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UTexture2D*                                  m_ShieldNormalMap;                                        // 0x0460 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    unsigned long                                      m_bUsesShieldHealth : 1;                                  // 0x0464 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      m_bMortarsExplodeOnTouch : 1;                             // 0x0464 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      m_bAutoPlayOnlineSound : 1;                               // 0x0464 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
    unsigned long                                      m_bInstantOnlineSound : 1;                                // 0x0464 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    unsigned long                                      r_bIsPowered : 1;                                         // 0x0464 (0x0004) [0x0000000000000020] [0x00000010] ( CPF_Net )
    unsigned long                                      m_bReceivesPowerFromGenerator : 1;                        // 0x0464 (0x0004) [0x0000000000000000] [0x00000020] 
    unsigned long                                      m_bForceShowHUD : 1;                                      // 0x0464 (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      m_bVisibilityRequiredForEnemy : 1;                        // 0x0464 (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      m_bPostRenderForEnemy : 1;                                // 0x0464 (0x0004) [0x0000000000000000] [0x00000100] 
    unsigned long                                      m_bIsRepairableAfterDeath : 1;                            // 0x0464 (0x0004) [0x0000000000000000] [0x00000200] 
    unsigned long                                      r_bInDestroyedState : 1;                                  // 0x0464 (0x0004) [0x0000000000000020] [0x00000400] ( CPF_Net )
    unsigned long                                      m_bHasPromptText : 1;                                     // 0x0464 (0x0004) [0x0000000000000000] [0x00000800] 
    unsigned long                                      m_bIsUpgradeable : 1;                                     // 0x0464 (0x0004) [0x0000000000000000] [0x00001000] 
    unsigned long                                      m_bIsRepairable : 1;                                      // 0x0464 (0x0004) [0x0000000000000000] [0x00002000] 
    unsigned long                                      m_bShowObjectivesForcesMarker : 1;                        // 0x0464 (0x0004) [0x0000000000000000] [0x00004000] 
    unsigned long                                      m_bDestroyable : 1;                                       // 0x0464 (0x0004) [0x0000000000000000] [0x00008000] 
    unsigned long                                      m_bHurtByFriendlyFire : 1;                                // 0x0464 (0x0004) [0x0000000000000000] [0x00010000] 
    unsigned long                                      m_bAlwaysRelevantToSameTeam : 1;                          // 0x0464 (0x0004) [0x0000000000000000] [0x00020000] 
    int                                                r_ShieldHealth;                                           // 0x0468 (0x0004) [0x0000000000000020]              ( CPF_Net )
    int                                                m_ShieldMaxHealth;                                        // 0x046C (0x0004) [0x0000000000000000]              
    int                                                c_OldShieldHealth;                                        // 0x0470 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    float                                              m_ShieldRechargeRate;                                     // 0x0474 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    unsigned char                                      r_nFlashShieldEffect;                                     // 0x0478 (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      r_bReset;                                                 // 0x0479 (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      m_MissileLockStatus;                                      // 0x047A (0x0001) [0x0000000000000000]              
    int                                                MarkerOffset;                                             // 0x047C (0x0004) [0x0000000000000000]              
    float                                              ShowHeaderUntil;                                          // 0x0480 (0x0004) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   m_ShieldMIC;                                              // 0x0484 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    float                                              m_fShieldHitTargetScale;                                  // 0x0488 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fShieldHitTargetTimeLength;                             // 0x048C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fShieldHitRemainingTime;                                // 0x0490 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    class UParticleSystem*                             m_ExplosionTemplate;                                      // 0x0494 (0x0004) [0x0000000000000000]              
    class UCameraAnim*                                 m_ExplosionShake;                                         // 0x0498 (0x0004) [0x0000000000000000]              
    float                                              m_fInnerExplosionShakeRadius;                             // 0x049C (0x0004) [0x0000000000000000]              
    float                                              m_fOuterExplosionShakeRadius;                             // 0x04A0 (0x0004) [0x0000000000000000]              
    struct FString                                     m_sScreenName;                                            // 0x04A4 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
    class UClass*                                      m_ExplosionLightClass;                                    // 0x04B0 (0x0004) [0x0000000000000000]              
    class UPhysicsAsset*                               m_OnlinePhysicsAsset;                                     // 0x04B4 (0x0004) [0x0000000000000000]              
    class UPhysicsAsset*                               m_OfflinePhysicsAsset;                                    // 0x04B8 (0x0004) [0x0000000000000000]              
    class UAudioComponent*                             m_OnlineSound;                                            // 0x04BC (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class USoundCue*                                   m_ExplosionSound;                                         // 0x04C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UAudioComponent*                             m_CriticalSound;                                          // 0x04C4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_ShieldHitSound;                                         // 0x04C8 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_PowerDownSound;                                         // 0x04CC (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class AController*                                 m_LastDamager;                                            // 0x04D0 (0x0004) [0x0000000000000000]              
    float                                              m_fLifeAfterDeathSecs;                                    // 0x04D4 (0x0004) [0x0000000000000000]              
    class UAudioComponent*                             m_DestroyedSound;                                         // 0x04D8 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UParticleSystem*                             DestroyedTemplate;                                        // 0x04DC (0x0004) [0x0000000000000000]              
    class UParticleSystemComponent*                    DestroyedParticleComp;                                    // 0x04E0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    float                                              m_fRemainingPotentialSeekingTargetHUDZoomTime;            // 0x04E4 (0x0004) [0x0000000000000000]              
    struct FRotator                                    m_rPotentialSeekingTargetHUDRotation;                     // 0x04E8 (0x000C) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fRemainingSeekingTargetHUDZoomTime;                     // 0x04F4 (0x0004) [0x0000000000000000]              
    float                                              m_fPromptMessageTime;                                     // 0x04F8 (0x0004) [0x0000000000000000]              
    int                                                m_nPromptMessageSwitch;                                   // 0x04FC (0x0004) [0x0000000000000000]              
    TArray< struct FUpgradeSelectionList >             m_UpgradeList;                                            // 0x0500 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    int                                                r_nUpgradeLevel;                                          // 0x050C (0x0004) [0x0000000000000020]              ( CPF_Net )
    class UParticleSystem*                             m_UpgradeTemplate;                                        // 0x0510 (0x0004) [0x0000000000000000]              
    float                                              m_fRepairBoost;                                           // 0x0514 (0x0004) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   m_HealthBarMIC;                                           // 0x0518 (0x0004) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   m_ShieldBarMIC;                                           // 0x051C (0x0004) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   m_MarkerMIC;                                              // 0x0520 (0x0004) [0x0000000000002000]              ( CPF_Transient )
    float                                              m_fObjectiveHealthBarPlacementX;                          // 0x0524 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fObjectiveHealthBarPlacementY;                          // 0x0528 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fObjectiveHealthBarWidth;                               // 0x052C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fObjectiveHealthBarHeight;                              // 0x0530 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fObjectiveNamePlacementY;                               // 0x0534 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fInstigatorNamePlacementY;                              // 0x0538 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fObjectiveShieldBarPlacementY;                          // 0x053C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              REPAIR_ASSIST_PERCENTAGE;                                 // 0x0540 (0x0004) [0x0000000000000000]              
    float                                              DESTROY_ASSIST_PERCENTAGE;                                // 0x0544 (0x0004) [0x0000000000000000]              
    TArray< struct FObjectiveDamageAssist >            DamageAssistList;                                         // 0x0548 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              m_fMarker2DDistance;                                      // 0x0554 (0x0004) [0x0000000000000000]              
    float                                              fUpgradeAssistTime;                                       // 0x0558 (0x0004) [0x0000000000000000]              
    class UClass*                                      m_AssistAccolade;                                         // 0x055C (0x0004) [0x0000000000000000]              
    TArray< class ATrPlayerController* >               m_Upgraders;                                              // 0x0560 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 45 ];

        return pClassPointer;
    };

    void eventOnUpgradePerformed ( struct FName VarName );
    void AwardUpgradeAssists ( );
    void AwardKillAssists ( );
    bool RequiresLOSForRepairDeployable ( );
    void Destroyed ( );
    void HideBasePlatform ( );
    void InstantlyRegenerateHealth ( );
    bool IsAliveAndWell ( );
    struct FString GetSpectatorDescription ( );
    void GetSpectatorHealthInfo ( int* Health, int* MaxHealth );
    void GiveDestroyAccolade ( class ATrPlayerController* TrPC );
    void ClearDamageAssistance ( unsigned long bOnlyDamagers );
    void CheckDestroyAssists ( );
    void CheckRepairAssists ( );
    void AddDamageAssistance ( class ATrPlayerController* TrPC, int DamageAmount );
    void AddUpgrader ( class ATrPlayerController* Upgrader );
    bool PerformUpgrade ( class ATrPlayerController* Purchaser );
    bool ReceivesPowerFromGenerator ( );
    bool ShouldShowHelpText ( unsigned char HelpTextType );
    void SpawnHelpTextCollisionProxy ( unsigned char HelpTextType );
    void Reset ( );
    bool eventBlocksLineChecksFromSourceActor ( class AActor* SourceActor );
    bool GetPossessiveInstigatorName ( struct FString* PlayerName );
    class UTexture2D* GetMarker ( );
    void eventPostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
    bool ShouldPostRenderForCaH ( );
    void TimerDestroy ( );
    void HideMesh ( );
    void OnPowerStatusChanged ( );
    void SetPowered ( unsigned long bEnabled );
    void PlayExplosion ( );
    void PlayDamageShieldEffects ( );
    void PlayDamageHealthEffects ( int DamageAmount, int HitBoneIndex );
    void OnHealthChanged ( unsigned long wasDamage );
    void PlayDestroyedEffects ( );
    void ClientPlayUpgradeEffect ( );
    void eventClientRecievedHitInfo ( );
    void eventTakeDamage ( int DamageAmount, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
    void DoRepairs ( int HealAmount, class AController* EventInstigator, class AActor* DamageCauser, class UClass* DamageType, struct FTraceHitInfo HitInfo );
    void RegenerateHealth ( );
    bool Shootable ( );
    void eventTick ( float DeltaTime );
    void eventReplicatedEvent ( struct FName VarName );
    void eventPostBeginPlay ( );
    bool ShouldShowPromptText ( class APawn* aPawn );
    int GetUpgradeCost ( class ATrPlayerController* TrPC );
    float GetShieldHealthAmount ( );
    float GetHealthAmount ( );
    struct FString GetSpectatorName ( );
    struct FString GetScreenName ( class APlayerController* PC );
    void ApplyServerSettings ( );
    bool IsInLOS_Basic ( class APawn* TouchedPawn );
    bool IsEnemy ( class AActor* Target );
};

// Class TribesGame.TrDeployable
// 0x00A8 (0x0614 - 0x056C)
class ATrDeployable : public ATrGameObjective
{
public:
    int                                                m_nMaxDeployablesOut;                                     // 0x056C (0x0004) [0x0000000000000000]              
    float                                              m_TimeCreated;                                            // 0x0570 (0x0004) [0x0000000000000000]              
    class ATrPawn*                                     m_TouchedPlayer;                                          // 0x0574 (0x0004) [0x0000000000000000]              
    float                                              m_fBuildupTime;                                           // 0x0578 (0x0004) [0x0000000000000000]              
    float                                              m_fRemoteActivationTime;                                  // 0x057C (0x0004) [0x0000000000000000]              
    float                                              m_fTimeToDeploySecs;                                      // 0x0580 (0x0004) [0x0000000000000000]              
    unsigned long                                      m_bIsDeployed : 1;                                        // 0x0584 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      m_bRequireLOS : 1;                                        // 0x0584 (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      m_bUsesArmoredMultiplier : 1;                             // 0x0584 (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      m_bOverrideTargetComponentHeight : 1;                     // 0x0584 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    unsigned long                                      m_bCachedRelevant : 1;                                    // 0x0584 (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      m_bIsXRay : 1;                                            // 0x0584 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
    unsigned long                                      m_bCanBeSpottedByVGS : 1;                                 // 0x0584 (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      m_bBlocksFriendlies : 1;                                  // 0x0584 (0x0004) [0x0000000000000000] [0x00000080] 
    int                                                m_nFiringArcDegrees;                                      // 0x0588 (0x0004) [0x0000000000000000]              
    struct FVector                                     m_PlacementOrientationVector;                             // 0x058C (0x000C) [0x0000000000000000]              
    float                                              m_fFiringArcCheckValue;                                   // 0x0598 (0x0004) [0x0000000000000000]              
    class AController*                                 m_Controller;                                             // 0x059C (0x0004) [0x0000000000000000]              
    class UCylinderComponent*                          m_TargetComponent;                                        // 0x05A0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    float                                              m_TargetCollisionTraceDistance;                           // 0x05A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fOverriddenTargetComponentHeight;                       // 0x05A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class ATrDeployableCollisionProxy*                 m_CollisionProxy;                                         // 0x05AC (0x0004) [0x0000000000000000]              
    float                                              m_fDamageRadius;                                          // 0x05B0 (0x0004) [0x0000000000000000]              
    float                                              r_fNewDetectionRadius;                                    // 0x05B4 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              m_fAlwaysRelevantDistanceSquared;                         // 0x05B8 (0x0004) [0x0000000000000000]              
    class UClass*                                      m_DeviceClass;                                            // 0x05BC (0x0004) [0x0000000000000000]              
    class ATrTurretPawn*                               m_WeaponHolder;                                           // 0x05C0 (0x0004) [0x0000000000000000]              
    class ATrSubDevice*                                m_Weapon;                                                 // 0x05C4 (0x0004) [0x0000000000000000]              
    unsigned char                                      r_FlashCount;                                             // 0x05C8 (0x0001) [0x0000000000000020]              ( CPF_Net )
    class APawn*                                       r_TargetPawn;                                             // 0x05CC (0x0004) [0x0000000000000020]              ( CPF_Net )
    class ATrPowerGenerator*                           m_MyMainGenerator;                                        // 0x05D0 (0x0004) [0x0000000000000000]              
    class USoundCue*                                   m_DeploySound;                                            // 0x05D4 (0x0004) [0x0000000000000000]              
    float                                              m_fNetRelevancyTime;                                      // 0x05D8 (0x0004) [0x0000000000000000]              
    class APlayerController*                           m_LastRealViewer;                                         // 0x05DC (0x0004) [0x0000000000000000]              
    class AActor*                                      m_LastViewer;                                             // 0x05E0 (0x0004) [0x0000000000000000]              
    TArray< float >                                    m_fRelevancyCheckHeights;                                 // 0x05E4 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    class UAnimNodeScalePlayRate*                      m_AnimNodeScale;                                          // 0x05F0 (0x0004) [0x0000000000000000]              
    float                                              m_fAnimInterpSpeed;                                       // 0x05F4 (0x0004) [0x0000000000000000]              
    class USkeletalMeshComponent*                      m_XRayMesh;                                               // 0x05F8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class APlayerReplicationInfo*                      r_OwnerPRI;                                               // 0x05FC (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FVector                                     m_vDeathCamStartOffset;                                   // 0x0600 (0x000C) [0x0000000000000000]              
    int                                                m_nIconStackId;                                           // 0x060C (0x0004) [0x0000000000000000]              
    float                                              m_fRemainingBlackoutTime;                                 // 0x0610 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 46 ];

        return pClassPointer;
    };

    void SetPowered ( unsigned long bEnabled );
    void eventOnUpgradePerformed ( struct FName VarName );
    bool CalcOtherWatchingCam ( float fDeltaTime, class ATrPlayerController* WatcherController, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
    bool GetPossessiveInstigatorName ( struct FString* PlayerName );
    bool ReceivesPowerFromGenerator ( );
    void Destroyed ( );
    void PulseBackupGenerators ( );
    void PlayFireEffects ( class AWeapon* InWeapon, unsigned long bViaReplication, struct FVector HitLocation );
    void IncrementFlashCount ( class AWeapon* W, unsigned char FireModeNum );
    bool StopsProjectile ( class AProjectile* P );
    struct FVector GetWeaponStartTraceLocation ( class AWeapon* CurrentWeapon );
    void OnHealthChanged ( unsigned long wasDamage );
    void UpdateHealthMaterial ( );
    bool IsFiring ( );
    void DeployComplete ( );
    void FinalizeDeployment ( );
    float GetDamageRadius ( );
    void PostBeginPlay ( );
    void SetInstigatorController ( class ATrPlayerController* InstigatorController );
    void OnPowerStatusChanged ( );
    void OnVehicleExitedCollisionProxy ( class ATrVehicle* V );
    void OnVehicleDetectedByCollisionProxy ( class ATrVehicle* V );
    void OnPawnExitedCollisionProxy ( class APawn* P );
    void OnPawnDetectedByCollisionProxy ( class APawn* P );
    class ATrPawn* GetPawnCausingDamage ( class AController* EventInstigator, class AActor* DamageCauser );
    void eventTakeDamage ( int DamageAmount, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
    float GetBaseDamageMultiplierAgainstArmor ( class UClass* TrDamageType );
    void TakeRadiusDamage ( class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, struct FVector HurtOrigin, unsigned long bFullDamage, class AActor* DamageCauser, float DamageFalloffExponent );
    void eventTick ( float DeltaTime );
    void OnPRIReplicated ( );
    void eventReplicatedEvent ( struct FName VarName );
    void eventPostInitAnimTree ( class USkeletalMeshComponent* SkelComp );
    void ApplyServerSettings ( );
    bool IsInLOS ( class AActor* TouchedActor, struct FVector StartLocation, struct FVector EndLocation, unsigned long CheckBlockedByBlockers, unsigned long CheckBlockedByActors );
    float CalcMeshOffset ( );
    void AdjustMeshToGround ( );
};

// Class TribesGame.TrPawn
// 0x0400 (0x0CA4 - 0x08A4)
class ATrPawn : public AUTPawn
{
public:
    int                                                r_nFactionId;                                             // 0x08A4 (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FName                                       m_nmMakeVisible;                                          // 0x08A8 (0x0008) [0x0000000000000000]              
    unsigned long                                      m_bInitialized : 1;                                       // 0x08B0 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      m_bRefreshInventoryWasRespawn : 1;                        // 0x08B0 (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      r_bIsStealthed : 1;                                       // 0x08B0 (0x0004) [0x0000000000000020] [0x00000004] ( CPF_Net )
    unsigned long                                      m_bStealthVisible : 1;                                    // 0x08B0 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
    unsigned long                                      r_bIsRaged : 1;                                           // 0x08B0 (0x0004) [0x0000000000000020] [0x00000010] ( CPF_Net )
    unsigned long                                      r_bIsShielded : 1;                                        // 0x08B0 (0x0004) [0x0000000000000020] [0x00000020] ( CPF_Net )
    unsigned long                                      r_bIsHealthRecharging : 1;                                // 0x08B0 (0x0004) [0x0000000000000020] [0x00000040] ( CPF_Net )
    unsigned long                                      r_bInFireLock : 1;                                        // 0x08B0 (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      bInFireLockClient : 1;                                    // 0x08B0 (0x0004) [0x0000000000000000] [0x00000100] 
    unsigned long                                      r_bInDeployMode : 1;                                      // 0x08B0 (0x0004) [0x0000000000000000] [0x00000200] 
    unsigned long                                      bInDeployModeClient : 1;                                  // 0x08B0 (0x0004) [0x0000000000000000] [0x00000400] 
    unsigned long                                      r_bIsSkiing : 1;                                          // 0x08B0 (0x0004) [0x0000000000000020] [0x00000800] ( CPF_Net )
    unsigned long                                      m_bIsPlayingSkiEffects : 1;                               // 0x08B0 (0x0004) [0x0000000000002000] [0x00001000] ( CPF_Transient )
    unsigned long                                      m_bIsPlayingSkiEffectsSounds : 1;                         // 0x08B0 (0x0004) [0x0000000000002000] [0x00002000] ( CPF_Transient )
    unsigned long                                      r_bAimingMode : 1;                                        // 0x08B0 (0x0004) [0x0000000000000020] [0x00004000] ( CPF_Net )
    unsigned long                                      r_bIsJetting : 1;                                         // 0x08B0 (0x0004) [0x0000000000000020] [0x00008000] ( CPF_Net )
    unsigned long                                      m_bIsJetEffectsPlaying : 1;                               // 0x08B0 (0x0004) [0x0000000000000000] [0x00010000] 
    unsigned long                                      r_bIsJamming : 1;                                         // 0x08B0 (0x0004) [0x0000000000000020] [0x00020000] ( CPF_Net )
    unsigned long                                      m_bLoadoutReset : 1;                                      // 0x08B0 (0x0004) [0x0000000000000000] [0x00040000] 
    unsigned long                                      m_bUpdateStickyGrenades : 1;                              // 0x08B0 (0x0004) [0x0000000000002000] [0x00080000] ( CPF_Transient )
    unsigned long                                      r_bIsInvulnerable : 1;                                    // 0x08B0 (0x0004) [0x0000000000000020] [0x00100000] ( CPF_Net )
    unsigned long                                      m_bIsInConduit : 1;                                       // 0x08B0 (0x0004) [0x0000000000002000] [0x00200000] ( CPF_Transient )
    unsigned long                                      m_bSplattedAgainstWall : 1;                               // 0x08B0 (0x0004) [0x0000000000000000] [0x00400000] 
    unsigned long                                      r_bIsBlackedOut : 1;                                      // 0x08B0 (0x0004) [0x0000000000000020] [0x00800000] ( CPF_Net )
    unsigned long                                      r_bDetectedByEnemyScanner : 1;                            // 0x08B0 (0x0004) [0x0000000000000020] [0x01000000] ( CPF_Net )
    unsigned long                                      m_bUseSmoothNetReceiveRotation : 1;                       // 0x08B0 (0x0004) [0x0000000000000001] [0x02000000] ( CPF_Edit )
    class AActor*                                      r_LockedTarget;                                           // 0x08B4 (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FVector                                     r_FlashNormal;                                            // 0x08B8 (0x000C) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      r_MissileLock;                                            // 0x08C4 (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      r_nPulseStealth;                                          // 0x08C5 (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      r_nBlinked;                                               // 0x08C6 (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      PhysType;                                                 // 0x08C7 (0x0001) [0x0000000000000001]              ( CPF_Edit )
    unsigned char                                      r_RemoteViewYaw;                                          // 0x08C8 (0x0001) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
    unsigned char                                      m_MissileLockStatus;                                      // 0x08C9 (0x0001) [0x0000000000000000]              
    unsigned char                                      r_nWhiteOut;                                              // 0x08CA (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      r_nFlashBlackOut;                                         // 0x08CB (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      LastFXOverlay;                                            // 0x08CC (0x0001) [0x0000000000000000]              
    float                                              m_fEnableStealthVisibilityInterpSpeed;                    // 0x08D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fDisableStealthVisibilityInterpSpeed;                   // 0x08D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fMinStealthVisibilityParamValue;                        // 0x08D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UMaterial*                                   m_StealthMaterial;                                        // 0x08DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UMaterialInstanceConstant*                   m_StealthMIC;                                             // 0x08E0 (0x0004) [0x0000000000000000]              
    float                                              m_fPulseStealthVisibleTimestamp;                          // 0x08E4 (0x0004) [0x0000000000000000]              
    float                                              m_fPulseStealthVisibleTime;                               // 0x08E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fPulseStealthFadeInInterpSpeed;                         // 0x08EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              r_fPulseStealthSpeedThreshold;                            // 0x08F0 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              m_fPulseStealthIgnoreTimeStamp;                           // 0x08F4 (0x0004) [0x0000000000000000]              
    float                                              m_fPulseStealthIgnoreTime;                                // 0x08F8 (0x0004) [0x0000000000000000]              
    int                                                r_nRageCount;                                             // 0x08FC (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              r_fRagePickupSpeed;                                       // 0x0900 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              r_fFasterWeaponSwitchMultiplier;                          // 0x0904 (0x0004) [0x0000000000000000]              
    float                                              m_fShieldMultiple;                                        // 0x0908 (0x0004) [0x0000000000000000]              
    float                                              s_fVE;                                                    // 0x090C (0x0004) [0x0000000000002000]              ( CPF_Transient )
    TArray< struct FFlagLockoutTimer >                 FlagLockoutTimers;                                        // 0x0910 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              m_fTimeLastSeenByLocalPlayer;                             // 0x091C (0x0004) [0x0000000000000000]              
    float                                              m_fTimeLastUnseenByLocalPlayer;                           // 0x0920 (0x0004) [0x0000000000000000]              
    float                                              m_fTimeLastTargetByLocalPlayer;                           // 0x0924 (0x0004) [0x0000000000000000]              
    float                                              m_fTimeLastUntargetByLocalPlayer;                         // 0x0928 (0x0004) [0x0000000000000000]              
    float                                              m_fCurrentPowerPool;                                      // 0x092C (0x0004) [0x0000000000000000]              
    float                                              r_fCurrentPowerPool;                                      // 0x0930 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              r_fMaxPowerPool;                                          // 0x0934 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              r_fPowerPoolRechargeRate;                                 // 0x0938 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              m_fSecondsBeforeAutoHeal;                                 // 0x093C (0x0004) [0x0000000000000000]              
    float                                              m_fTickedRegenDecimal;                                    // 0x0940 (0x0004) [0x0000000000000000]              
    float                                              m_fHeadShotFudge;                                         // 0x0944 (0x0004) [0x0000000000000000]              
    float                                              m_fHeadShotDamageMultiple;                                // 0x0948 (0x0004) [0x0000000000000000]              
    float                                              m_fStoppingDistance;                                      // 0x094C (0x0004) [0x0000000000000000]              
    float                                              m_fMaxStoppingDistance;                                   // 0x0950 (0x0004) [0x0000000000000000]              
    float                                              m_fMaxJetpackThrustSpeed;                                 // 0x0954 (0x0004) [0x0000000000000000]              
    float                                              m_fAccelRateAtMaxThrustSpeed;                             // 0x0958 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fMaxJettingSpeed;                                       // 0x095C (0x0004) [0x0000000000000000]              
    float                                              m_fTerminalJettingSpeed;                                  // 0x0960 (0x0004) [0x0000000000000000]              
    float                                              m_fMaxSpeedDecelerationRate;                              // 0x0964 (0x0004) [0x0000000000000000]              
    float                                              m_fPreserveVelocityThresholdMax;                          // 0x0968 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fPreserveVelocityThresholdMin;                          // 0x096C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fPreserveVelocityZNormalThreshold;                      // 0x0970 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fMaxSpeedWithFlag;                                      // 0x0974 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fDecelerationRateWithFlag;                              // 0x0978 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fJetpackPowerPoolCost;                                  // 0x097C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                r_nSensorAlertLevel;                                      // 0x0980 (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FTR_HUD_INFO                                m_HudInfo;                                                // 0x0984 (0x0044) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              ShowHeaderUntil;                                          // 0x09C8 (0x0004) [0x0000000000000000]              
    TArray< class UTrEffect* >                         m_AppliedEffects;                                         // 0x09CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    TArray< class UTrEffectForm* >                     m_AppliedEffectForms;                                     // 0x09D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    struct FTrTakeEffectInfo                           r_LastTakeEffectInfo;                                     // 0x09E4 (0x0010) [0x0000000000000020]              ( CPF_Net )
    float                                              m_fPeakSkiControlSpeed;                                   // 0x09F4 (0x0004) [0x0000000000000000]              
    float                                              m_fSkiControlSigmaSquare;                                 // 0x09F8 (0x0004) [0x0000000000000000]              
    float                                              m_fMaxSkiControlPct;                                      // 0x09FC (0x0004) [0x0000000000000000]              
    float                                              m_fSkiSlopeGravityBoost;                                  // 0x0A00 (0x0004) [0x0000000000000000]              
    float                                              m_fMaxSkiSpeed;                                           // 0x0A04 (0x0004) [0x0000000000000000]              
    float                                              m_fTerminalSkiSpeed;                                      // 0x0A08 (0x0004) [0x0000000000000000]              
    float                                              m_fCurrentAccuracy;                                       // 0x0A0C (0x0004) [0x0000000000000000]              
    float                                              m_TrCustomGravityScale;                                   // 0x0A10 (0x0004) [0x0000000000000000]              
    float                                              m_fAirAccelCapSpeedThreshold;                             // 0x0A14 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fAirAccelSpeed;                                         // 0x0A18 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fSkiAccelCapSpeedThreshold;                             // 0x0A1C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_fSkiAccelPct;                                           // 0x0A20 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              m_AssistDamagePercentQualifier;                           // 0x0A24 (0x0004) [0x0000000000000000]              
    float                                              m_fLastVehicleDamagerTimeStamp;                           // 0x0A28 (0x0004) [0x0000000000000000]              
    float                                              m_fLastDamagerTimeStamp;                                  // 0x0A2C (0x0004) [0x0000000000000000]              
    TArray< struct FAssistInfo >                       m_KillAssisters;                                          // 0x0A30 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              m_fFallVelocityTransfer;                                  // 0x0A3C (0x0004) [0x0000000000000000]              
    class UTrAnimNodeAimOffset*                        m_AimOffsetNode;                                          // 0x0A40 (0x0004) [0x0000000000000000]              
    class UTrAnimNodeAimOffset*                        m_1pBodyAimOffsetNode;                                    // 0x0A44 (0x0004) [0x0000000000000000]              
    class UTrAnimNodeBlendByVehicle*                   m_VehicleBlendNode;                                       // 0x0A48 (0x0004) [0x0000000000000000]              
    class UTrAnimNodeBlendByRidingPassenger*           m_RidingPassengerBlendNode;                               // 0x0A4C (0x0004) [0x0000000000000000]              
    class UMorphNodeWeight*                            m_OverlayMorphNode;                                       // 0x0A50 (0x0004) [0x0000000000000000]              
    float                                              m_fFriendlyShowDistanceThreshold;                         // 0x0A54 (0x0004) [0x0000000000000000]              
    float                                              m_fEnemyShowDistanceThreshold;                            // 0x0A58 (0x0004) [0x0000000000000000]              
    float                                              m_fShowObjectThreshold;                                   // 0x0A5C (0x0004) [0x0000000000000000]              
    struct FVector                                     r_avMultiShotLocation[ 0x8 ];                             // 0x0A60 (0x0060) [0x0000000000000020]              ( CPF_Net )
    class UAudioComponent*                             m_AudioComponentSkiLoop;                                  // 0x0AC0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentShieldPackLoop;                           // 0x0AC4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentStealthPackLoop;                          // 0x0AC8 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentJammerPackLoop;                           // 0x0ACC (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentSpeedSound;                               // 0x0AD0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentJetpackLoop;                              // 0x0AD4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentHealthRechargeLoop;                       // 0x0AD8 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAudioComponent*                             m_AudioComponentRageLoop;                                 // 0x0ADC (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
    float                                              m_OldSpeed;                                               // 0x0AE0 (0x0004) [0x0000000000000000]              
    TArray< struct FEffectFormOverwrite >              m_EffectFormOverwrite;                                    // 0x0AE4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    class UMaterial*                                   r_ReplicatedWeaponAttachmentMat;                          // 0x0AF0 (0x0004) [0x0000000000000020]              ( CPF_Net )
    class ATrPawnCollisionProxy*                       m_JammingCollisionProxy;                                  // 0x0AF4 (0x0004) [0x0000000000000000]              
    float                                              m_fJamEffectRadius;                                       // 0x0AF8 (0x0004) [0x0000000000000000]              
    TArray< class ATrPawn* >                           m_JammedFriends;                                          // 0x0AFC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    TArray< class ATrPawn* >                           m_JammedEnemies;                                          // 0x0B08 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    int                                                m_JammingFriendTeam;                                      // 0x0B14 (0x0004) [0x0000000000000000]              
    class ATrPlayerReplicationInfo*                    r_FriendJammingPRI;                                       // 0x0B18 (0x0004) [0x0000000000000020]              ( CPF_Net )
    TArray< class ATrPlayerReplicationInfo* >          m_FriendJammingList;                                      // 0x0B1C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    int                                                r_nEnemyJamCount;                                         // 0x0B28 (0x0004) [0x0000000000000020]              ( CPF_Net )
    int                                                r_nFriendlyDropJammerCount;                               // 0x0B2C (0x0004) [0x0000000000000020]              ( CPF_Net )
    int                                                r_nEnemyDropJammerCount;                                  // 0x0B30 (0x0004) [0x0000000000000020]              ( CPF_Net )
    TArray< class ATrDeployable_DropJammer* >          m_FriendlyDropJammerList;                                 // 0x0B34 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    TArray< class ATrDeployable_DropJammer* >          m_EnemyDropJammerList;                                    // 0x0B40 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              m_fMaxJetpackBoostGroundspeed;                            // 0x0B4C (0x0004) [0x0000000000000000]              
    float                                              m_fForwardJettingPct;                                     // 0x0B50 (0x0004) [0x0000000000000000]              
    class UMaterial*                                   m_ShieldPackOverlayMaterial;                              // 0x0B54 (0x0004) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   m_ShieldPackOverlayMIC;                                   // 0x0B58 (0x0004) [0x0000000000000000]              
    float                                              m_fOverlayMaterialActivateSpeed;                          // 0x0B5C (0x0004) [0x0000000000000001]              ( CPF_Edit )
