/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: UDKBase_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_SABM_FIND_FIRST_BIND                               -2
#define CONST_INVALIDFIELD                                       -1

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum UDKBase.UDKAnimBlendByFall.EBlendFallTypes
enum EBlendFallTypes
{
    FBT_Up                                             = 0,
    FBT_Down                                           = 1,
    FBT_PreLand                                        = 2,
    FBT_Land                                           = 3,
    FBT_DblJumpUp                                      = 4,
    FBT_DblJumpDown                                    = 5,
    FBT_DblJumpPreLand                                 = 6,
    FBT_DblJumpLand                                    = 7,
    FBT_None                                           = 8,
    FBT_MAX                                            = 9
};

// Enum UDKBase.UDKAnimBlendByFlying.EFlyingState
enum EFlyingState
{
    Flying_NotFlying                                   = 0,
    Flying_OpeningWings                                = 1,
    Flying_Flying                                      = 2,
    Flying_ClosingWings                                = 3,
    Flying_MAX                                         = 4
};

// Enum UDKBase.UDKMapMusicInfo.ECrossfadeType
enum ECrossfadeType
{
    CFT_BeginningOfMeasure                             = 0,
    CFT_EndOfMeasure                                   = 1,
    CFT_MAX                                            = 2
};

// Enum UDKBase.UDKUIDataProvider_MenuOption.EUTOptionType
enum EUTOptionType
{
    UTOT_ComboReadOnly                                 = 0,
    UTOT_ComboNumeric                                  = 1,
    UTOT_CheckBox                                      = 2,
    UTOT_Slider                                        = 3,
    UTOT_Spinner                                       = 4,
    UTOT_EditBox                                       = 5,
    UTOT_CollectionCheckBox                            = 6,
    UTOT_MAX                                           = 7
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UDKBase.UDKGameObjective
// 0x0031 (0x02E9 - 0x02B8)
class AUDKGameObjective : public ANavigationPoint
{
public:
    TArray< class ANavigationPoint* >                  ShootSpots;                                               // 0x02B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    unsigned long                                      bAllowOnlyShootable : 1;                                  // 0x02C4 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bUnderAttack : 1;                                         // 0x02C4 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
    struct FVector                                     HUDLocation;                                              // 0x02C8 (0x000C) [0x0000000000000000]              
    class UTexture2D*                                  IconHudTexture;                                           // 0x02D4 (0x0004) [0x0000000000000002]              ( CPF_Const )
    struct FTextureCoordinates                         IconCoords;                                               // 0x02D8 (0x0010) [0x0000000000000000]              
    unsigned char                                      DefenderTeamIndex;                                        // 0x02E8 (0x0001) [0x0000000000000020]              ( CPF_Net )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 43 ];

        return pClassPointer;
    };

    unsigned char GetTeamNum ( );
    void DrawIcon ( class UCanvas* Canvas, struct FVector IconLocation, float IconWidth, float IconAlpha, class AUDKPlayerController* PlayerOwner, struct FLinearColor DrawColor );
    void SetHUDLocation ( struct FVector NewHUDLocation );
    void TriggerFlagEvent ( struct FName EventType, class AController* EventInstigator );
    bool BotNearObjective ( class AAIController* C );
    class AActor* eventGetBestViewTarget ( );
    void ObjectiveChanged ( );
};

// Class UDKBase.UDKPawn
// 0x01D4 (0x0654 - 0x0480)
class AUDKPawn : public AGamePawn
{
public:
    unsigned long                                      bReadyToDoubleJump : 1;                                   // 0x0480 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bRequiresDoubleJump : 1;                                  // 0x0480 (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bCanDoubleJump : 1;                                       // 0x0480 (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      bNoJumpAdjust : 1;                                        // 0x0480 (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bIsHoverboardAnimPawn : 1;                                // 0x0480 (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      bFeigningDeath : 1;                                       // 0x0480 (0x0004) [0x0000000000000020] [0x00000020] ( CPF_Net )
    unsigned long                                      bNotifyStopFalling : 1;                                   // 0x0480 (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      bIsInvisible : 1;                                         // 0x0480 (0x0004) [0x0000000000000020] [0x00000080] ( CPF_Net )
    unsigned long                                      bSmoothNetUpdates : 1;                                    // 0x0480 (0x0004) [0x0000000000000000] [0x00000100] 
    unsigned long                                      bPuttingDownWeapon : 1;                                   // 0x0480 (0x0004) [0x0000000000000020] [0x00000200] ( CPF_Net )
    unsigned long                                      bPlayingFeignDeathRecovery : 1;                           // 0x0480 (0x0004) [0x0000000000000000] [0x00000400] 
    unsigned long                                      bCanPlayFallingImpacts : 1;                               // 0x0480 (0x0004) [0x0000000000000000] [0x00000800] 
    unsigned long                                      bEnableFootPlacement : 1;                                 // 0x0480 (0x0004) [0x0000000000000000] [0x00001000] 
    unsigned long                                      bPostRenderOtherTeam : 1;                                 // 0x0480 (0x0004) [0x0000000000000000] [0x00002000] 
    unsigned long                                      bBlendOutTakeHitPhysics : 1;                              // 0x0480 (0x0004) [0x0000000000000000] [0x00004000] 
    unsigned long                                      bUpdateEyeheight : 1;                                     // 0x0480 (0x0004) [0x0000000000000000] [0x00008000] 
    unsigned long                                      bTearOffGibs : 1;                                         // 0x0480 (0x0004) [0x0000000000000020] [0x00010000] ( CPF_Net )
    float                                              MaxDoubleJumpHeight;                                      // 0x0484 (0x0004) [0x0000000000000000]              
    int                                                MultiJumpRemaining;                                       // 0x0488 (0x0004) [0x0000000000000000]              
    int                                                MaxMultiJump;                                             // 0x048C (0x0004) [0x0000000000000000]              
    int                                                MultiJumpBoost;                                           // 0x0490 (0x0004) [0x0000000000000000]              
    float                                              CustomGravityScaling;                                     // 0x0494 (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FPlayEmoteInfo                              EmoteRepInfo;                                             // 0x0498 (0x0010) [0x0000000000000020]              ( CPF_Net )
    float                                              LastEmoteTime;                                            // 0x04A8 (0x0004) [0x0000000000000000]              
    float                                              MinTimeBetweenEmotes;                                     // 0x04AC (0x0004) [0x0000000000000000]              
    unsigned char                                      BigTeleportCount;                                         // 0x04B0 (0x0001) [0x0000000000000020]              ( CPF_Net )
    unsigned char                                      WeaponOverlayFlags;                                       // 0x04B1 (0x0001) [0x0000000000000020]              ( CPF_Net )
    struct FUTTakeHitInfo                              LastTakeHitInfo;                                          // 0x04B4 (0x002C) [0x0000000000000020]              ( CPF_Net )
    float                                              LastTakeHitTimeout;                                       // 0x04E0 (0x0004) [0x0000000000000000]              
    float                                              FireRateMultiplier;                                       // 0x04E4 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              HeadScale;                                                // 0x04E8 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              MaxSmoothNetUpdateDist;                                   // 0x04EC (0x0004) [0x0000000000000000]              
    float                                              NoSmoothNetUpdateDist;                                    // 0x04F0 (0x0004) [0x0000000000000000]              
    float                                              SmoothNetUpdateTime;                                      // 0x04F4 (0x0004) [0x0000000000000000]              
    struct FVector                                     MeshTranslationOffset;                                    // 0x04F8 (0x000C) [0x0000000000000000]              
    float                                              OldZ;                                                     // 0x0504 (0x0004) [0x0000000000000000]              
    class UAudioComponent*                             PawnAmbientSound;                                         // 0x0508 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class USoundCue*                                   PawnAmbientSoundCue;                                      // 0x050C (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FDrivenWeaponPawnInfo                       DrivenWeaponPawn;                                         // 0x0510 (0x000C) [0x0000000000000020]              ( CPF_Net )
    class UAudioComponent*                             WeaponAmbientSound;                                       // 0x051C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class USoundCue*                                   WeaponAmbientSoundCue;                                    // 0x0520 (0x0004) [0x0000000000000020]              ( CPF_Net )
    class UMaterial*                                   ReplicatedBodyMaterial;                                   // 0x0524 (0x0004) [0x0000000000000020]              ( CPF_Net )
    TArray< class UMaterialInstanceConstant* >         BodyMaterialInstances;                                    // 0x0528 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    class UMaterialInterface*                          OverlayMaterialInstance;                                  // 0x0534 (0x0004) [0x0000000000000020]              ( CPF_Net )
    class USkelControlSingleBone*                      RootRotControl;                                           // 0x0538 (0x0004) [0x0000000000000000]              
    class UAnimNodeAimOffset*                          AimNode;                                                  // 0x053C (0x0004) [0x0000000000000000]              
    class UGameSkelCtrl_Recoil*                        GunRecoilNode;                                            // 0x0540 (0x0004) [0x0000000000000000]              
    class UGameSkelCtrl_Recoil*                        LeftRecoilNode;                                           // 0x0544 (0x0004) [0x0000000000000000]              
    class UGameSkelCtrl_Recoil*                        RightRecoilNode;                                          // 0x0548 (0x0004) [0x0000000000000000]              
    TArray< class AUDKBot* >                           Trackers;                                                 // 0x054C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              BodyMatFadeDuration;                                      // 0x0558 (0x0004) [0x0000000000000000]              
    struct FLinearColor                                CurrentBodyMatColor;                                      // 0x055C (0x0010) [0x0000000000000000]              
    float                                              RemainingBodyMatDuration;                                 // 0x056C (0x0004) [0x0000000000000000]              
    float                                              ClientBodyMatDuration;                                    // 0x0570 (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FLinearColor                                BodyMatColor;                                             // 0x0574 (0x0010) [0x0000000000000000]              
    struct FRotator                                    CompressedBodyMatColor;                                   // 0x0584 (0x000C) [0x0000000000000020]              ( CPF_Net )
    float                                              StartFallImpactTime;                                      // 0x0590 (0x0004) [0x0000000000000000]              
    struct FName                                       TorsoBoneName;                                            // 0x0594 (0x0008) [0x0000000000000000]              
    class USoundCue*                                   FallImpactSound;                                          // 0x059C (0x0004) [0x0000000000000000]              
    float                                              FallSpeedThreshold;                                       // 0x05A0 (0x0004) [0x0000000000000000]              
    class UStaticMeshComponent*                        BlobShadow;                                               // 0x05A4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class USkeletalMeshComponent*                      OverlayMesh;                                              // 0x05A8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    struct FName                                       LeftFootBone;                                             // 0x05AC (0x0008) [0x0000000000000000]              
    struct FName                                       RightFootBone;                                            // 0x05B4 (0x0008) [0x0000000000000000]              
    struct FName                                       LeftFootControlName;                                      // 0x05BC (0x0008) [0x0000000000000000]              
    struct FName                                       RightFootControlName;                                     // 0x05C4 (0x0008) [0x0000000000000000]              
    float                                              BaseTranslationOffset;                                    // 0x05CC (0x0004) [0x0000000000000000]              
    float                                              CrouchTranslationOffset;                                  // 0x05D0 (0x0004) [0x0000000000000000]              
    float                                              OldLocationZ;                                             // 0x05D4 (0x0004) [0x0000000000000000]              
    float                                              ZSmoothingRate;                                           // 0x05D8 (0x0004) [0x0000000000000002]              ( CPF_Const )
    float                                              MaxFootPlacementDistSquared;                              // 0x05DC (0x0004) [0x0000000000000000]              
    class USkelControlFootPlacement*                   LeftLegControl;                                           // 0x05E0 (0x0004) [0x0000000000000000]              
    class USkelControlFootPlacement*                   RightLegControl;                                          // 0x05E4 (0x0004) [0x0000000000000000]              
    class USkelControlLimb*                            LeftHandIK;                                               // 0x05E8 (0x0004) [0x0000000000000000]              
    class USkelControlLimb*                            RightHandIK;                                              // 0x05EC (0x0004) [0x0000000000000000]              
    struct FName                                       DamageParameterName;                                      // 0x05F0 (0x0008) [0x0000000000000000]              
    struct FName                                       SaturationParameterName;                                  // 0x05F8 (0x0008) [0x0000000000000000]              
    float                                              LastPostRenderTraceTime;                                  // 0x0600 (0x0004) [0x0000000000000000]              
    float                                              TeamBeaconMaxDist;                                        // 0x0604 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              StartedFallingTime;                                       // 0x0608 (0x0004) [0x0000000000000000]              
    float                                              SlopeBoostFriction;                                       // 0x060C (0x0004) [0x0000000000000000]              
    class UAnimNodeAimOffset*                          FlyingDirOffset;                                          // 0x0610 (0x0004) [0x0000000000000000]              
    int                                                MaxLeanRoll;                                              // 0x0614 (0x0004) [0x0000000000000000]              
    float                                              FeignDeathPhysicsBlendOutSpeed;                           // 0x0618 (0x0004) [0x0000000000000000]              
    float                                              SwimmingZOffset;                                          // 0x061C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              SwimmingZOffsetSpeed;                                     // 0x0620 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              CrouchMeshZOffset;                                        // 0x0624 (0x0004) [0x0000000000000000]              
    float                                              TakeHitPhysicsBlendOutSpeed;                              // 0x0628 (0x0004) [0x0000000000000000]              
    class UUDKSkeletalMeshComponent*                   ArmsMesh[ 0x2 ];                                          // 0x062C (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    int                                                RootYaw;                                                  // 0x0634 (0x0004) [0x0000000000000000]              
    float                                              RootYawSpeed;                                             // 0x0638 (0x0004) [0x0000000000000000]              
    int                                                MaxYawAim;                                                // 0x063C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    struct FVector2D                                   CurrentSkelAim;                                           // 0x0640 (0x0008) [0x0000000000000000]              
    struct FVector                                     HUDLocation;                                              // 0x0648 (0x000C) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 49 ];

        return pClassPointer;
    };

    void eventStuckFalling ( );
    void eventUpdateEyeHeight ( float DeltaTime );
    void eventTakeHitBlendedOut ( );
    void eventStartFeignDeathRecoveryAnim ( );
    void SetHandIKEnabled ( unsigned long bEnabled );
    void SetWeaponAttachmentVisibility ( unsigned long bAttachmentVisible );
    void NativePostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
    void SetHUDLocation ( struct FVector NewHUDLocation );
    bool SuggestJumpVelocity ( struct FVector Destination, struct FVector Start, unsigned long bRequireFallLanding, struct FVector* JumpVelocity );
    void eventStartCrouch ( float HeightAdjust );
    void eventEndCrouch ( float HeightAdjust );
    void eventStoppedFalling ( );
    void eventHoldGameObject ( class AUDKCarriedObject* UDKGameObj );
    bool IsInvisible ( );
    struct FVector GetTargetLocation ( class AActor* RequestedBy, unsigned long bRequestAlternateLoc );
    void EnsureOverlayComponentLast ( );
    void RestorePreRagdollCollisionComponent ( );
    void GetBoundingCylinder ( float* CollisionRadius, float* CollisionHeight );
};

// Class UDKBase.UDKAIDecisionComponent
// 0x0007 (0x005C - 0x0055)
class UUDKAIDecisionComponent : public UActorComponent
{
public:
    unsigned long                                      bTriggered : 1;                                           // 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1377 ];

        return pClassPointer;
    };

};

// Class UDKBase.UDKBot
// 0x00C8 (0x0468 - 0x03A0)
class AUDKBot : public AAIController
{
public:
    class AUDKSquadAI*                                 Squad;                                                    // 0x03A0 (0x0004) [0x0000000000000000]              
    class UUDKAIDecisionComponent*                     DecisionComponent;                                        // 0x03A4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class AActor*                                      TemporaryFocus;                                           // 0x03A8 (0x0004) [0x0000000000000000]              
    unsigned long                                      bExecutingWhatToDoNext : 1;                               // 0x03AC (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bScriptSpecialJumpCost : 1;                               // 0x03AC (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bForceRefreshRoute : 1;                                   // 0x03AC (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      bTargetAlternateLoc : 1;                                  // 0x03AC (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bEnemyInfoValid : 1;                                      // 0x03AC (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      bEnemyIsVisible : 1;                                      // 0x03AC (0x0004) [0x0000000000000000] [0x00000020] 
    unsigned long                                      bLeadTarget : 1;                                          // 0x03AC (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      bJumpOverWall : 1;                                        // 0x03AC (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      bPlannedJump : 1;                                         // 0x03AC (0x0004) [0x0000000000000000] [0x00000100] 
    unsigned long                                      bInDodgeMove : 1;                                         // 0x03AC (0x0004) [0x0000000000000000] [0x00000200] 
    unsigned long                                      bEnemyAcquired : 1;                                       // 0x03AC (0x0004) [0x0000000000000000] [0x00000400] 
    unsigned long                                      bNeedDelayedLeaveVehicle : 1;                             // 0x03AC (0x0004) [0x0000000000000000] [0x00000800] 
    unsigned long                                      bAllowRouteReuse : 1;                                     // 0x03AC (0x0004) [0x0000000000000000] [0x00001000] 
    unsigned long                                      bUsingSquadRoute : 1;                                     // 0x03AC (0x0004) [0x0000000000000000] [0x00002000] 
    unsigned long                                      bUsePreviousSquadRoute : 1;                               // 0x03AC (0x0004) [0x0000000000000000] [0x00004000] 
    unsigned char                                      ScriptedFireMode;                                         // 0x03B0 (0x0001) [0x0000000000000000]              
    float                                              EnemyVisibilityTime;                                      // 0x03B4 (0x0004) [0x0000000000000000]              
    class APawn*                                       VisibleEnemy;                                             // 0x03B8 (0x0004) [0x0000000000000000]              
    class AVehicle*                                    LastBlockingVehicle;                                      // 0x03BC (0x0004) [0x0000000000000000]              
    class APawn*                                       CurrentlyTrackedEnemy;                                    // 0x03C0 (0x0004) [0x0000000000000000]              
    TArray< struct FEnemyPosition >                    SavedPositions;                                           // 0x03C4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    struct FVector                                     ImpactVelocity;                                           // 0x03D0 (0x000C) [0x0000000000000000]              
    int                                                AcquisitionYawRate;                                       // 0x03DC (0x0004) [0x0000000000000000]              
    float                                              HearingThreshold;                                         // 0x03E0 (0x0004) [0x0000000000000000]              
    float                                              RespawnPredictionTime;                                    // 0x03E4 (0x0004) [0x0000000000000000]              
    float                                              WarningDelay;                                             // 0x03E8 (0x0004) [0x0000000000000000]              
    class AProjectile*                                 WarningProjectile;                                        // 0x03EC (0x0004) [0x0000000000000000]              
    struct FVector                                     MonitorStartLoc;                                          // 0x03F0 (0x000C) [0x0000000000000000]              
    class APawn*                                       MonitoredPawn;                                            // 0x03FC (0x0004) [0x0000000000000000]              
    float                                              MonitorMaxDistSq;                                         // 0x0400 (0x0004) [0x0000000000000000]              
    struct FVector                                     LastSeenPos;                                              // 0x0404 (0x000C) [0x0000000000000000]              
    struct FVector                                     LastSeeingPos;                                            // 0x0410 (0x000C) [0x0000000000000000]              
    float                                              LastSeenTime;                                             // 0x041C (0x0004) [0x0000000000000000]              
    float                                              TrackingReactionTime;                                     // 0x0420 (0x0004) [0x0000000000000000]              
    float                                              BaseTrackingReactionTime;                                 // 0x0424 (0x0004) [0x0000000000000000]              
    struct FVector                                     TrackedVelocity;                                          // 0x0428 (0x000C) [0x0000000000000000]              
    class ANavigationPoint*                            SquadRouteGoal;                                           // 0x0434 (0x0004) [0x0000000000000000]              
    class APawn*                                       BlockedAimTarget;                                         // 0x0438 (0x0004) [0x0000000000000000]              
    float                                              LastIterativeCheck;                                       // 0x043C (0x0004) [0x0000000000000000]              
    float                                              AimUpdateFrequency;                                       // 0x0440 (0x0004) [0x0000000000000000]              
    float                                              LastAimUpdateTime;                                        // 0x0444 (0x0004) [0x0000000000000000]              
    float                                              ErrorUpdateFrequency;                                     // 0x0448 (0x0004) [0x0000000000000000]              
    float                                              LastErrorUpdateTime;                                      // 0x044C (0x0004) [0x0000000000000000]              
    float                                              CurrentAimError;                                          // 0x0450 (0x0004) [0x0000000000000000]              
    float                                              DodgeLandZ;                                               // 0x0454 (0x0004) [0x0000000000000000]              
    class AActor*                                      FearSpots[ 0x2 ];                                         // 0x0458 (0x0008) [0x0000000000000000]              
    float                                              DodgeToGoalPct;                                           // 0x0460 (0x0004) [0x0000000000000000]              
    float                                              MultiJumpZ;                                               // 0x0464 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1378 ];

        return pClassPointer;
    };

    void eventDelayedLeaveVehicle ( );
    void eventDelayedWarning ( );
    void eventMissedDodge ( );
    float eventAdjustAimError ( float TargetDist, unsigned long bInstantProj );
    float eventSuperDesireability ( class APickupFactory* P );
    bool eventSpecialJumpCost ( float RequiredJumpZ, float* Cost );
    void eventMayDodgeToMoveTarget ( );
    void eventTimeDJReset ( );
    void eventMonitoredPawnAlert ( );
    void eventWhatToDoNext ( );
    class AActor* FindBestSuperPickup ( float MaxDist );
    void BuildSquadRoute ( );
    class AActor* FindPathToSquadRoute ( unsigned long bWeightDetours );
    class AActor* FindBestInventoryPath ( float* MinWeight );
    bool CanMakePathTo ( class AActor* A );
    void LatentWhatToDoNext ( );
    void WaitToSeeEnemy ( );
    void eventReceiveRunOverWarning ( class AUDKVehicle* V, float projSpeed, struct FVector VehicleDir );
    void eventExecuteWhatToDoNext ( );
    class AActor* FaceActor ( float StrafingModifier );
};

// Class UDKBase.UDKCarriedObject
// 0x0038 (0x0218 - 0x01E0)
class AUDKCarriedObject : public AActor
{
public:
    class ATeamInfo*                                   Team;                                                     // 0x01E0 (0x0004) [0x0000000000000020]              ( CPF_Net )
    class ANavigationPoint*                            LastAnchor;                                               // 0x01E4 (0x0004) [0x0000000000000002]              ( CPF_Const )
    float                                              LastValidAnchorTime;                                      // 0x01E8 (0x0004) [0x0000000000000000]              
    class USkeletalMeshComponent*                      SkelMesh;                                                 // 0x01EC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    unsigned long                                      bHome : 1;                                                // 0x01F0 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
    class AUDKGameObjective*                           HomeBase;                                                 // 0x01F4 (0x0004) [0x0000000000000020]              ( CPF_Net )
    struct FVector                                     HomeBaseOffset;                                           // 0x01F8 (0x000C) [0x0000000000000000]              
    class AActor*                                      OldBase;                                                  // 0x0204 (0x0004) [0x0000000000000000]              
    class AActor*                                      OldBaseBase;                                              // 0x0208 (0x0004) [0x0000000000000000]              
    struct FVector                                     HUDLocation;                                              // 0x020C (0x000C) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1379 ];

        return pClassPointer;
    };

    unsigned char GetTeamNum ( );
    void eventOnBaseChainChanged ( );
    void eventNotReachableBy ( class APawn* P );
    void SetHUDLocation ( struct FVector NewHUDLocation );
};

// Class UDKBase.UDKDataStore_GameSearchBase
// 0x0004 (0x00AC - 0x00A8)
class UUDKDataStore_GameSearchBase : public UUIDataStore_OnlineGameSearch
{
public:
    class UUDKUIDataProvider_ServerDetails*            ServerDetailsProvider;                                    // 0x00A8 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1380 ];

        return pClassPointer;
    };

    bool HasExistingSearchResults ( );
    bool HasOutstandingQueries ( unsigned long bRestrictCheckToSelf );
    void OnSearchComplete ( unsigned long bWasSuccessful );
    bool eventSubmitGameSearch ( unsigned char ControllerIndex, unsigned long bInvalidateExistingSearchResults );
    void eventInit ( );
    bool GetEnabledMutators ( TArray< int >* MutatorIndices );
};

// Class UDKBase.UDKEmitCameraEffect
// 0x0008 (0x01F4 - 0x01EC)
class AUDKEmitCameraEffect : public AEmitter
{
public:
    float                                              DistFromCamera;                                           // 0x01EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class AUDKPlayerController*                        Cam;                                                      // 0x01F0 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1381 ];

        return pClassPointer;
    };

    void UpdateLocation ( float CamFOVDeg, struct FVector* CamLoc, struct FRotator* CamRot );
    void Deactivate ( );
    void Activate ( );
    void RegisterCamera ( class AUDKPlayerController* inCam );
    void Destroyed ( );
    void eventPostBeginPlay ( );
};

// Class UDKBase.UDKEmitterPool
// 0x000C (0x0244 - 0x0238)
class AUDKEmitterPool : public AEmitterPool
{
public:
    TArray< struct FAttachedExplosionLight >           RelativeExplosionLights;                                  // 0x0238 (0x000C) [0x0000000000480000]              ( CPF_Component | CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1382 ];

        return pClassPointer;
    };

    class UUDKExplosionLight* SpawnExplosionLight ( class UClass* LightClass, struct FVector SpawnLocation, class AActor* AttachToActor );
    void OnExplosionLightFinished ( class UUDKExplosionLight* Light );
    class UParticleSystemComponent* SpawnEmitter ( class UParticleSystem* EmitterTemplate, struct FVector SpawnLocation, struct FRotator SpawnRotation, class AActor* AttachToActor, unsigned long bInheritScaleFromBase );
};

// Class UDKBase.UDKExplosionLight
// 0x0028 (0x0270 - 0x0248)
class UUDKExplosionLight : public UPointLightComponent
{
public:
    unsigned long                                      bCheckFrameRate : 1;                                      // 0x0248 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bInitialized : 1;                                         // 0x0248 (0x0004) [0x0000000000000000] [0x00000002] 
    float                                              HighDetailFrameTime;                                      // 0x024C (0x0004) [0x0000000000000000]              
    float                                              Lifetime;                                                 // 0x0250 (0x0004) [0x0000000000000000]              
    int                                                TimeShiftIndex;                                           // 0x0254 (0x0004) [0x0000000000000000]              
    TArray< struct FLightValues >                      TimeShift;                                                // 0x0258 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    struct FScriptDelegate                             __OnLightFinished__Delegate;                              // 0x0264 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1383 ];

        return pClassPointer;
    };

    void OnLightFinished ( class UUDKExplosionLight* Light );
    void ResetLight ( );
};

// Class UDKBase.UDKForcedDirectionVolume
// 0x0024 (0x0270 - 0x024C)
class AUDKForcedDirectionVolume : public APhysicsVolume
{
public:
    class UClass*                                      TypeToForce;                                              // 0x024C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    unsigned long                                      bIgnoreHoverboards : 1;                                   // 0x0250 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
    unsigned long                                      bDenyExit : 1;                                            // 0x0250 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      bBlockPawns : 1;                                          // 0x0250 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
    unsigned long                                      bBlockSpectators : 1;                                     // 0x0250 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    class UArrowComponent*                             Arrow;                                                    // 0x0254 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
    struct FVector                                     ArrowDirection;                                           // 0x0258 (0x000C) [0x0000000000000000]              
    TArray< class AUDKVehicle* >                       TouchingVehicles;                                         // 0x0264 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1384 ];

        return pClassPointer;
    };

    bool StopsProjectile ( class AProjectile* P );
    void eventUnTouch ( class AActor* Other );
    void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
    void eventActorEnteredVolume ( class AActor* Other );
    void PostBeginPlay ( );
};

// Class UDKBase.UDKGame
// 0x0000 (0x0384 - 0x0384)
class AUDKGame : public AFrameworkGame
{
public:

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1385 ];

        return pClassPointer;
    };

};

// Class UDKBase.UDKGameInteraction
// 0x0004 (0x0160 - 0x015C)
class UUDKGameInteraction : public UUIInteraction
{
public:
    int                                                BlockUIInputSemaphore;                                    // 0x015C (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1386 ];

        return pClassPointer;
    };

    void NotifyGameSessionEnded ( );
    void eventBlockUIInput ( unsigned long bBlock );
    void eventClearUIInputBlocks ( );
    bool ShouldProcessUIInput ( );
};

// Class UDKBase.UDKGameSettingsCommon
// 0x0000 (0x00AC - 0x00AC)
class UUDKGameSettingsCommon : public UOnlineGameSettings
{
public:

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1387 ];

        return pClassPointer;
    };

    struct FString BlobToString ( struct FString* InBlob );
    bool StringToBlob ( struct FString* InString, struct FString* OutBlob );
};

// Class UDKBase.UDKGameViewportClient
// 0x000C (0x012C - 0x0120)
class UUDKGameViewportClient : public UGameViewportClient
{
public:
    struct FString                                     HintLocFileName;                                          // 0x0120 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1388 ];

        return pClassPointer;
    };

    struct FString LoadRandomLocalizedHintMessage ( struct FString Category1Name, struct FString Category2Name );
};

// Class UDKBase.UDKHUD
// 0x0044 (0x0598 - 0x0554)
class AUDKHUD : public AMobileHUD
{
public:
    class UFont*                                       GlowFonts[ 0x2 ];                                         // 0x0554 (0x0008) [0x0000000000000000]              
    float                                              PulseDuration;                                            // 0x055C (0x0004) [0x0000000000000000]              
    float                                              PulseSplit;                                               // 0x0560 (0x0004) [0x0000000000000000]              
    float                                              PulseMultiplier;                                          // 0x0564 (0x0004) [0x0000000000000000]              
    struct FFontRenderInfo                             TextRenderInfo;                                           // 0x0568 (0x0028) [0x0000000000000000]              
    class UFont*                                       ConsoleIconFont;                                          // 0x0590 (0x0004) [0x0000000000000000]              
    class UFont*                                       BindTextFont;                                             // 0x0594 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1389 ];

        return pClassPointer;
    };

    void TranslateBindToFont ( struct FString InBindStr, class UFont** DrawFont, struct FString* OutBindStr );
    void DrawGlowText ( struct FString Text, float X, float Y, float MaxHeightInPixels, float PulseTime, unsigned long bRightJustified );
};

// Class UDKBase.UDKJumpPad
// 0x0020 (0x02D8 - 0x02B8)
class AUDKJumpPad : public ANavigationPoint
{
public:
    struct FVector                                     JumpVelocity;                                             // 0x02B8 (0x000C) [0x0000000000000000]              
    class APathNode*                                   JumpTarget;                                               // 0x02C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class USoundCue*                                   JumpSound;                                                // 0x02C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              JumpTime;                                                 // 0x02CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              JumpAirControl;                                           // 0x02D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UAudioComponent*                             JumpAmbientSound;                                         // 0x02D4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1390 ];

        return pClassPointer;
    };

    bool eventSuggestMovePreparation ( class APawn* Other );
    void eventPostTouch ( class AActor* Other );
    void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
};

// Class UDKBase.UDKKActorBreakable
// 0x0038 (0x0310 - 0x02D8)
class AUDKKActorBreakable : public AKActor
{
public:
    unsigned long                                      bHasHealth : 1;                                           // 0x02D8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
    unsigned long                                      bDamageOnEncroachment : 1;                                // 0x02D8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
    unsigned long                                      bResetDOEWhenAsleep : 1;                                  // 0x02D8 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
    unsigned long                                      bTakeDamageOnEncroachment : 1;                            // 0x02D8 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
    unsigned long                                      bBreakWhenCausingDamage : 1;                              // 0x02D8 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
    unsigned long                                      bBroken : 1;                                              // 0x02D8 (0x0004) [0x0000000000000000] [0x00000020] 
    int                                                Health;                                                   // 0x02DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                EncroachDamage_Other;                                     // 0x02E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                EncroachDamage_Self;                                      // 0x02E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UClass*                                      DmgTypeClass;                                             // 0x02E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                DOEResetThreshold;                                        // 0x02EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UParticleSystem*                             BrokenTemplate;                                           // 0x02F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class AController*                                 InstigatorController;                                     // 0x02F4 (0x0004) [0x0000000000000000]              
    struct FScriptDelegate                             __OnBreakApart__Delegate;                                 // 0x02F8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    struct FScriptDelegate                             __OnEncroach__Delegate;                                   // 0x0304 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1391 ];

        return pClassPointer;
    };

    void eventReplicatedEvent ( struct FName VarName );
    void BreakApart ( );
    bool EncroachingOn ( class AActor* Other );
    void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
    bool OnEncroach ( class AActor* Other );
    void OnBreakApart ( );
};

// Class UDKBase.UDKMapInfo
// 0x0004 (0x0040 - 0x003C)
class UUDKMapInfo : public UMapInfo
{
public:
    float                                              VisibilityModifier;                                       // 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1392 ];

        return pClassPointer;
    };

};

// Class UDKBase.UDKMapMusicInfo
// 0x00A0 (0x00DC - 0x003C)
class UUDKMapMusicInfo : public UObject
{
public:
    struct FMusicForAMap                               MapMusic;                                                 // 0x003C (0x0064) [0x0000000000000001]              ( CPF_Edit )
    struct FStingersForAMap                            MapStingers;                                              // 0x00A0 (0x003C) [0x0000000000000001]              ( CPF_Edit )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1393 ];

        return pClassPointer;
    };

};

// Class UDKBase.UDKParticleSystemComponent
// 0x0014 (0x02F4 - 0x02E0)
class UUDKParticleSystemComponent : public UParticleSystemComponent
{
public:
    float                                              FOV;                                                      // 0x02E0 (0x0004) [0x0000000000000002]              ( CPF_Const )
    unsigned long                                      bHasSavedScale3D : 1;                                     // 0x02E4 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
    struct FVector                                     SavedScale3D;                                             // 0x02E8 (0x000C) [0x0000000000000002]              ( CPF_Const )

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1394 ];

        return pClassPointer;
    };

    void SetFOV ( float NewFOV );
};

// Class UDKBase.UDKPickupFactory
// 0x00A4 (0x0378 - 0x02D4)
class AUDKPickupFactory : public APickupFactory
{
public:
    unsigned long                                      bIsRespawning : 1;                                        // 0x02D4 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
    unsigned long                                      bPulseBase : 1;                                           // 0x02D4 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
    unsigned long                                      bIsDisabled : 1;                                          // 0x02D4 (0x0004) [0x0000000000000020] [0x00000004] ( CPF_Net )
    unsigned long                                      bFloatingPickup : 1;                                      // 0x02D4 (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bRandomStart : 1;                                         // 0x02D4 (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      bRotatingPickup : 1;                                      // 0x02D4 (0x0004) [0x0000000000000000] [0x00000020] 
    unsigned long                                      bUpdatingPickup : 1;                                      // 0x02D4 (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      bDoVisibilityFadeIn : 1;                                  // 0x02D4 (0x0004) [0x0000000000000000] [0x00000080] 
    class UStaticMeshComponent*                        BaseMesh;                                                 // 0x02D8 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
    class UMaterialInstanceConstant*                   BaseMaterialInstance;                                     // 0x02DC (0x0004) [0x0000000000000000]              
    struct FLinearColor                                BaseBrightEmissive;                                       // 0x02E0 (0x0010) [0x0000000000000000]              
    struct FLinearColor                                BaseDimEmissive;                                          // 0x02F0 (0x0010) [0x0000000000000000]              
    float                                              BasePulseRate;                                            // 0x0300 (0x0004) [0x0000000000000000]              
    float                                              BasePulseTime;                                            // 0x0304 (0x0004) [0x0000000000000000]              
    float                                              PulseThreshold;                                           // 0x0308 (0x0004) [0x0000000000000000]              
    struct FLinearColor                                BaseTargetEmissive;                                       // 0x030C (0x0010) [0x0000000000000000]              
    struct FLinearColor                                BaseEmissive;                                             // 0x031C (0x0010) [0x0000000000000000]              
    struct FName                                       BaseMaterialParamName;                                    // 0x032C (0x0008) [0x0000000000000000]              
    float                                              BobTimer;                                                 // 0x0334 (0x0004) [0x0000000000000000]              
    float                                              BobOffset;                                                // 0x0338 (0x0004) [0x0000000000000000]              
    float                                              BobSpeed;                                                 // 0x033C (0x0004) [0x0000000000000000]              
    float                                              BobBaseOffset;                                            // 0x0340 (0x0004) [0x0000000000000000]              
    float                                              YawRotationRate;                                          // 0x0344 (0x0004) [0x0000000000000000]              
    struct FVector                                     PivotTranslation;                                         // 0x0348 (0x000C) [0x0000000000000000]              
    struct FName                                       VisibilityParamName;                                      // 0x0354 (0x0008) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   MIC_Visibility;                                           // 0x035C (0x0004) [0x0000000000000000]              
    class UMaterialInstanceConstant*                   MIC_VisibilitySecondMaterial;                             // 0x0360 (0x0004) [0x0000000000000000]              
    class UParticleSystemComponent*                    Glow;                                                     // 0x0364 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    struct FName                                       GlowEmissiveParam;                                        // 0x0368 (0x0008) [0x0000000000000000]              
