/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: UDKBase_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function UDKBase.UDKGameObjective.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AUDKGameObjective_execGetTeamNum_Parms
{
    unsigned char                                      ReturnValue;                                              // 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKGameObjective.DrawIcon
// [0x00020500] ( FUNC_Native )
struct AUDKGameObjective_execDrawIcon_Parms
{
    class UCanvas*                                     Canvas;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     IconLocation;                                             // 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    float                                              IconWidth;                                                // 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              IconAlpha;                                                // 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AUDKPlayerController*                        PlayerOwner;                                              // 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FLinearColor                                DrawColor;                                                // 0x001C (0x0010) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKGameObjective.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AUDKGameObjective_execSetHUDLocation_Parms
{
    struct FVector                                     NewHUDLocation;                                           // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKGameObjective.TriggerFlagEvent
// [0x00020000] 
struct AUDKGameObjective_execTriggerFlagEvent_Parms
{
    struct FName                                       EventType;                                                // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKGameObjective.BotNearObjective
// [0x00020000] 
struct AUDKGameObjective_execBotNearObjective_Parms
{
    class AAIController*                               C;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKGameObjective.GetBestViewTarget
// [0x00020802] ( FUNC_Event )
struct AUDKGameObjective_eventGetBestViewTarget_Parms
{
    class AActor*                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKGameObjective.ObjectiveChanged
// [0x00020000] 
struct AUDKGameObjective_execObjectiveChanged_Parms
{
};

// Function UDKBase.UDKPawn.StuckFalling
// [0x00020800] ( FUNC_Event )
struct AUDKPawn_eventStuckFalling_Parms
{
};

// Function UDKBase.UDKPawn.UpdateEyeHeight
// [0x00020800] ( FUNC_Event )
struct AUDKPawn_eventUpdateEyeHeight_Parms
{
    float                                              DeltaTime;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPawn.TakeHitBlendedOut
// [0x00020900] ( FUNC_Event )
struct AUDKPawn_eventTakeHitBlendedOut_Parms
{
};

// Function UDKBase.UDKPawn.StartFeignDeathRecoveryAnim
// [0x00020900] ( FUNC_Event )
struct AUDKPawn_eventStartFeignDeathRecoveryAnim_Parms
{
};

// Function UDKBase.UDKPawn.SetHandIKEnabled
// [0x00020100] 
struct AUDKPawn_execSetHandIKEnabled_Parms
{
    unsigned long                                      bEnabled : 1;                                             // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPawn.SetWeaponAttachmentVisibility
// [0x00020100] 
struct AUDKPawn_execSetWeaponAttachmentVisibility_Parms
{
    unsigned long                                      bAttachmentVisible : 1;                                   // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPawn.NativePostRenderFor
// [0x00020500] ( FUNC_Native )
struct AUDKPawn_execNativePostRenderFor_Parms
{
    class APlayerController*                           PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UCanvas*                                     Canvas;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     CameraPosition;                                           // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     CameraDir;                                                // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPawn.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AUDKPawn_execSetHUDLocation_Parms
{
    struct FVector                                     NewHUDLocation;                                           // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPawn.SuggestJumpVelocity
// [0x00424400] ( FUNC_Native )
struct AUDKPawn_execSuggestJumpVelocity_Parms
{
    struct FVector                                     JumpVelocity;                                             // 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    struct FVector                                     Destination;                                              // 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Start;                                                    // 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bRequireFallLanding : 1;                                  // 0x0024 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPawn.StartCrouch
// [0x00020902] ( FUNC_Event )
struct AUDKPawn_eventStartCrouch_Parms
{
    float                                              HeightAdjust;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPawn.EndCrouch
// [0x00020902] ( FUNC_Event )
struct AUDKPawn_eventEndCrouch_Parms
{
    float                                              HeightAdjust;                                             // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPawn.StoppedFalling
// [0x00020802] ( FUNC_Event )
struct AUDKPawn_eventStoppedFalling_Parms
{
};

// Function UDKBase.UDKPawn.HoldGameObject
// [0x00020900] ( FUNC_Event )
struct AUDKPawn_eventHoldGameObject_Parms
{
    class AUDKCarriedObject*                           UDKGameObj;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPawn.IsInvisible
// [0x00020400] ( FUNC_Native )
struct AUDKPawn_execIsInvisible_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPawn.GetTargetLocation
// [0x00024500] ( FUNC_Native )
struct AUDKPawn_execGetTargetLocation_Parms
{
    class AActor*                                      RequestedBy;                                              // 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      bRequestAlternateLoc : 1;                                 // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    struct FVector                                     ReturnValue;                                              // 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPawn.EnsureOverlayComponentLast
// [0x00020400] ( FUNC_Native )
struct AUDKPawn_execEnsureOverlayComponentLast_Parms
{
};

// Function UDKBase.UDKPawn.RestorePreRagdollCollisionComponent
// [0x00020400] ( FUNC_Native )
struct AUDKPawn_execRestorePreRagdollCollisionComponent_Parms
{
};

// Function UDKBase.UDKPawn.GetBoundingCylinder
// [0x00420400] ( FUNC_Native )
struct AUDKPawn_execGetBoundingCylinder_Parms
{
    float                                              CollisionRadius;                                          // 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    float                                              CollisionHeight;                                          // 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function UDKBase.UDKBot.DelayedLeaveVehicle
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventDelayedLeaveVehicle_Parms
{
};

// Function UDKBase.UDKBot.DelayedWarning
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventDelayedWarning_Parms
{
};

// Function UDKBase.UDKBot.MissedDodge
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventMissedDodge_Parms
{
};

// Function UDKBase.UDKBot.AdjustAimError
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventAdjustAimError_Parms
{
    float                                              TargetDist;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bInstantProj : 1;                                         // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    float                                              ReturnValue;                                              // 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.SuperDesireability
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventSuperDesireability_Parms
{
    class APickupFactory*                              P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.SpecialJumpCost
// [0x00420800] ( FUNC_Event )
struct AUDKBot_eventSpecialJumpCost_Parms
{
    float                                              RequiredJumpZ;                                            // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              Cost;                                                     // 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.MayDodgeToMoveTarget
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventMayDodgeToMoveTarget_Parms
{
};

// Function UDKBase.UDKBot.TimeDJReset
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventTimeDJReset_Parms
{
};

// Function UDKBase.UDKBot.MonitoredPawnAlert
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventMonitoredPawnAlert_Parms
{
};

// Function UDKBase.UDKBot.WhatToDoNext
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventWhatToDoNext_Parms
{
};

// Function UDKBase.UDKBot.FindBestSuperPickup
// [0x00020400] ( FUNC_Native )
struct AUDKBot_execFindBestSuperPickup_Parms
{
    float                                              MaxDist;                                                  // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.BuildSquadRoute
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AUDKBot_execBuildSquadRoute_Parms
{
};

// Function UDKBase.UDKBot.FindPathToSquadRoute
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AUDKBot_execFindPathToSquadRoute_Parms
{
    unsigned long                                      bWeightDetours : 1;                                       // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    class AActor*                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.FindBestInventoryPath
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AUDKBot_execFindBestInventoryPath_Parms
{
    float                                              MinWeight;                                                // 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    class AActor*                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.CanMakePathTo
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AUDKBot_execCanMakePathTo_Parms
{
    class AActor*                                      A;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKBot.LatentWhatToDoNext
// [0x00020409] ( FUNC_Final | FUNC_Native )
struct AUDKBot_execLatentWhatToDoNext_Parms
{
};

// Function UDKBase.UDKBot.WaitToSeeEnemy
// [0x00020409] ( FUNC_Final | FUNC_Native )
struct AUDKBot_execWaitToSeeEnemy_Parms
{
};

// Function UDKBase.UDKBot.ReceiveRunOverWarning
// [0x00020800] ( FUNC_Event )
struct AUDKBot_eventReceiveRunOverWarning_Parms
{
    class AUDKVehicle*                                 V;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              projSpeed;                                                // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     VehicleDir;                                               // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKBot.ExecuteWhatToDoNext
// [0x00080800] ( FUNC_Event )
struct AUDKBot_eventExecuteWhatToDoNext_Parms
{
};

// Function UDKBase.UDKBot.FaceActor
// [0x00020000] 
struct AUDKBot_execFaceActor_Parms
{
    float                                              StrafingModifier;                                         // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKCarriedObject.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AUDKCarriedObject_execGetTeamNum_Parms
{
    unsigned char                                      ReturnValue;                                              // 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKCarriedObject.OnBaseChainChanged
// [0x00020900] ( FUNC_Event )
struct AUDKCarriedObject_eventOnBaseChainChanged_Parms
{
};

// Function UDKBase.UDKCarriedObject.NotReachableBy
// [0x00020800] ( FUNC_Event )
struct AUDKCarriedObject_eventNotReachableBy_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKCarriedObject.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AUDKCarriedObject_execSetHUDLocation_Parms
{
    struct FVector                                     NewHUDLocation;                                           // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKDataStore_GameSearchBase.HasExistingSearchResults
// [0x00020002] 
struct UUDKDataStore_GameSearchBase_execHasExistingSearchResults_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // unsigned long                                   bQueryCompleted : 1;                                      // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UDKBase.UDKDataStore_GameSearchBase.HasOutstandingQueries
// [0x00024002] 
struct UUDKDataStore_GameSearchBase_execHasOutstandingQueries_Parms
{
    unsigned long                                      bRestrictCheckToSelf : 1;                                 // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // unsigned long                                   bResult : 1;                                              // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
    // int                                             I;                                                        // 0x000C (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKDataStore_GameSearchBase.OnSearchComplete
// [0x00020002] 
struct UUDKDataStore_GameSearchBase_execOnSearchComplete_Parms
{
    unsigned long                                      bWasSuccessful : 1;                                       // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKDataStore_GameSearchBase.SubmitGameSearch
// [0x00024802] ( FUNC_Event )
struct UUDKDataStore_GameSearchBase_eventSubmitGameSearch_Parms
{
    unsigned char                                      ControllerIndex;                                          // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bInvalidateExistingSearchResults : 1;                     // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // unsigned long                                   bResult : 1;                                              // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UDKBase.UDKDataStore_GameSearchBase.Init
// [0x00020802] ( FUNC_Event )
struct UUDKDataStore_GameSearchBase_eventInit_Parms
{
};

// Function UDKBase.UDKDataStore_GameSearchBase.GetEnabledMutators
// [0x00420400] ( FUNC_Native )
struct UUDKDataStore_GameSearchBase_execGetEnabledMutators_Parms
{
    TArray< int >                                      MutatorIndices;                                           // 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    unsigned long                                      ReturnValue : 1;                                          // 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKEmitCameraEffect.UpdateLocation
// [0x00420400] ( FUNC_Native )
struct AUDKEmitCameraEffect_execUpdateLocation_Parms
{
    struct FVector                                     CamLoc;                                                   // 0x0000 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
    struct FRotator                                    CamRot;                                                   // 0x000C (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
    float                                              CamFOVDeg;                                                // 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKEmitCameraEffect.Deactivate
// [0x00020002] 
struct AUDKEmitCameraEffect_execDeactivate_Parms
{
};

// Function UDKBase.UDKEmitCameraEffect.Activate
// [0x00020002] 
struct AUDKEmitCameraEffect_execActivate_Parms
{
};

// Function UDKBase.UDKEmitCameraEffect.RegisterCamera
// [0x00020002] 
struct AUDKEmitCameraEffect_execRegisterCamera_Parms
{
    class AUDKPlayerController*                        inCam;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKEmitCameraEffect.Destroyed
// [0x00020002] 
struct AUDKEmitCameraEffect_execDestroyed_Parms
{
};

// Function UDKBase.UDKEmitCameraEffect.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct AUDKEmitCameraEffect_eventPostBeginPlay_Parms
{
};

// Function UDKBase.UDKEmitterPool.SpawnExplosionLight
// [0x00024002] 
struct AUDKEmitterPool_execSpawnExplosionLight_Parms
{
    class UClass*                                      LightClass;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     SpawnLocation;                                            // 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      AttachToActor;                                            // 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    class UUDKExplosionLight*                          ReturnValue;                                              // 0x0014 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
    // class UUDKExplosionLight*                       Light;                                                    // 0x0018 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
    // int                                             I;                                                        // 0x001C (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKEmitterPool.OnExplosionLightFinished
// [0x00020002] 
struct AUDKEmitterPool_execOnExplosionLightFinished_Parms
{
    class UUDKExplosionLight*                          Light;                                                    // 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
    // int                                             I;                                                        // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKEmitterPool.SpawnEmitter
// [0x00024002] 
struct AUDKEmitterPool_execSpawnEmitter_Parms
{
    class UParticleSystem*                             EmitterTemplate;                                          // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     SpawnLocation;                                            // 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FRotator                                    SpawnRotation;                                            // 0x0010 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    class AActor*                                      AttachToActor;                                            // 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      bInheritScaleFromBase : 1;                                // 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    class UParticleSystemComponent*                    ReturnValue;                                              // 0x0024 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
    // class APlayerController*                        PC;                                                       // 0x0028 (0x0004) [0x0000000000000000]              
    // int                                             LODLevel;                                                 // 0x002C (0x0004) [0x0000000000000000]              
    // class UParticleSystemComponent*                 PSC;                                                      // 0x0030 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function UDKBase.UDKExplosionLight.OnLightFinished
// [0x00120000] 
struct UUDKExplosionLight_execOnLightFinished_Parms
{
    class UUDKExplosionLight*                          Light;                                                    // 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function UDKBase.UDKExplosionLight.ResetLight
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUDKExplosionLight_execResetLight_Parms
{
};

// Function UDKBase.UDKForcedDirectionVolume.StopsProjectile
// [0x00020102] 
struct AUDKForcedDirectionVolume_execStopsProjectile_Parms
{
    class AProjectile*                                 P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKForcedDirectionVolume.UnTouch
// [0x00020902] ( FUNC_Event )
struct AUDKForcedDirectionVolume_eventUnTouch_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // unsigned long                                   bInAnotherVolume : 1;                                     // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
    // class AUDKForcedDirectionVolume*                AnotherVolume;                                            // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKForcedDirectionVolume.Touch
// [0x00020902] ( FUNC_Event )
struct AUDKForcedDirectionVolume_eventTouch_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UPrimitiveComponent*                         OtherComp;                                                // 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitNormal;                                                // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    // class AUDKVehicle*                              V;                                                        // 0x0020 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKForcedDirectionVolume.ActorEnteredVolume
// [0x00020802] ( FUNC_Event )
struct AUDKForcedDirectionVolume_eventActorEnteredVolume_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKForcedDirectionVolume.PostBeginPlay
// [0x00020102] 
struct AUDKForcedDirectionVolume_execPostBeginPlay_Parms
{
};

// Function UDKBase.UDKGameInteraction.NotifyGameSessionEnded
// [0x00020002] 
struct UUDKGameInteraction_execNotifyGameSessionEnded_Parms
{
};

// Function UDKBase.UDKGameInteraction.BlockUIInput
// [0x00020802] ( FUNC_Event )
struct UUDKGameInteraction_eventBlockUIInput_Parms
{
    unsigned long                                      bBlock : 1;                                               // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKGameInteraction.ClearUIInputBlocks
// [0x00020802] ( FUNC_Event )
struct UUDKGameInteraction_eventClearUIInputBlocks_Parms
{
};

// Function UDKBase.UDKGameInteraction.ShouldProcessUIInput
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUDKGameInteraction_execShouldProcessUIInput_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKGameSettingsCommon.BlobToString
// [0x00422400] ( FUNC_Native )
struct UUDKGameSettingsCommon_execBlobToString_Parms
{
    struct FString                                     InBlob;                                                   // 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    struct FString                                     ReturnValue;                                              // 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function UDKBase.UDKGameSettingsCommon.StringToBlob
// [0x00422400] ( FUNC_Native )
struct UUDKGameSettingsCommon_execStringToBlob_Parms
{
    struct FString                                     InString;                                                 // 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    struct FString                                     OutBlob;                                                  // 0x000C (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    unsigned long                                      ReturnValue : 1;                                          // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKGameViewportClient.LoadRandomLocalizedHintMessage
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUDKGameViewportClient_execLoadRandomLocalizedHintMessage_Parms
{
    struct FString                                     Category1Name;                                            // 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
    struct FString                                     Category2Name;                                            // 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
    struct FString                                     ReturnValue;                                              // 0x0018 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function UDKBase.UDKHUD.TranslateBindToFont
// [0x00422400] ( FUNC_Native )
struct AUDKHUD_execTranslateBindToFont_Parms
{
    struct FString                                     InBindStr;                                                // 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
    class UFont*                                       DrawFont;                                                 // 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    struct FString                                     OutBindStr;                                               // 0x0010 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function UDKBase.UDKHUD.DrawGlowText
// [0x00024400] ( FUNC_Native )
struct AUDKHUD_execDrawGlowText_Parms
{
    struct FString                                     Text;                                                     // 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
    float                                              X;                                                        // 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              Y;                                                        // 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              MaxHeightInPixels;                                        // 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    float                                              PulseTime;                                                // 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      bRightJustified : 1;                                      // 0x001C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function UDKBase.UDKJumpPad.SuggestMovePreparation
// [0x00020802] ( FUNC_Event )
struct AUDKJumpPad_eventSuggestMovePreparation_Parms
{
    class APawn*                                       Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class AVehicle*                                 V;                                                        // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKJumpPad.PostTouch
// [0x00020802] ( FUNC_Event )
struct AUDKJumpPad_eventPostTouch_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class AUDKPawn*                                 P;                                                        // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKJumpPad.Touch
// [0x00020802] ( FUNC_Event )
struct AUDKJumpPad_eventTouch_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UPrimitiveComponent*                         OtherComp;                                                // 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitNormal;                                                // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKKActorBreakable.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct AUDKKActorBreakable_eventReplicatedEvent_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKKActorBreakable.BreakApart
// [0x00020002] 
struct AUDKKActorBreakable_execBreakApart_Parms
{
};

// Function UDKBase.UDKKActorBreakable.EncroachingOn
// [0x00020002] 
struct AUDKKActorBreakable_execEncroachingOn_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKKActorBreakable.TakeDamage
// [0x00024802] ( FUNC_Event )
struct AUDKKActorBreakable_eventTakeDamage_Parms
{
    int                                                Damage;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Momentum;                                                 // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FTraceHitInfo                               HitInfo;                                                  // 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function UDKBase.UDKKActorBreakable.OnEncroach
// [0x00120000] 
struct AUDKKActorBreakable_execOnEncroach_Parms
{
    class AActor*                                      Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKKActorBreakable.OnBreakApart
// [0x00120000] 
struct AUDKKActorBreakable_execOnBreakApart_Parms
{
};

// Function UDKBase.UDKParticleSystemComponent.SetFOV
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUDKParticleSystemComponent_execSetFOV_Parms
{
    float                                              NewFOV;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPickupFactory.SetPickupHidden
// [0x00020102] 
struct AUDKPickupFactory_execSetPickupHidden_Parms
{
};

// Function UDKBase.UDKPickupFactory.SetPickupVisible
// [0x00020102] 
struct AUDKPickupFactory_execSetPickupVisible_Parms
{
};

// Function UDKBase.UDKPlayerController.SetUseTiltForwardAndBack
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execSetUseTiltForwardAndBack_Parms
{
    unsigned long                                      bActive : 1;                                              // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPlayerController.SetOnlyUseControllerTiltInput
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execSetOnlyUseControllerTiltInput_Parms
{
    unsigned long                                      bActive : 1;                                              // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPlayerController.SetControllerTiltActive
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execSetControllerTiltActive_Parms
{
    unsigned long                                      bActive : 1;                                              // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPlayerController.SetControllerTiltDesiredIfAvailable
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execSetControllerTiltDesiredIfAvailable_Parms
{
    unsigned long                                      bActive : 1;                                              // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPlayerController.IsControllerTiltActive
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execIsControllerTiltActive_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPlayerController.GetTargetAdhesionFrictionTarget
// [0x00420400] ( FUNC_Native )
struct AUDKPlayerController_execGetTargetAdhesionFrictionTarget_Parms
{
    float                                              MaxDistance;                                              // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     CamLoc;                                                   // 0x0004 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
    struct FRotator                                    CamRot;                                                   // 0x0010 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
    class APawn*                                       ReturnValue;                                              // 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPlayerController.ClearCameraEffect
// [0x00020002] 
struct AUDKPlayerController_execClearCameraEffect_Parms
{
};

// Function UDKBase.UDKPlayerController.ClientSpawnCameraEffect
// [0x01820142] 
struct AUDKPlayerController_execClientSpawnCameraEffect_Parms
{
    class UClass*                                      CameraEffectClass;                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // struct FVector                                  CamLoc;                                                   // 0x0004 (0x000C) [0x0000000000000000]              
    // struct FRotator                                 CamRot;                                                   // 0x0010 (0x000C) [0x0000000000000000]              
};

// Function UDKBase.UDKPlayerController.RemoveCameraEffect
// [0x00020002] 
struct AUDKPlayerController_execRemoveCameraEffect_Parms
{
    class AUDKEmitCameraEffect*                        CamEmitter;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPlayerController.IsMouseAvailable
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execIsMouseAvailable_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPlayerController.IsKeyboardAvailable
// [0x00020500] ( FUNC_Native )
struct AUDKPlayerController_execIsKeyboardAvailable_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKPlayerController.SetHardwarePhysicsEnabled
// [0x00020400] ( FUNC_Native )
struct AUDKPlayerController_execSetHardwarePhysicsEnabled_Parms
{
    unsigned long                                      bEnabled : 1;                                             // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UDKBase.UDKPlayerController.SetGamma
// [0x00020400] ( FUNC_Native )
struct AUDKPlayerController_execSetGamma_Parms
{
    float                                              GammaValue;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKPlayerInput.GetUDKBindNameFromCommand
// [0x00020400] ( FUNC_Native )
struct UUDKPlayerInput_execGetUDKBindNameFromCommand_Parms
{
    struct FString                                     BindCommand;                                              // 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
    struct FString                                     ReturnValue;                                              // 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function UDKBase.UDKProfileSettings.ResetKeysToDefault
// [0x00026400] ( FUNC_Native )
struct UUDKProfileSettings_execResetKeysToDefault_Parms
{
    class ULocalPlayer*                                InPlayerOwner;                                            // 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function UDKBase.UDKProfileSettings.ResetToDefault
// [0x00020400] ( FUNC_Native )
struct UUDKProfileSettings_execResetToDefault_Parms
{
    int                                                ProfileId;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKProjectile.CreateProjectileLight
// [0x00020900] ( FUNC_Event )
struct AUDKProjectile_eventCreateProjectileLight_Parms
{
};

// Function UDKBase.UDKProjectile.GetTerminalVelocity
// [0x00020400] ( FUNC_Native )
struct AUDKProjectile_execGetTerminalVelocity_Parms
{
    float                                              ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKScout.SuggestJumpVelocity
// [0x00424400] ( FUNC_Native )
struct AUDKScout_execSuggestJumpVelocity_Parms
{
    struct FVector                                     JumpVelocity;                                             // 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    struct FVector                                     Destination;                                              // 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Start;                                                    // 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bRequireFallLanding : 1;                                  // 0x0024 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKScriptedNavigationPoint.NotifyAnchorFindingResult
// [0x00020800] ( FUNC_Event )
struct AUDKScriptedNavigationPoint_eventNotifyAnchorFindingResult_Parms
{
    class ANavigationPoint*                            EndAnchor;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class APawn*                                       RouteFinder;                                              // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKScriptedNavigationPoint.SpecifyEndAnchor
// [0x00020800] ( FUNC_Event )
struct AUDKScriptedNavigationPoint_eventSpecifyEndAnchor_Parms
{
    class APawn*                                       RouteFinder;                                              // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class ANavigationPoint*                            ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKSkeletalMeshComponent.SetFOV
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUDKSkeletalMeshComponent_execSetFOV_Parms
{
    float                                              NewFOV;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKSkeletalMeshComponent.PreloadTextures
// [0x00020902] ( FUNC_Event )
struct UUDKSkeletalMeshComponent_eventPreloadTextures_Parms
{
    unsigned long                                      bForcePreload : 1;                                        // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    float                                              ClearTime;                                                // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // int                                             Idx;                                                      // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKTeamOwnedInfo.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AUDKTeamOwnedInfo_execGetTeamNum_Parms
{
    unsigned char                                      ReturnValue;                                              // 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKTeleporterBase.Accept
// [0x00020902] ( FUNC_Event )
struct AUDKTeleporterBase_eventAccept_Parms
{
    class AActor*                                      Incoming;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      Source;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKTeleporterBase.InitializePortalEffect
// [0x00020102] 
struct AUDKTeleporterBase_execInitializePortalEffect_Parms
{
    class AActor*                                      Dest;                                                     // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // unsigned long                                   bStaticCapture : 1;                                       // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UDKBase.UDKTeleporterBase.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct AUDKTeleporterBase_eventPostBeginPlay_Parms
{
    // class ATeleporter*                              Dest;                                                     // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKUIDataProvider_SearchResult.IsPrivateServer
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataProvider_SearchResult_execIsPrivateServer_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataProvider_SimpleElementProvider.GetElementCount
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataProvider_SimpleElementProvider_execGetElementCount_Parms
{
    int                                                ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataProvider_ServerDetails.GetElementCount
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataProvider_ServerDetails_execGetElementCount_Parms
{
    int                                                ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataProvider_ServerDetails.GetSearchResultsProvider
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataProvider_ServerDetails_execGetSearchResultsProvider_Parms
{
    class UUIDataProvider_Settings*                    ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataProvider_StringArray.GetElementCount
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataProvider_StringArray_execGetElementCount_Parms
{
    int                                                ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataStore_MenuItems.AddListElementProvidersKey
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataStore_MenuItems_execAddListElementProvidersKey_Parms
{
    struct FName                                       KeyName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
    class UUDKUIResourceDataProvider*                  Provider;                                                 // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKUIDataStore_MenuItems.RemoveListElementProvidersKey
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataStore_MenuItems_execRemoveListElementProvidersKey_Parms
{
    struct FName                                       KeyName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function UDKBase.UDKUIDataStore_MenuItems.InitializeListElementProviders
// [0x00020802] ( FUNC_Event )
struct UUDKUIDataStore_MenuItems_eventInitializeListElementProviders_Parms
{
    // TArray< class UUDKUIResourceDataProvider* >     WeaponProviders;                                          // 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    // class UUDKUIResourceDataProvider*               Provider;                                                 // 0x000C (0x0004) [0x0000000000000000]              
    // int                                             WeaponIdx;                                                // 0x0010 (0x0004) [0x0000000000000000]              
};

// Function UDKBase.UDKUIDataStore_MenuItems.GetProviderSet
// [0x00420400] ( FUNC_Native )
struct UUDKUIDataStore_MenuItems_execGetProviderSet_Parms
{
    struct FName                                       ProviderFieldName;                                        // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
    TArray< class UUDKUIResourceDataProvider* >        OutProviders;                                             // 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    unsigned long                                      ReturnValue : 1;                                          // 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataStore_MenuItems.GetValueFromProviderSet
// [0x00420400] ( FUNC_Native )
struct UUDKUIDataStore_MenuItems_execGetValueFromProviderSet_Parms
{
    struct FName                                       ProviderFieldName;                                        // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
    struct FName                                       SearchTag;                                                // 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
    int                                                ListIndex;                                                // 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FString                                     OutValue;                                                 // 0x0014 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    unsigned long                                      ReturnValue : 1;                                          // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UDKBase.UDKUIDataStore_MenuItems.FindValueInProviderSet
// [0x00020400] ( FUNC_Native )
struct UUDKUIDataStore_MenuItems_execFindValueInProviderSet_Parms
{
    struct FName                                       ProviderFieldName;                                        // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
