/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: UTGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function UTGame.UTGameObjective.OnFlagTaken
// [0x00020100] 
struct AUTGameObjective_execOnFlagTaken_Parms
{
};

// Function UTGame.UTGameObjective.OnFlagComesHome
// [0x00020100] 
struct AUTGameObjective_execOnFlagComesHome_Parms
{
};

// Function UTGame.UTGameObjective.FlagUpdated
// [0x00020102] 
struct AUTGameObjective_execFlagUpdated_Parms
{
    unsigned long                                      bFlagHome : 1;                                            // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTGameObjective.ReachedParkingSpot
// [0x00020002] 
struct AUTGameObjective_execReachedParkingSpot_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // int                                             I;                                                        // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.MarkShootSpotsFor
// [0x00020102] 
struct AUTGameObjective_execMarkShootSpotsFor_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // float                                           Range;                                                    // 0x0004 (0x0004) [0x0000000000000000]              
    // int                                             I;                                                        // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.TriggerFlagEvent
// [0x00020002] 
struct AUTGameObjective_execTriggerFlagEvent_Parms
{
    struct FName                                       EventType;                                                // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class UUTSeqEvent_FlagEvent*                    FlagEvent;                                                // 0x000C (0x0004) [0x0000000000000000]              
    // int                                             I;                                                        // 0x0010 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.SetAlarm
// [0x00020000] 
struct AUTGameObjective_execSetAlarm_Parms
{
    unsigned long                                      bNowOn : 1;                                               // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTGameObjective.GetFlag
// [0x00020000] 
struct AUTGameObjective_execGetFlag_Parms
{
    class AUTCarriedObject*                            ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.ValidSpawnPointFor
// [0x00020002] 
struct AUTGameObjective_execValidSpawnPointFor_Parms
{
    unsigned char                                      TeamIndex;                                                // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.TeleportTo
// [0x00020002] 
struct AUTGameObjective_execTeleportTo_Parms
{
    class AUTPawn*                                     Traveler;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.FindGoodEndView
// [0x00C20102] 
struct AUTGameObjective_execFindGoodEndView_Parms
{
    class APlayerController*                           PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FRotator                                    GoodRotation;                                             // 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    // struct FVector                                  CameraLoc;                                                // 0x0010 (0x000C) [0x0000000000000000]              
    // struct FRotator                                 CameraRot;                                                // 0x001C (0x000C) [0x0000000000000000]              
    // struct FRotator                                 ViewRotation;                                             // 0x0028 (0x000C) [0x0000000000000000]              
    // int                                             tries;                                                    // 0x0034 (0x0004) [0x0000000000000000]              
    // float                                           bestDist;                                                 // 0x0038 (0x0004) [0x0000000000000000]              
    // float                                           newdist;                                                  // 0x003C (0x0004) [0x0000000000000000]              
    // float                                           FOVAngle;                                                 // 0x0040 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.SetTeam
// [0x00020002] 
struct AUTGameObjective_execSetTeam_Parms
{
    unsigned char                                      TeamIndex;                                                // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTGameObjective.ShareScore
// [0x00020002] 
struct AUTGameObjective_execShareScore_Parms
{
    int                                                TotalScore;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FString                                     EventDesc;                                                // 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
    // int                                             I;                                                        // 0x0010 (0x0004) [0x0000000000000000]              
    // float                                           SharedScore;                                              // 0x0014 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.AddScorer
// [0x00820002] 
struct AUTGameObjective_execAddScorer_Parms
{
    class AUTPlayerReplicationInfo*                    PRI;                                                      // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              Pct;                                                      // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // struct FScorerRecord                            S;                                                        // 0x0008 (0x0008) [0x0000000000000000]              
    // int                                             I;                                                        // 0x0010 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.ClientReset
// [0x00020100] 
struct AUTGameObjective_execClientReset_Parms
{
};

// Function UTGame.UTGameObjective.Reset
// [0x00020002] 
struct AUTGameObjective_execReset_Parms
{
};

// Function UTGame.UTGameObjective.BetterObjectiveThan
// [0x00020002] 
struct AUTGameObjective_execBetterObjectiveThan_Parms
{
    class AUTGameObjective*                            Best;                                                     // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned char                                      DesiredTeamNum;                                           // 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    unsigned char                                      RequesterTeamNum;                                         // 0x0005 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.GetNumDefenders
// [0x00020002] 
struct AUTGameObjective_execGetNumDefenders_Parms
{
    int                                                ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.TellBotHowToDisable
// [0x00020002] 
struct AUTGameObjective_execTellBotHowToDisable_Parms
{
    class AUTBot*                                      B;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.GetHumanReadableName
// [0x00020102] 
struct AUTGameObjective_execGetHumanReadableName_Parms
{
    struct FString                                     ReturnValue;                                              // 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function UTGame.UTGameObjective.NearObjective
// [0x00020002] 
struct AUTGameObjective_execNearObjective_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class AVolume*                                  V;                                                        // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.BotNearObjective
// [0x00020002] 
struct AUTGameObjective_execBotNearObjective_Parms
{
    class AAIController*                               C;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class AUTBot*                                   B;                                                        // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.CanDoubleJump
// [0x00020002] 
struct AUTGameObjective_execCanDoubleJump_Parms
{
    class APawn*                                       Other;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.NeedsHealing
// [0x00020102] 
struct AUTGameObjective_execNeedsHealing_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.TeamLink
// [0x00020102] 
struct AUTGameObjective_execTeamLink_Parms
{
    int                                                TeamNum;                                                  // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.TellBotHowToHeal
// [0x00020002] 
struct AUTGameObjective_execTellBotHowToHeal_Parms
{
    class AUTBot*                                      B;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.Shootable
// [0x00020002] 
struct AUTGameObjective_execShootable_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.IsActive
// [0x00020902] ( FUNC_Event )
struct AUTGameObjective_eventIsActive_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.IsNeutral
// [0x00020102] 
struct AUTGameObjective_execIsNeutral_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.IsCritical
// [0x00020902] ( FUNC_Event )
struct AUTGameObjective_eventIsCritical_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.DrawMapSelection
// [0x00020102] 
struct AUTGameObjective_execDrawMapSelection_Parms
{
    class UUTMapInfo*                                  MP;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UCanvas*                                     Canvas;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AUTPlayerController*                         PlayerOwner;                                              // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTGameObjective.RenderExtraDetails
// [0x00020102] 
struct AUTGameObjective_execRenderExtraDetails_Parms
{
    class UUTMapInfo*                                  MP;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UCanvas*                                     Canvas;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AUTPlayerController*                         PlayerOwner;                                              // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              ColorPercent;                                             // 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bSelected : 1;                                            // 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTGameObjective.RenderMinimap
// [0x00020900] ( FUNC_Event )
struct AUTGameObjective_eventRenderMinimap_Parms
{
    class UUTMapInfo*                                  MP;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UCanvas*                                     Canvas;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AUTPlayerController*                         PlayerOwner;                                              // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              ColorPercent;                                             // 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTGameObjective.HighlightOnMinimap
// [0x00020102] 
struct AUTGameObjective_execHighlightOnMinimap_Parms
{
    int                                                Switch;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTGameObjective.CalcCamera
// [0x00C20102] 
struct AUTGameObjective_execCalcCamera_Parms
{
    float                                              fDeltaTime;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     out_CamLoc;                                               // 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    struct FRotator                                    out_CamRot;                                               // 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    float                                              out_FOV;                                                  // 0x001C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FVector                                  HitNormal;                                                // 0x0024 (0x000C) [0x0000000000000000]              
    // struct FVector                                  DesiredCamLoc;                                            // 0x0030 (0x000C) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.UsedBy
// [0x00020002] 
struct AUTGameObjective_execUsedBy_Parms
{
    class APawn*                                       P;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.FindNearestFriendlyNode
// [0x00020002] 
struct AUTGameObjective_execFindNearestFriendlyNode_Parms
{
    int                                                TeamIndex;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AUTGameObjective*                            ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct AUTGameObjective_eventReplicatedEvent_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTGameObjective.UpdateTeamStaticMeshes
// [0x00020102] 
struct AUTGameObjective_execUpdateTeamStaticMeshes_Parms
{
    // int                                             I;                                                        // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.AddTeamStaticMesh
// [0x00020102] 
struct AUTGameObjective_execAddTeamStaticMesh_Parms
{
    class AUTTeamStaticMesh*                           SMesh;                                                    // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTGameObjective.Destroyed
// [0x00020102] 
struct AUTGameObjective_execDestroyed_Parms
{
    // class APlayerController*                        PC;                                                       // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.GetAutoObjectiveActor
// [0x00020002] 
struct AUTGameObjective_execGetAutoObjectiveActor_Parms
{
    class AUTPlayerController*                         PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.GetLocationSpeechFor
// [0x00020102] 
struct AUTGameObjective_execGetLocationSpeechFor_Parms
{
    class APlayerController*                           PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    int                                                LocationSpeechOffset;                                     // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    int                                                MessageIndex;                                             // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class USoundNodeWave*                              ReturnValue;                                              // 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.GetLocationMessageIndex
// [0x00020102] 
struct AUTGameObjective_execGetLocationMessageIndex_Parms
{
    class AUTBot*                                      B;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class APawn*                                       StatusPawn;                                               // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    int                                                ReturnValue;                                              // 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.GetHUDOffset
// [0x00020102] 
struct AUTGameObjective_execGetHUDOffset_Parms
{
    class APlayerController*                           PC;                                                       // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UCanvas*                                     Canvas;                                                   // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     ReturnValue;                                              // 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // float                                           Z;                                                        // 0x0014 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTGameObjective.IsStandalone
// [0x00020102] 
struct AUTGameObjective_execIsStandalone_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTGameObjective.PostBeginPlay
// [0x00020102] 
struct AUTGameObjective_execPostBeginPlay_Parms
{
    // class AUTGameObjective*                         O;                                                        // 0x0000 (0x0004) [0x0000000000000000]              
    // class AUTGameObjective*                         CurrentObjective;                                         // 0x0004 (0x0004) [0x0000000000000000]              
    // class APlayerController*                        PC;                                                       // 0x0008 (0x0004) [0x0000000000000000]              
    // int                                             I;                                                        // 0x000C (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.PostBigTeleport
// [0x00020102] 
struct AUTPawn_execPostBigTeleport_Parms
{
};

// Function UTGame.UTPawn.PostTeleport
// [0x00020102] 
struct AUTPawn_execPostTeleport_Parms
{
    class ATeleporter*                                 OutTeleporter;                                            // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.GetFamilyInfo
// [0x00020102] 
struct AUTPawn_execGetFamilyInfo_Parms
{
    class UClass*                                      ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class AUTPlayerReplicationInfo*                 UTPRI;                                                    // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.NeedToTurn
// [0x00820002] 
struct AUTPawn_execNeedToTurn_Parms
{
    struct FVector                                     targ;                                                     // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FVector                                  LookDir;                                                  // 0x0010 (0x000C) [0x0000000000000000]              
    // struct FVector                                  AimDir;                                                   // 0x001C (0x000C) [0x0000000000000000]              
    // class AUTBot*                                   B;                                                        // 0x0028 (0x0004) [0x0000000000000000]              
    // float                                           RequiredAim;                                              // 0x002C (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.PossessedBy
// [0x00020002] 
struct AUTPawn_execPossessedBy_Parms
{
    class AController*                                 C;                                                        // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bVehicleTransition : 1;                                   // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.OnInfiniteAmmo
// [0x00020002] 
struct AUTPawn_execOnInfiniteAmmo_Parms
{
    class UUTSeqAct_InfiniteAmmo*                      Action;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class AUTInventoryManager*                      UTInvManager;                                             // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.OnExitVehicle
// [0x00020002] 
struct AUTPawn_execOnExitVehicle_Parms
{
    class UUTSeqAct_ExitVehicle*                       Action;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.StuckFalling
// [0x00020802] ( FUNC_Event )
struct AUTPawn_eventStuckFalling_Parms
{
};

// Function UTGame.UTPawn.OnRanOver
// [0x00020802] ( FUNC_Event )
struct AUTPawn_eventOnRanOver_Parms
{
    class ASVehicle*                                   Vehicle;                                                  // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class UPrimitiveComponent*                         RunOverComponent;                                         // 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
    int                                                WheelIndex;                                               // 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class AUTVehicle*                               UTV;                                                      // 0x000C (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.RigidBodyCollision
// [0x00420902] ( FUNC_Event )
struct AUTPawn_eventRigidBodyCollision_Parms
{
    class UPrimitiveComponent*                         HitComponent;                                             // 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
    class UPrimitiveComponent*                         OtherComponent;                                           // 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
    struct FCollisionImpactData                        RigidCollisionData;                                       // 0x0008 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
    int                                                ContactIndex;                                             // 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.TakeFallingDamage
// [0x00020102] 
struct AUTPawn_execTakeFallingDamage_Parms
{
    // class AUTPlayerController*                      UTPC;                                                     // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.SetOverlayVisibility
// [0x00020102] 
struct AUTPawn_execSetOverlayVisibility_Parms
{
    unsigned long                                      bVisible : 1;                                             // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.TornOff
// [0x00020902] ( FUNC_Event )
struct AUTPawn_eventTornOff_Parms
{
    // class UClass*                                   UTDamage;                                                 // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.GetViewRotation
// [0x00820902] ( FUNC_Event )
struct AUTPawn_eventGetViewRotation_Parms
{
    struct FRotator                                    ReturnValue;                                              // 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FRotator                                 Result;                                                   // 0x000C (0x000C) [0x0000000000000000]              
};

// Function UTGame.UTPawn.AdjustCameraScale
// [0x00020102] 
struct AUTPawn_execAdjustCameraScale_Parms
{
    unsigned long                                      bMoveCameraIn : 1;                                        // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.IsFirstPerson
// [0x00020102] 
struct AUTPawn_execIsFirstPerson_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // class APlayerController*                        PC;                                                       // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.ModifyRotForDebugFreeCam
// [0x00420102] 
struct AUTPawn_execModifyRotForDebugFreeCam_Parms
{
    struct FRotator                                    out_CamRot;                                               // 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    // class AUTPlayerController*                      UPC;                                                      // 0x000C (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.IsLocationOnHead
// [0x00C20102] 
struct AUTPawn_execIsLocationOnHead_Parms
{
    struct FImpactInfo                                 Impact;                                                   // 0x0000 (0x0050) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
    float                                              AdditionalScale;                                          // 0x0050 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0054 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FVector                                  HeadLocation;                                             // 0x0058 (0x000C) [0x0000000000000000]              
    // float                                           Distance;                                                 // 0x0064 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.TakeDrowningDamage
// [0x00020002] 
struct AUTPawn_execTakeDrowningDamage_Parms
{
};

// Function UTGame.UTPawn.SwitchWeapon
// [0x00020102] 
struct AUTPawn_execSwitchWeapon_Parms
{
    unsigned char                                      NewGroup;                                                 // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.OnUseHoverboard
// [0x00020002] 
struct AUTPawn_execOnUseHoverboard_Parms
{
    class UUTSeqAct_UseHoverboard*                     Action;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.ServerHoverboard
// [0x00A200C2] 
struct AUTPawn_execServerHoverboard_Parms
{
    // class AUTVehicle*                               Board;                                                    // 0x0000 (0x0004) [0x0000000000000000]              
    // struct FVector                                  Start;                                                    // 0x0004 (0x000C) [0x0000000000000000]              
    // struct FVector                                  End;                                                      // 0x0010 (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitLoc;                                                   // 0x001C (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitNorm;                                                  // 0x0028 (0x000C) [0x0000000000000000]              
    // class AActor*                                   HitActor;                                                 // 0x0034 (0x0004) [0x0000000000000000]              
    // struct FTraceHitInfo                            HitInfo;                                                  // 0x0038 (0x001C) [0x0000000000000000]              
    // unsigned long                                   bInDeepWater : 1;                                         // 0x0054 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function UTGame.UTPawn.TakeHitBlendedOut
// [0x00020902] ( FUNC_Event )
struct AUTPawn_eventTakeHitBlendedOut_Parms
{
};

// Function UTGame.UTPawn.PlayTakeHitEffects
// [0x00820102] 
struct AUTPawn_execPlayTakeHitEffects_Parms
{
    // class UClass*                                   UTDamage;                                                 // 0x0000 (0x0004) [0x0000000000000000]              
    // struct FVector                                  BloodMomentum;                                            // 0x0004 (0x000C) [0x0000000000000000]              
    // class AUTEmit_HitEffect*                        HitEffect;                                                // 0x0010 (0x0004) [0x0000000000000000]              
    // class UParticleSystem*                          BloodTemplate;                                            // 0x0014 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.PlayHit
// [0x00020002] 
struct AUTPawn_execPlayHit_Parms
{
    float                                              Damage;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 InstigatedBy;                                             // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Momentum;                                                 // 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FTraceHitInfo                               HitInfo;                                                  // 0x0024 (0x001C) [0x0000000000000080]              ( CPF_Parm )
    // class AUTPlayerController*                      Hearer;                                                   // 0x0040 (0x0004) [0x0000000000000000]              
    // class UClass*                                   UTDamage;                                                 // 0x0044 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.WeaponAttachmentChanged
// [0x00020102] 
struct AUTPawn_execWeaponAttachmentChanged_Parms
{
};

// Function UTGame.UTPawn.WeaponChanged
// [0x00020102] 
struct AUTPawn_execWeaponChanged_Parms
{
    class AUTWeapon*                                   NewWeapon;                                                // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class UUDKSkeletalMeshComponent*                UTSkel;                                                   // 0x0004 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function UTGame.UTPawn.WeaponStoppedFiring
// [0x00020102] 
struct AUTPawn_execWeaponStoppedFiring_Parms
{
    class AWeapon*                                     InWeapon;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bViaReplication : 1;                                      // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.WeaponFired
// [0x00024102] 
struct AUTPawn_execWeaponFired_Parms
{
    class AWeapon*                                     InWeapon;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bViaReplication : 1;                                      // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function UTGame.UTPawn.TakeDamage
// [0x00024802] ( FUNC_Event )
struct AUTPawn_eventTakeDamage_Parms
{
    int                                                Damage;                                                   // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    class AController*                                 EventInstigator;                                          // 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     HitLocation;                                              // 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Momentum;                                                 // 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class UClass*                                      DamageType;                                               // 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    struct FTraceHitInfo                               HitInfo;                                                  // 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    class AActor*                                      DamageCauser;                                             // 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
    // int                                             OldHealth;                                                // 0x0044 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.GetPuttingDownWeapon
// [0x00020102] 
struct AUTPawn_execGetPuttingDownWeapon_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.SetPuttingDownWeapon
// [0x00020102] 
struct AUTPawn_execSetPuttingDownWeapon_Parms
{
    unsigned long                                      bNowPuttingDownWeapon : 1;                                // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.SetHeadScale
// [0x00020102] 
struct AUTPawn_execSetHeadScale_Parms
{
    float                                              NewScale;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // class USkelControlBase*                         SkelControl;                                              // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct AUTPawn_eventReplicatedEvent_Parms
{
    struct FName                                       VarName;                                                  // 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.FireRateChanged
// [0x00020102] 
struct AUTPawn_execFireRateChanged_Parms
{
};

// Function UTGame.UTPawn.SetBigHead
// [0x00020002] 
struct AUTPawn_execSetBigHead_Parms
{
};

// Function UTGame.UTPawn.FiringModeUpdated
// [0x00020102] 
struct AUTPawn_execFiringModeUpdated_Parms
{
    class AWeapon*                                     InWeapon;                                                 // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    unsigned char                                      InFiringMode;                                             // 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      bViaReplication : 1;                                      // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.ForceRagdoll
// [0x00020000] 
struct AUTPawn_execForceRagdoll_Parms
{
};

// Function UTGame.UTPawn.FeignDeath
// [0x00020300] ( FUNC_Exec )
struct AUTPawn_execFeignDeath_Parms
{
};

// Function UTGame.UTPawn.ServerFeignDeath
// [0x002200C0] 
struct AUTPawn_execServerFeignDeath_Parms
{
};

// Function UTGame.UTPawn.CheckValidLocation
// [0x00820102] 
struct AUTPawn_execCheckValidLocation_Parms
{
    struct FVector                                     FeignLocation;                                            // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FVector                                  HitLocation;                                              // 0x0010 (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitNormal;                                                // 0x001C (0x000C) [0x0000000000000000]              
    // struct FVector                                  DestFinalZ;                                               // 0x0028 (0x000C) [0x0000000000000000]              
};

// Function UTGame.UTPawn.SetFeignEndLocation
// [0x00820102] 
struct AUTPawn_execSetFeignEndLocation_Parms
{
    struct FVector                                     HitLocation;                                              // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     FeignLocation;                                            // 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // struct FVector                                  NewDest;                                                  // 0x001C (0x000C) [0x0000000000000000]              
};

// Function UTGame.UTPawn.PlayFeignDeath
// [0x00820102] 
struct AUTPawn_execPlayFeignDeath_Parms
{
    // struct FVector                                  FeignLocation;                                            // 0x0000 (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitLocation;                                              // 0x000C (0x000C) [0x0000000000000000]              
    // struct FVector                                  HitNormal;                                                // 0x0018 (0x000C) [0x0000000000000000]              
    // struct FVector                                  TraceEnd;                                                 // 0x0024 (0x000C) [0x0000000000000000]              
    // struct FVector                                  Impulse;                                                  // 0x0030 (0x000C) [0x0000000000000000]              
    // struct FRotator                                 NewRotation;                                              // 0x003C (0x000C) [0x0000000000000000]              
    // class AUTWeapon*                                UTWeap;                                                   // 0x0048 (0x0004) [0x0000000000000000]              
    // class AUTVehicle*                               V;                                                        // 0x004C (0x0004) [0x0000000000000000]              
    // class AController*                              Killer;                                                   // 0x0050 (0x0004) [0x0000000000000000]              
    // float                                           UnFeignZAdjust;                                           // 0x0054 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.FeignDeathDelayTimer
// [0x00020002] 
struct AUTPawn_execFeignDeathDelayTimer_Parms
{
};

// Function UTGame.UTPawn.StartFeignDeathRecoveryAnim
// [0x00020902] ( FUNC_Event )
struct AUTPawn_eventStartFeignDeathRecoveryAnim_Parms
{
    // class AUTWeapon*                                UTWeap;                                                   // 0x0000 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.ApplyWeaponOverlayFlags
// [0x00020102] 
struct AUTPawn_execApplyWeaponOverlayFlags_Parms
{
    unsigned char                                      NewFlags;                                                 // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    // class AUTWeapon*                                Weap;                                                     // 0x0004 (0x0004) [0x0000000000000000]              
    // class AUDKVehicleBase*                          VBase;                                                    // 0x0008 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.ClearWeaponOverlayFlag
// [0x00020002] 
struct AUTPawn_execClearWeaponOverlayFlag_Parms
{
    unsigned char                                      FlagToClear;                                              // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.SetWeaponOverlayFlag
// [0x00020002] 
struct AUTPawn_execSetWeaponOverlayFlag_Parms
{
    unsigned char                                      FlagToSet;                                                // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.GetOverlayMaterial
// [0x00020102] 
struct AUTPawn_execGetOverlayMaterial_Parms
{
    class UMaterialInterface*                          ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.GetShieldMaterialInstance
// [0x00020102] 
struct AUTPawn_execGetShieldMaterialInstance_Parms
{
    unsigned long                                      bTeamGame : 1;                                            // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    class UMaterialInterface*                          ReturnValue;                                              // 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.SetOverlayMaterial
// [0x00020102] 
struct AUTPawn_execSetOverlayMaterial_Parms
{
    class UMaterialInterface*                          NewOverlay;                                               // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // int                                             I;                                                        // 0x0004 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.GetWeaponAmbientSound
// [0x00020102] 
struct AUTPawn_execGetWeaponAmbientSound_Parms
{
    class USoundCue*                                   ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.SetWeaponAmbientSound
// [0x00020102] 
struct AUTPawn_execSetWeaponAmbientSound_Parms
{
    class USoundCue*                                   NewAmbientSound;                                          // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.GetPawnAmbientSound
// [0x00020102] 
struct AUTPawn_execGetPawnAmbientSound_Parms
{
    class USoundCue*                                   ReturnValue;                                              // 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.SetPawnAmbientSound
// [0x00020102] 
struct AUTPawn_execSetPawnAmbientSound_Parms
{
    class USoundCue*                                   NewAmbientSound;                                          // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.DisplayDebug
// [0x00420102] 
struct AUTPawn_execDisplayDebug_Parms
{
    class AHUD*                                        HUD;                                                      // 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
    float                                              out_YL;                                                   // 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    float                                              out_YPos;                                                 // 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
    // int                                             I;                                                        // 0x000C (0x0004) [0x0000000000000000]              
    // int                                             J;                                                        // 0x0010 (0x0004) [0x0000000000000000]              
    // class UPrimitiveComponent*                      P;                                                        // 0x0014 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
    // struct FString                                  S;                                                        // 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    // float                                           XL;                                                       // 0x0024 (0x0004) [0x0000000000000000]              
    // float                                           YL;                                                       // 0x0028 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.PlayDyingSound
// [0x00020002] 
struct AUTPawn_execPlayDyingSound_Parms
{
};

// Function UTGame.UTPawn.CanMultiJump
// [0x00020002] 
struct AUTPawn_execCanMultiJump_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.CanDoubleJump
// [0x00020002] 
struct AUTPawn_execCanDoubleJump_Parms
{
    unsigned long                                      ReturnValue : 1;                                          // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.JumpOutOfWater
// [0x00020002] 
struct AUTPawn_execJumpOutOfWater_Parms
{
    struct FVector                                     JumpDir;                                                  // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function UTGame.UTPawn.Landed
// [0x00820802] ( FUNC_Event )
struct AUTPawn_eventLanded_Parms
{
    struct FVector                                     HitNormal;                                                // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    class AActor*                                      FloorActor;                                               // 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
    // struct FVector                                  Impulse;                                                  // 0x0010 (0x000C) [0x0000000000000000]              
};

// Function UTGame.UTPawn.DoJump
// [0x00020002] 
struct AUTPawn_execDoJump_Parms
{
    unsigned long                                      bUpdating : 1;                                            // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function UTGame.UTPawn.StopFlying
// [0x00020100] 
struct AUTPawn_execStopFlying_Parms
{
};

// Function UTGame.UTPawn.StartFlying
// [0x00020100] 
struct AUTPawn_execStartFlying_Parms
{
};

// Function UTGame.UTPawn.Gasp
// [0x00020002] 
struct AUTPawn_execGasp_Parms
{
};

// Function UTGame.UTPawn.DoDoubleJump
// [0x00020002] 
struct AUTPawn_execDoDoubleJump_Parms
{
    unsigned long                                      bUpdating : 1;                                            // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function UTGame.UTPawn.PerformDodge
// [0x00020002] 
struct AUTPawn_execPerformDodge_Parms
{
    unsigned char                                      DoubleClickMove;                                          // 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Dir;                                                      // 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     Cross;                                                    // 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    unsigned long                                      ReturnValue : 1;                                          // 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
    // float                                           VelocityZ;                                                // 0x0020 (0x0004) [0x0000000000000000]              
};

// Function UTGame.UTPawn.BotDodge
// [0x00820002] 
struct AUTPawn_execBotDodge_Parms
{
    struct FVector                                     Dir;                                                      // 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
    struct FVector                                     ReturnValue;                                              // 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
