/*
#############################################################################################
# Tribes Ascend (1.4.2913.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: UTGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_STATS_VIEW_DM_WEAPONS_RANKED_ALLTIME               8
#define CONST_STATS_VIEW_DM_VEHICLEWEAPONS_RANKED_ALLTIME        7
#define CONST_STATS_VIEW_DM_VEHICLES_RANKED_ALLTIME              6
#define CONST_STATS_VIEW_DM_VEHICLEWEAPONS_ALLTIME               5
#define CONST_STATS_VIEW_DM_VEHICLES_ALLTIME                     4
#define CONST_STATS_VIEW_DM_WEAPONS_ALLTIME                      3
#define CONST_STATS_VIEW_DM_RANKED_ALLTIME                       2
#define CONST_STATS_VIEW_DM_PLAYER_ALLTIME                       1

    AIP_Defensive                                      = 1,
    AIP_Any                                            = 2,
    AIP_MAX                                            = 3
};

// Enum UTGame.UTWeapon.EZoomState
enum EZoomState
{
    ZST_NotZoomed                                      = 0,
    ZST_ZoomingOut                                     = 1,
    ZST_ZoomingIn                                      = 2,
    ZST_Zoomed                                         = 3,
    ZST_MAX                                            = 4
};

// Enum UTGame.UTWeapon.AmmoWidgetDisplayStyle
enum AmmoWidgetDisplayStyle
{
    EAWDS_Numeric                                      = 0,
    EAWDS_BarGraph                                     = 1,
    EAWDS_Both                                         = 2,
    EAWDS_None                                         = 3,
    EAWDS_MAX                                          = 4
};

// Enum UTGame.UTPawn.EWeapAnimType
enum EWeapAnimType
{
    EWAT_Default                                       = 0,
    EWAT_Pistol                                        = 1,
    EWAT_DualPistols                                   = 2,
    EWAT_ShoulderRocket                                = 3,
    EWAT_Stinger                                       = 4,
    EWAT_MAX                                           = 5
};

// Enum UTGame.UTGame.EVoiceChannel
enum EVoiceChannel
{
    VC_Spectators                                      = 0,
    VC_Team1                                           = 1,
    VC_Team2                                           = 2,
    VC_MAX                                             = 3
};

// Enum UTGame.UTGameReplicationInfo.EFlagState
enum EFlagState
{
    FLAG_Home                                          = 0,
    FLAG_HeldFriendly                                  = 1,
    FLAG_HeldEnemy                                     = 2,
    FLAG_Down                                          = 3,
    FLAG_MAX                                           = 4
};

// Enum UTGame.UTDefensePoint.EDefensePriority
enum EDefensePriority
{
    DEFPRI_Low                                         = 0,
    DEFPRI_High                                        = 1,
    DEFPRI_MAX                                         = 2
};

// Enum UTGame.UTMusicManager.EMusicState
enum EMusicState
{
    MST_Ambient                                        = 0,
    MST_Tension                                        = 1,
    MST_Suspense                                       = 2,
    MST_Action                                         = 3,
    MST_Victory                                        = 4,
    MST_MAX                                            = 5
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UTGame.UTGameObjective
// 0x011F (0x0408 - 0x02E9)
class AUTGameObjective : public AUDKGameObjective
{
public:
    unsigned long                                      bAlreadyRendered : 1;                                     // 0x02EC (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bAllowRemoteUse : 1;                                      // 0x02EC (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bFirstObjective : 1;                                      // 0x02EC (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      bHasSensor : 1;                                           // 0x02EC (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bIsConstructing : 1;                                      // 0x02EC (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      bIsDisabled : 1;                                          // 0x02EC (0x0004) [0x0000000000000000] [0x00000020] 
    unsigned long                                      bIsActive : 1;                                            // 0x02EC (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      bPostRenderTraceSucceeded : 1;                            // 0x02EC (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      bHasLocationSpeech : 1;                                   // 0x02EC (0x0004) [0x0000000000000000] [0x00000100] 
    unsigned long                                      bScriptRenderAdditionalMinimap : 1;                       // 0x02EC (0x0004) [0x0000000000000000] [0x00000200] 
    unsigned char                                      StartTeam;                                                // 0x02F0 (0x0001) [0x0000000000000000]              
    unsigned char                                      DefensePriority;                                          // 0x02F1 (0x0001) [0x0000000000000001]              ( CPF_Edit )
    class AUTSquadAI*                                  DefenseSquad;                                             // 0x02F4 (0x0004) [0x0000000000000000]              
    class AUTDefensePoint*                             DefensePoints;                                            // 0x02F8 (0x0004) [0x0000000000000000]              
    struct FString                                     ObjectiveName;                                            // 0x02FC (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
    TArray< class ANavigationPoint* >                  VehicleParkingSpots;                                      // 0x0308 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    class AVolume*                                     MyBaseVolume;                                             // 0x0314 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              BaseRadius;                                               // 0x0318 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    TArray< struct FScorerRecord >                     Scorers;                                                  // 0x031C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    int                                                Score;                                                    // 0x0328 (0x0004) [0x0000000000000000]              
    class AUTGameObjective*                            NextObjective;                                            // 0x032C (0x0004) [0x0000000000000000]              
    struct FLinearColor                                ControlColor[ 0x3 ];                                      // 0x0330 (0x0030) [0x0000000000000000]              
    struct FTextureCoordinates                         AttackCoords;                                             // 0x0360 (0x0010) [0x0000000000000000]              
    float                                              IconPosX;                                                 // 0x0370 (0x0004) [0x0000000000000000]              
    float                                              IconPosY;                                                 // 0x0374 (0x0004) [0x0000000000000000]              
    float                                              IconExtentX;                                              // 0x0378 (0x0004) [0x0000000000000000]              
    float                                              IconExtentY;                                              // 0x037C (0x0004) [0x0000000000000000]              
    class UMaterial*                                   HudMaterial;                                              // 0x0380 (0x0004) [0x0000000000000000]              
    float                                              MaxSensorRange;                                           // 0x0384 (0x0004) [0x0000000000000000]              
    float                                              CameraViewDistance;                                       // 0x0388 (0x0004) [0x0000000000000000]              
    TArray< class AUTVehicleFactory* >                 VehicleFactories;                                         // 0x038C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    TArray< class APlayerStart* >                      PlayerStarts;                                             // 0x0398 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    TArray< class AUTTeamStaticMesh* >                 TeamStaticMeshes;                                         // 0x03A4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    struct FObjectiveAnnouncementInfo                  AttackAnnouncement;                                       // 0x03B0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    struct FObjectiveAnnouncementInfo                  DefendAnnouncement;                                       // 0x03C0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    float                                              HighlightScale;                                           // 0x03D0 (0x0004) [0x0000000000000000]              
    float                                              MaxHighlightScale;                                        // 0x03D4 (0x0004) [0x0000000000000000]              
    float                                              HighlightSpeed;                                           // 0x03D8 (0x0004) [0x0000000000000000]              
    float                                              MinimapIconScale;                                         // 0x03DC (0x0004) [0x0000000000000000]              
    float                                              LastHighlightUpdate;                                      // 0x03E0 (0x0004) [0x0000000000000000]              
    float                                              LastPostRenderTraceTime;                                  // 0x03E4 (0x0004) [0x0000000000000000]              
    float                                              MaxBeaconDistance;                                        // 0x03E8 (0x0004) [0x0000000000000000]              
    TArray< class USoundNodeWave* >                    LocationSpeech;                                           // 0x03EC (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
    struct FLinearColor                                AttackLinearColor;                                        // 0x03F8 (0x0010) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44 ];

        return pClassPointer;
    };

    void OnFlagTaken ( );
    void OnFlagComesHome ( );
    void FlagUpdated ( unsigned long bFlagHome );
    bool ReachedParkingSpot ( class APawn* P );
    void MarkShootSpotsFor ( class APawn* P );
    void TriggerFlagEvent ( struct FName EventType, class AController* EventInstigator );
    void SetAlarm ( unsigned long bNowOn );
    class AUTCarriedObject* GetFlag ( );
    bool ValidSpawnPointFor ( unsigned char TeamIndex );
    bool TeleportTo ( class AUTPawn* Traveler );
    void FindGoodEndView ( class APlayerController* PC, struct FRotator* GoodRotation );
    void SetTeam ( unsigned char TeamIndex );
    void ShareScore ( int TotalScore, struct FString EventDesc );
    void AddScorer ( class AUTPlayerReplicationInfo* PRI, float Pct );
    void ClientReset ( );
    void Reset ( );
    bool BetterObjectiveThan ( class AUTGameObjective* Best, unsigned char DesiredTeamNum, unsigned char RequesterTeamNum );
    int GetNumDefenders ( );
    bool TellBotHowToDisable ( class AUTBot* B );
    struct FString GetHumanReadableName ( );
    bool NearObjective ( class APawn* P );
    bool BotNearObjective ( class AAIController* C );
    bool CanDoubleJump ( class APawn* Other );
    bool NeedsHealing ( );
    bool TeamLink ( int TeamNum );
    bool TellBotHowToHeal ( class AUTBot* B );
    bool Shootable ( );
    bool eventIsActive ( );
    bool IsNeutral ( );
    bool eventIsCritical ( );
    void DrawMapSelection ( class UUTMapInfo* MP, class UCanvas* Canvas, class AUTPlayerController* PlayerOwner );
    void RenderExtraDetails ( class UUTMapInfo* MP, class UCanvas* Canvas, class AUTPlayerController* PlayerOwner, float ColorPercent, unsigned long bSelected );
    void eventRenderMinimap ( class UUTMapInfo* MP, class UCanvas* Canvas, class AUTPlayerController* PlayerOwner, float ColorPercent );
    void HighlightOnMinimap ( int Switch );
    bool CalcCamera ( float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
    bool UsedBy ( class APawn* P );
    class AUTGameObjective* FindNearestFriendlyNode ( int TeamIndex );
    void eventReplicatedEvent ( struct FName VarName );
    void UpdateTeamStaticMeshes ( );
    void AddTeamStaticMesh ( class AUTTeamStaticMesh* SMesh );
    void Destroyed ( );
    class AActor* GetAutoObjectiveActor ( class AUTPlayerController* PC );
    class USoundNodeWave* GetLocationSpeechFor ( class APlayerController* PC, int LocationSpeechOffset, int MessageIndex );
    int GetLocationMessageIndex ( class AUTBot* B, class APawn* StatusPawn );
    struct FVector GetHUDOffset ( class APlayerController* PC, class UCanvas* Canvas );
    bool IsStandalone ( );
    void PostBeginPlay ( );
};

// Class UTGame.UTPawn
// 0x0250 (0x08A4 - 0x0654)
class AUTPawn : public AUDKPawn
{
public:
    unsigned long                                      bFixedView : 1;                                           // 0x0654 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bSpawnDone : 1;                                           // 0x0654 (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bSpawnIn : 1;                                             // 0x0654 (0x0004) [0x0000000000000000] [0x00000004] 
    unsigned long                                      bShieldAbsorb : 1;                                        // 0x0654 (0x0004) [0x0000000000000000] [0x00000008] 
    unsigned long                                      bDodging : 1;                                             // 0x0654 (0x0004) [0x0000000000000000] [0x00000010] 
    unsigned long                                      bStopOnDoubleLanding : 1;                                 // 0x0654 (0x0004) [0x0000000000000000] [0x00000020] 
    unsigned long                                      bIsInvulnerable : 1;                                      // 0x0654 (0x0004) [0x0000000000000000] [0x00000040] 
    unsigned long                                      bJustDroppedOrb : 1;                                      // 0x0654 (0x0004) [0x0000000000000000] [0x00000080] 
    unsigned long                                      bForcedFeignDeath : 1;                                    // 0x0654 (0x0004) [0x0000000000000000] [0x00000100] 
    unsigned long                                      bWeaponBob : 1;                                           // 0x0654 (0x0004) [0x0000000000044000] [0x00000200] ( CPF_Config | CPF_GlobalConfig )
    unsigned long                                      bJustLanded : 1;                                          // 0x0654 (0x0004) [0x0000000000000000] [0x00000400] 
    unsigned long                                      bLandRecovery : 1;                                        // 0x0654 (0x0004) [0x0000000000000000] [0x00000800] 
    unsigned long                                      bHasHoverboard : 1;                                       // 0x0654 (0x0004) [0x0000000000000020] [0x00001000] ( CPF_Net )
    unsigned long                                      bStopDeathCamera : 1;                                     // 0x0654 (0x0004) [0x0000000000000000] [0x00002000] 
    unsigned long                                      bWinnerCam : 1;                                           // 0x0654 (0x0004) [0x0000000000000000] [0x00004000] 
    unsigned long                                      bGibbed : 1;                                              // 0x0654 (0x0004) [0x0000000000000000] [0x00008000] 
    unsigned long                                      bHeadGibbed : 1;                                          // 0x0654 (0x0004) [0x0000000000000000] [0x00010000] 
    unsigned long                                      bArmsAttached : 1;                                        // 0x0654 (0x0004) [0x0000000000000000] [0x00020000] 
    unsigned long                                      bWeaponAttachmentVisible : 1;                             // 0x0654 (0x0004) [0x0000000000000000] [0x00040000] 
    unsigned long                                      bHideOnListenServer : 1;                                  // 0x0654 (0x0004) [0x0000000000000000] [0x00080000] 
    unsigned long                                      bPostRenderTraceSucceeded : 1;                            // 0x0654 (0x0004) [0x0000000000000000] [0x00100000] 
    unsigned long                                      bReceivedValidTeam : 1;                                   // 0x0654 (0x0004) [0x0000000000000000] [0x00200000] 
    unsigned long                                      bKillsAffectHead : 1;                                     // 0x0654 (0x0004) [0x0000000000000000] [0x00400000] 
    unsigned long                                      bKilledByBio : 1;                                         // 0x0654 (0x0004) [0x0000000000000000] [0x00800000] 
    class UClass*                                      CurrentWeaponAttachmentClass;                             // 0x0658 (0x0004) [0x0000000000000020]              ( CPF_Net )
    int                                                UnfeignFailedCount;                                       // 0x065C (0x0004) [0x0000000000000000]              
    class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0660 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UAnimNodeBlend*                              FeignDeathBlend;                                          // 0x0664 (0x0004) [0x0000000000000000]              
    class UAnimNodeSlot*                               FullBodyAnimSlot;                                         // 0x0668 (0x0004) [0x0000000000000000]              
    class UAnimNodeSlot*                               TopHalfAnimSlot;                                          // 0x066C (0x0004) [0x0000000000000000]              
    float                                              DeathHipLinSpring;                                        // 0x0670 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DeathHipLinDamp;                                          // 0x0674 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DeathHipAngSpring;                                        // 0x0678 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DeathHipAngDamp;                                          // 0x067C (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              StartDeathAnimTime;                                       // 0x0680 (0x0004) [0x0000000000000000]              
    class UClass*                                      DeathAnimDamageType;                                      // 0x0684 (0x0004) [0x0000000000000000]              
    float                                              TimeLastTookDeathAnimDamage;                              // 0x0688 (0x0004) [0x0000000000000000]              
    struct FVector                                     FixedViewLoc;                                             // 0x068C (0x000C) [0x0000000000000000]              
    struct FRotator                                    FixedViewRot;                                             // 0x0698 (0x000C) [0x0000000000000000]              
    float                                              CameraScale;                                              // 0x06A4 (0x0004) [0x0000000000000000]              
    float                                              CurrentCameraScale;                                       // 0x06A8 (0x0004) [0x0000000000000000]              
    float                                              CameraScaleMin;                                           // 0x06AC (0x0004) [0x0000000000000000]              
    float                                              CameraScaleMax;                                           // 0x06B0 (0x0004) [0x0000000000000000]              
    struct FVector                                     OldCameraPosition;                                        // 0x06B4 (0x000C) [0x0000000000000000]              
    float                                              CameraZOffset;                                            // 0x06C0 (0x0004) [0x0000000000000000]              
    float                                              HeroCameraScale;                                          // 0x06C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    int                                                HeroCameraPitch;                                          // 0x06C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DodgeSpeed;                                               // 0x06CC (0x0004) [0x0000000000000000]              
    float                                              DodgeSpeedZ;                                              // 0x06D0 (0x0004) [0x0000000000000000]              
    unsigned char                                      CurrentDir;                                               // 0x06D4 (0x0001) [0x0000000000000000]              
    float                                              DoubleJumpEyeHeight;                                      // 0x06D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              DoubleJumpThreshold;                                      // 0x06DC (0x0004) [0x0000000000000000]              
    float                                              DefaultAirControl;                                        // 0x06E0 (0x0004) [0x0000000000000000]              
    float                                              Bob;                                                      // 0x06E4 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
    float                                              LandBob;                                                  // 0x06E8 (0x0004) [0x0000000000000000]              
    float                                              JumpBob;                                                  // 0x06EC (0x0004) [0x0000000000000000]              
    float                                              AppliedBob;                                               // 0x06F0 (0x0004) [0x0000000000000000]              
    float                                              bobtime;                                                  // 0x06F4 (0x0004) [0x0000000000000000]              
    struct FVector                                     WalkBob;                                                  // 0x06F8 (0x000C) [0x0000000000000000]              
    float                                              FeignDeathBodyAtRestSpeed;                                // 0x0704 (0x0004) [0x0000000000000000]              
    float                                              FeignDeathStartTime;                                      // 0x0708 (0x0004) [0x0000000000000000]              
    float                                              FeignDeathRecoveryStartTime;                              // 0x070C (0x0004) [0x0000000000000000]              
    int                                                SuperHealthMax;                                           // 0x0710 (0x0004) [0x0000000000000000]              
    class UClass*                                      SoundGroupClass;                                          // 0x0714 (0x0004) [0x0000000000000000]              
    class UClass*                                      CurrCharClassInfo;                                        // 0x0718 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
    TArray< struct FName >                             TakeHitPhysicsFixedBones;                                 // 0x071C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    TArray< struct FName >                             NoDriveBodies;                                            // 0x0728 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    class UForceFeedbackWaveform*                      FallingDamageWaveForm;                                    // 0x0734 (0x0004) [0x0000000000000000]              
    float                                              AccumulateDamage;                                         // 0x0738 (0x0004) [0x0000000000000000]              
    float                                              AccumulationTime;                                         // 0x073C (0x0004) [0x0000000000000000]              
    float                                              LastHoverboardTime;                                       // 0x0740 (0x0004) [0x0000000000000000]              
    float                                              MinHoverboardInterval;                                    // 0x0744 (0x0004) [0x0000000000000000]              
    class UUTAnimBlendByDriving*                       DrivingNode;                                              // 0x0748 (0x0004) [0x0000000000000000]              
    class UUTAnimBlendByVehicle*                       VehicleNode;                                              // 0x074C (0x0004) [0x0000000000000000]              
    class UUTAnimBlendByHoverboarding*                 HoverboardingNode;                                        // 0x0750 (0x0004) [0x0000000000000000]              
    float                                              ShieldBeltArmor;                                          // 0x0754 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              VestArmor;                                                // 0x0758 (0x0004) [0x0000000000000020]              ( CPF_Net )
    float                                              ThighpadArmor;                                            // 0x075C (0x0004) [0x0000000000000020]              ( CPF_Net )
    class AUTWeaponAttachment*                         CurrentWeaponAttachment;                                  // 0x0760 (0x0004) [0x0000000000000000]              
    struct FName                                       WeaponSocket;                                             // 0x0764 (0x0008) [0x0000000000000000]              
    struct FName                                       WeaponSocket2;                                            // 0x076C (0x0008) [0x0000000000000000]              
    struct FName                                       PawnEffectSockets[ 0x2 ];                                 // 0x0774 (0x0010) [0x0000000000000000]              
    float                                              HeadOffset;                                               // 0x0784 (0x0004) [0x0000000000000000]              
    float                                              HeadRadius;                                               // 0x0788 (0x0004) [0x0000000000000000]              
    float                                              HeadHeight;                                               // 0x078C (0x0004) [0x0000000000000000]              
    struct FName                                       HeadBone;                                                 // 0x0790 (0x0008) [0x0000000000000000]              
    class UStaticMeshComponent*                        HeadshotNeckAttachment;                                   // 0x0798 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    class UClass*                                      TransInEffects[ 0x2 ];                                    // 0x079C (0x0008) [0x0000000000000000]              
    struct FLinearColor                                TranslocateColor[ 0x2 ];                                  // 0x07A4 (0x0020) [0x0000000000000000]              
    class UCameraAnim*                                 TransCameraAnim[ 0x3 ];                                   // 0x07C4 (0x000C) [0x0000000000000000]              
    class USoundCue*                                   ArmorHitSound;                                            // 0x07D0 (0x0004) [0x0000000000000000]              
    class USoundCue*                                   SpawnSound;                                               // 0x07D4 (0x0004) [0x0000000000000000]              
    class USoundCue*                                   TeleportSound;                                            // 0x07D8 (0x0004) [0x0000000000000000]              
    struct FLinearColor                                SpawnProtectionColor;                                     // 0x07DC (0x0010) [0x0000000000000000]              
    float                                              TeamBeaconPlayerInfoMaxDist;                              // 0x07EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
    class UTexture*                                    SpeakingBeaconTexture;                                    // 0x07F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
    float                                              MapSize;                                                  // 0x07F4 (0x0004) [0x0000000000000000]              
    struct FTextureCoordinates                         IconCoords;                                               // 0x07F8 (0x0010) [0x0000000000000000]              
    float                                              LastPainSound;                                            // 0x0808 (0x0004) [0x0000000000000000]              
    float                                              RagdollLifespan;                                          // 0x080C (0x0004) [0x0000000000000000]              
    class AUTProjectile*                               AttachedProj;                                             // 0x0810 (0x0004) [0x0000000000000000]              
    float                                              MaxFootstepDistSq;                                        // 0x0814 (0x0004) [0x0000000000000000]              
    float                                              MaxJumpSoundDistSq;                                       // 0x0818 (0x0004) [0x0000000000000000]              
    class UClass*                                      HoverboardClass;                                          // 0x081C (0x0004) [0x0000000000000000]              
    struct FDrivenWeaponPawnInfo                       LastDrivenWeaponPawn;                                     // 0x0820 (0x000C) [0x0000000000000000]              
    class AUTClientSideWeaponPawn*                     ClientSideWeaponPawn;                                     // 0x082C (0x0004) [0x0000000000000000]              
    class UMaterialInterface*                          ShieldBeltMaterialInstance;                               // 0x0830 (0x0004) [0x0000000000000000]              
    class UMaterialInterface*                          ShieldBeltTeamMaterialInstances[ 0x4 ];                   // 0x0834 (0x0010) [0x0000000000000000]              
    int                                                JumpBootCharge;                                           // 0x0844 (0x0004) [0x0000000000000000]              
    float                                              DefaultMeshScale;                                         // 0x0848 (0x0004) [0x0000000000000000]              
    struct FName                                       TauntNames[ 0x6 ];                                        // 0x084C (0x0030) [0x0000000000000000]              
    float                                              DesiredMeshScale;                                         // 0x087C (0x0004) [0x0000000000000000]              
    struct FVector                                     CamOffset;                                                // 0x0880 (0x000C) [0x0000000000000000]              
    class UParticleSystemComponent*                    BioBurnAway;                                              // 0x088C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    float                                              BioBurnAwayTime;                                          // 0x0890 (0x0004) [0x0000000000000000]              
    struct FName                                       BioEffectName;                                            // 0x0894 (0x0008) [0x0000000000000000]              
    float                                              DeathTime;                                                // 0x089C (0x0004) [0x0000000000000000]              
    class UClass*                                      m_ClientSideWeaponPawnClass;                              // 0x08A0 (0x0004) [0x0000000000000000]              

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 50 ];

        return pClassPointer;
    };

    void PostBigTeleport ( );
    void PostTeleport ( class ATeleporter* OutTeleporter );
    class UClass* GetFamilyInfo ( );
    bool NeedToTurn ( struct FVector targ );
    void PossessedBy ( class AController* C, unsigned long bVehicleTransition );
    void OnInfiniteAmmo ( class UUTSeqAct_InfiniteAmmo* Action );
    void OnExitVehicle ( class UUTSeqAct_ExitVehicle* Action );
    void eventStuckFalling ( );
    void eventOnRanOver ( class ASVehicle* Vehicle, class UPrimitiveComponent* RunOverComponent, int WheelIndex );
    void eventRigidBodyCollision ( class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* RigidCollisionData );
    void TakeFallingDamage ( );
    void SetOverlayVisibility ( unsigned long bVisible );
    void eventTornOff ( );
    struct FRotator eventGetViewRotation ( );
    void AdjustCameraScale ( unsigned long bMoveCameraIn );
    bool IsFirstPerson ( );
    void ModifyRotForDebugFreeCam ( struct FRotator* out_CamRot );
    bool IsLocationOnHead ( float AdditionalScale, struct FImpactInfo* Impact );
    void TakeDrowningDamage ( );
    void SwitchWeapon ( unsigned char NewGroup );
    void OnUseHoverboard ( class UUTSeqAct_UseHoverboard* Action );
    void ServerHoverboard ( );
    void eventTakeHitBlendedOut ( );
    void PlayTakeHitEffects ( );
    void PlayHit ( float Damage, class AController* InstigatedBy, struct FVector HitLocation, class UClass* DamageType, struct FVector Momentum, struct FTraceHitInfo HitInfo );
    void WeaponAttachmentChanged ( );
    void WeaponChanged ( class AUTWeapon* NewWeapon );
    void WeaponStoppedFiring ( class AWeapon* InWeapon, unsigned long bViaReplication );
    void WeaponFired ( class AWeapon* InWeapon, unsigned long bViaReplication, struct FVector HitLocation );
    void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
    bool GetPuttingDownWeapon ( );
    void SetPuttingDownWeapon ( unsigned long bNowPuttingDownWeapon );
    void SetHeadScale ( float NewScale );
    void eventReplicatedEvent ( struct FName VarName );
    void FireRateChanged ( );
    void SetBigHead ( );
    void FiringModeUpdated ( class AWeapon* InWeapon, unsigned char InFiringMode, unsigned long bViaReplication );
    void ForceRagdoll ( );
    void FeignDeath ( );
    void ServerFeignDeath ( );
    bool CheckValidLocation ( struct FVector FeignLocation );
    bool SetFeignEndLocation ( struct FVector HitLocation, struct FVector FeignLocation );
    void PlayFeignDeath ( );
    void FeignDeathDelayTimer ( );
    void eventStartFeignDeathRecoveryAnim ( );
    void ApplyWeaponOverlayFlags ( unsigned char NewFlags );
    void ClearWeaponOverlayFlag ( unsigned char FlagToClear );
    void SetWeaponOverlayFlag ( unsigned char FlagToSet );
    class UMaterialInterface* GetOverlayMaterial ( );
    class UMaterialInterface* GetShieldMaterialInstance ( unsigned long bTeamGame );
    void SetOverlayMaterial ( class UMaterialInterface* NewOverlay );
    class USoundCue* GetWeaponAmbientSound ( );
    void SetWeaponAmbientSound ( class USoundCue* NewAmbientSound );
    class USoundCue* GetPawnAmbientSound ( );
    void SetPawnAmbientSound ( class USoundCue* NewAmbientSound );
    void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
    void PlayDyingSound ( );
    bool CanMultiJump ( );
    bool CanDoubleJump ( );
    void JumpOutOfWater ( struct FVector JumpDir );
    void eventLanded ( struct FVector HitNormal, class AActor* FloorActor );
    bool DoJump ( unsigned long bUpdating );
    void StopFlying ( );
    void StartFlying ( );
    void Gasp ( );
    void DoDoubleJump ( unsigned long bUpdating );
    bool PerformDodge ( unsigned char DoubleClickMove, struct FVector Dir, struct FVector Cross );
    struct FVector BotDodge ( struct FVector Dir );
    bool Dodge ( unsigned char DoubleClickMove );
    struct FVector GetWeaponStartTraceLocation ( class AWeapon* CurrentWeapon );
    bool CalcThirdPersonCam ( float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
    void SetHeroCam ( struct FRotator* out_CamRot );
    bool TryNewCamRot ( class AUTPlayerController* PC, struct FRotator ViewRotation, float* CamDist );
    void FindGoodEndView ( class APlayerController* InPC, struct FRotator* GoodRotation );
    void SetThirdPersonCamera ( unsigned long bNewBehindView );
    bool CalcCamera ( float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
    void AddDefaultInventory ( );
    void eventDestroyed ( );
    void DoingDeathAnim ( );
    void PlayDying ( class UClass* DamageType, struct FVector HitLoc );
    void TurnOffPawn ( );
    void SpawnGibs ( class UClass* UTDamageType, struct FVector HitLocation );
    class AUTGib* SpawnGib ( class UClass* GibClass, struct FName BoneName, class UClass* UTDamageType, struct FVector HitLocation, unsigned long bSpinGib );
    void SpawnHeadGib ( class UClass* UTDamageType, struct FVector HitLocation );
    bool ShouldGib ( class UClass* UTDamageType );
    void PlayJumpingSound ( );
    void PlayLandingSound ( );
    struct FName GetMaterialBelowFeet ( );
    void ActuallyPlayFootstepSound ( int FootDown );
    void eventPlayFootStepSound ( int FootDown );
    struct FString GetDebugName ( );
    bool GiveHealth ( int HealAmount, int HealMax );
    void eventHoldGameObject ( class AUDKCarriedObject* GameObj );
    void EnableInventoryPickup ( );
    void DropFlag ( class AController* C );
    void AdjustDamage ( class AController* InstigatedBy, struct FVector HitLocation, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser, int* InDamage, struct FVector* Momentum );
    int ShieldAbsorb ( int Damage );
    int AbsorbDamage ( int CurrentShieldStrength, float AbsorptionRate, int* Damage );
    int GetShieldStrength ( );
    void ClientRestart ( );
    void eventStopDriving ( class AVehicle* V );
    void eventStartDriving ( class AVehicle* V );
    void SpawnTransEffect ( int TeamNum );
    void PlayTeleportEffect ( unsigned long bOut, unsigned long bSound );
    void DeactivateSpawnProtection ( );
    void SetMeshVisibility ( unsigned long bVisible );
    void SetWeaponAttachmentVisibility ( unsigned long bAttachmentVisible );
    void SetWeaponVisibility ( unsigned long bWeaponVisible );
    void eventEndViewTarget ( class APlayerController* PC );
    void eventBecomeViewTarget ( class APlayerController* PC );
    struct FVector GetPawnViewLocation ( );
    void eventUpdateEyeHeight ( float DeltaTime );
    void FaceRotation ( struct FRotator NewRotation, float DeltaTime );
    struct FString GetScreenName ( );
    void OnModifyHealth ( class USeqAct_ModifyHealth* Action );
    void PlayVictoryAnimation ( );
    float GetEyeHeight ( );
    float RangedAttackTime ( );
    bool RecommendLongRangedAttack ( );
    unsigned char ChooseFireMode ( );
    bool StopWeaponFiring ( );
    bool BotFire ( unsigned long bFinished );
    bool StopFiring ( );
    void StartFire ( unsigned char FireModeNum );
    bool Died ( class AController* Killer, class UClass* DamageType, struct FVector HitLocation );
    void AddVelocity ( struct FVector NewVelocity, struct FVector HitLocation, class UClass* DamageType, struct FTraceHitInfo HitInfo );
    void eventFalling ( );
    void eventStuckOnPawn ( class APawn* OtherPawn );
    void JumpOffPawn ( );
    void gibbedBy ( class AActor* Other );
    void eventEncroachedBy ( class AActor* Other );
    bool eventEncroachingOn ( class AActor* Other );
    void TurnOff ( );
    struct FVector WeaponBob ( float BobDamping, float JumpDamping );
    void SpawnDefaultController ( );
    void OnPlayAnim ( class UUTSeqAct_PlayAnim* inAction );
    void PlayEmote ( struct FName InEmoteTag, int InPlayerID );
    void ServerPlayEmote ( struct FName InEmoteTag, int InPlayerID );
    void DoPlayEmote ( struct FName InEmoteTag, int InPlayerID );
    void PerformEmoteCommand ( struct FEmoteInfo EInfo, int PlayerID );
    void LeaveABloodSplatterDecal ( struct FVector HitLoc, struct FVector HitNorm );
    void SetWeapAnimType ( unsigned char AnimType );
    void SetAnimRateScale ( float RateScale );
    void SetHandIKEnabled ( unsigned long bEnabled );
    void eventPostInitAnimTree ( class USkeletalMeshComponent* SkelComp );
    void ReattachMesh ( );
    void UpdateShadowSettings ( unsigned long bWantShadow );
    void PostBeginPlay ( );
    void SetTeamColor ( );
    void SetFirstPersonArmsInfo ( class USkeletalMesh* FirstPersonArmMesh, class UMaterialInterface* ArmMaterial );
    void NotifyTeamChanged ( );
    void ResetCharPhysState ( );
    void SetPawnRBChannels ( unsigned long bRagdollMode );
    void SetCharacterMeshInfo ( class USkeletalMesh* SkelMesh, class UMaterialInterface* HeadMaterial, class UMaterialInterface* BodyMaterial );
    void SetCharacterClassFromInfo ( class UClass* Info, unsigned long bForce );
    bool VerifyBodyMaterialInstance ( );
    void SetArmsSkin ( class UMaterialInterface* NewMaterial );
    void SetSkin ( class UMaterial* NewMaterial );
    void SetInvisible ( unsigned long bNowInvisible );
    void SetBodyMatColor ( struct FLinearColor NewBodyMatColor, float NewOverlayDuration );
    void ClearBodyMatColor ( );
    void eventSetWalking ( unsigned long bNewIsWalking );
    void RenderMapIcon ( class UUTMapInfo* MP, class UCanvas* Canvas, class AUTPlayerController* PlayerOwner, struct FLinearColor FinalColor );
    bool InCombat ( );
    bool PoweredUp ( );
    void eventHeadVolumeChange ( class APhysicsVolume* newHeadVolume );
    void eventFellOutOfWorld ( class UClass* dmgType );
    class AUTPlayerReplicationInfo* GetUTPlayerReplicationInfo ( );
    float AdjustedStrength ( );
    void AdjustPPEffects ( class AUTPlayerController* PC, unsigned long bRemove );
};

// Class UTGame.GFxMinimapHud
// 0x0100 (0x027C - 0x017C)
class UGFxMinimapHud : public UGFxMoviePlayer
{
public:
    class AWorldInfo*                                  ThisWorld;                                                // 0x017C (0x0004) [0x0000000000000000]              
    class UGFxMinimap*                                 Minimap;                                                  // 0x0180 (0x0004) [0x0000000000000000]              
    float                                              Radius;                                                   // 0x0184 (0x0004) [0x0000000000000000]              
    float                                              CurZoomf;                                                 // 0x0188 (0x0004) [0x0000000000000000]              
    float                                              NormalZoomf;                                              // 0x018C (0x0004) [0x0000000000000000]              
    float                                              MaxZoomf;                                                 // 0x0190 (0x0004) [0x0000000000000000]              
    float                                              MinZoomf;                                                 // 0x0194 (0x0004) [0x0000000000000000]              
    struct FHeEnDisplay                                PlayerHE;                                                 // 0x0198 (0x0024) [0x0000000000000000]              
    struct FHeEnDisplay                                VehicleHE;                                                // 0x01BC (0x0024) [0x0000000000000000]              
    class UGFxObject*                                  LogMC;                                                    // 0x01E0 (0x0004) [0x0000000000000000]              
    TArray< struct FMessageRow >                       Messages;                                                 // 0x01E4 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
    TArray< struct FMessageRow >                       FreeMessages;                                             // 0x01F0 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
    float                                              MessageHeight;                                            // 0x01FC (0x0004) [0x0000000000000000]              
    int                                                NumMessages;                                              // 0x0200 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  PlayerStatsMC;                                            // 0x0204 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  TeamStatsMC;                                              // 0x0208 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  TimeTF;                                                   // 0x020C (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  CenterTextMC;                                             // 0x0210 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  CenterTextTF;                                             // 0x0214 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  EnemyNameTF;                                              // 0x0218 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  OffhandsAndFlagMC;                                        // 0x021C (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  CreditsAndStreaksMC;                                      // 0x0220 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  HitLocMC[ 0x8 ];                                          // 0x0224 (0x0020) [0x0000000000000000]              
    class UGFxObject*                                  MultiKillN_TF;                                            // 0x0244 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  MultiKillMsg_TF;                                          // 0x0248 (0x0004) [0x0000000000000000]              
    class UGFxObject*                                  MultiKillMC;                                              // 0x024C (0x0004) [0x0000000000000000]              
    class AUTVehicle*                                  LastVehicle;                                              // 0x0250 (0x0004) [0x0000000000000000]              
    class AUTWeapon*                                   LastWeapon;                                               // 0x0254 (0x0004) [0x0000000000000000]              
    int                                                LastAmmoCount;                                            // 0x0258 (0x0004) [0x0000000000000000]              
    int                                                LastScore[ 0x2 ];                                         // 0x025C (0x0008) [0x0000000000000000]              
    unsigned char                                      LastFlagHome[ 0x2 ];                                      // 0x0264 (0x0002) [0x0000000000000000]              
    class AUTPlayerReplicationInfo*                    LastEnemy;                                                // 0x0268 (0x0004) [0x0000000000000000]              
    class AUTPlayerReplicationInfo*                    LastFlagCarrier[ 0x2 ];                                   // 0x026C (0x0008) [0x0000000000000000]              
    class AUTGameReplicationInfo*                      GRI;                                                      // 0x0274 (0x0004) [0x0000000000000000]              
    unsigned long                                      bIsTeamHUD : 1;                                           // 0x0278 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bDrawWeaponCrosshairs : 1;                                // 0x0278 (0x0004) [0x0000000000000000] [0x00000002] 

private:
    static UClass* pClassPointer;

public:
    static UClass* StaticClass()
    {
        if ( ! pClassPointer )
            pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1472 ];

        return pClassPointer;
    };

    void AddDeathMessage ( class APlayerReplicationInfo* Killer, class APlayerReplicationInfo* Killed, class UClass* Dmg );
    struct FString GetRank ( class APlayerReplicationInfo* PRI );
    void SetCenterText ( struct FString Text );
    void ShowMultiKill ( int N, struct FString msg );
    void DisplayHit ( struct FVector HitDir, int Damage, class UClass* DamageType );
    void MinimapZoomIn ( );
    void MinimapZoomOut ( );
    void ToggleCrosshair ( unsigned long bToggle );
    void TickHud ( float DeltaTime );
    void UpdateGameHUD ( class AUTPlayerReplicationInfo* PRI );
    void AddMessage ( struct FString Type, struct FString msg );
    void RemoveMessage ( );
    void ClearStats ( unsigned long clearScores );
    struct FString FormatTime ( int Seconds );
    void UpdateEnergy ( float NewEnergy, float EnergyMax, struct FHeEnDisplay* Info );
    void UpdateHealth ( float NewHealth, float HealthMax, struct FHeEnDisplay* Info );
    void LoadHeEn ( struct FString Base, struct FHeEnDisplay* Info );
    void Init ( class ULocalPlayer* Player );
    class UGFxObject* InitMessageRow ( );
    class UGFxObject* CreateMessageRow ( );
    void SetAmmoCountTF ( class AWeapon* Wep, struct FString Ammo );
    void registerMiniMapView ( class UGFxMinimap* MC, float R );
};

// Class UTGame.UTCarriedObject
// 0x00EC (0x0304 - 0x0218)
class AUTCarriedObject : public AUDKCarriedObject
{
public:
    unsigned long                                      bLastSecondSave : 1;                                      // 0x0218 (0x0004) [0x0000000000000000] [0x00000001] 
    unsigned long                                      bLeavingDroppedState : 1;                                 // 0x0218 (0x0004) [0x0000000000000000] [0x00000002] 
    unsigned long                                      bUseTeamColorForIcon : 1;                                 // 0x0218 (0x0004) [0x0000000000000000] [0x00000004] 
    float                                              TossDistance;                                             // 0x021C (0x0004) [0x0000000000000000]              
    class AUTPlayerReplicationInfo*                    HolderPRI;                                                // 0x0220 (0x0004) [0x0000000000000020]              ( CPF_Net )
    class APawn*                                       Holder;                                                   // 0x0224 (0x0004) [0x0000000000000000]              
    float                                              TakenTime;                                                // 0x0228 (0x0004) [0x0000000000000000]              
    float                                              MaxDropTime;                                              // 0x022C (0x0004) [0x0000000000000000]              
    class AController*                                 FirstTouch;                                               // 0x0230 (0x0004) [0x0000000000000000]              
    TArray< class AController* >                       Assists;                                                  // 0x0234 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              MapSize;                                                  // 0x0240 (0x0004) [0x0000000000000000]              
    struct FTextureCoordinates                         IconCoords;                                               // 0x0244 (0x0010) [0x0000000000000000]              
    class UTexture2D*                                  IconTexture;                                              // 0x0254 (0x0004) [0x0000000000000000]              
    struct FName                                       GameObjBone3P;                                            // 0x0258 (0x0008) [0x0000000000000000]              
    struct FVector                                     GameObjOffset3P;                                          // 0x0260 (0x000C) [0x0000000000000000]              
    struct FRotator                                    GameObjRot3P;                                             // 0x026C (0x000C) [0x0000000000000000]              
    struct FVector                                     GameObjOffset1P;                                          // 0x0278 (0x000C) [0x0000000000000000]              
    struct FRotator                                    GameObjRot1P;                                             // 0x0284 (0x000C) [0x0000000000000000]              
    class USoundCue*                                   PickupSound;                                              // 0x0290 (0x0004) [0x0000000000000000]              
    class USoundCue*                                   DroppedSound;                                             // 0x0294 (0x0004) [0x0000000000000000]              
    class USoundCue*                                   ReturnedSound;                                            // 0x0298 (0x0004) [0x0000000000000000]              
    class APawn*                                       OldHolder;                                                // 0x029C (0x0004) [0x0000000000000000]              
    class UPointLightComponent*                        FlagLight;                                                // 0x02A0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
    float                                              DefaultRadius;                                            // 0x02A4 (0x0004) [0x0000000000000000]              
    float                                              DefaultHeight;                                            // 0x02A8 (0x0004) [0x0000000000000000]              
    TArray< struct FObjectiveAnnouncementInfo >        NeedToPickUpAnnouncements;                                // 0x02AC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
    float                                              HighlightScale;                                           // 0x02B8 (0x0004) [0x0000000000000000]              
    float                                              MaxHighlightScale;                                        // 0x02BC (0x0004) [0x0000000000000000]              
    float                                              HighlightSpeed;                                           // 0x02C0 (0x0004) [0x0000000000000000]              
    float                                              LastHighlightUpdate;                                      // 0x02C4 (0x0004) [0x0000000000000000]              
    float                                              LastFlagSeeTime;                                          // 0x02C8 (0x0004) [0x0000000000000000]              
    int                                                LastSeeMessageIndex;                                      // 0x02CC (0x0004) [0x0000000000000000]              
    struct FLinearColor                                RedColor;                                                 // 0x02D0 (0x0010) [0x0000000000000000]              
    struct FLinearColor                                BlueColor;                                                // 0x02E0 (0x0010) [0x0000000000000000]              
    struct FLinearColor                                GoldColor;                                                // 0x02F0 (0x0010) [0x0000000000000000]              
